{
"Mbinu bora za uzalishaji wa vifaranga": {
        "Utangulizi": {
          "chapter_title": "Utangulizi",
          "content": "### Utangulizi\nUzazi wa vifaranga ni kipengele muhimu katika ufugaji wa kuku, kwani unahakikisha uendelezaji wa wingi wa mifugo na kuongeza tija ya mradi. Wafugaji wanapaswa kuelewa mchakato mzima: kuanza na mayai bora, kuatamia, malezi ya vifaranga wachanga, na kuimarisha afya zao.\n\n---\n### Lengo la sura hii\n- Kuelewa mbinu bora za uzalishaji wa vifaranga.\n- Kutunza mayai na vifaranga kwa njia inayoongeza uwezekano wa kupona na ukuaji mzuri.\n- Kuandaa mfugaji anayeanza kufuata hatua zenye tija."
        },
        "Uchaguzi wa mayai bora kwa uatamiaji": {
          "chapter_title": "Uchaguzi wa Mayai Bora kwa Uatamiaji",
          "content": "### Kigezo cha kuchagua mayai\n1. **Afya ya mzazi:** Tumia mayai yanayotokana na kuku wenye afya njema, huru kutoka magonjwa.\n2. **Umri wa mzazi:** Kuku wazuri kwa uzalishaji wa mayai wachanga ni wale wenye umri wa 6–12 mwezi.\n3. **Ukubwa na umbo la yai:** Mayai yenye umbo zuri, yenye kengele nzuri, na uzito unaofaa hutoa vifaranga bora.\n4. **Tayari kwa kuatamia:** Mayai yasiyo na doa, cracks, au mapungufu yoyote yanapendekezwa.\n\n### Ukaguzi kabla ya kuweka mayai\n- Fanya **candling** (kuangalia ndani ya yai kwa mwanga) kuhakikisha hakuna majeraha ndani.\n- Chagua mayai yenye **rangi ya kawaida, yolk thabiti, na membrane imara**."
        },
        "Mbinu za kuatamia mayai": {
          "chapter_title": "Mbinu za Kuatamia Mayai",
          "content": "### 1. Kuatamia kwa mama kuku (Natural incubation)\n- Weka mayai kwa mama kuku mwenye umri mzuri na afya njema.\n- Hakikisha **bandi la kutosha, safi, na lenye hewa nzuri**.\n- Mama kuku huzungusha mayai kila siku kuleta joto sawa.\n- Faida: Inapunguza gharama na huimarisha kinga ya asili ya vifaranga.\n\n### 2. Kuatamia kwa mashine (Artificial incubation)\n- Tumia incubator yenye **joto la kawaida 37.5–38°C** na unyevu 55–60%.\n- Geuza mayai angalau mara 3–5 kwa siku ili kuzuia yai kushikamana ndani.\n- Angalia incubator mara kwa mara kuhakikisha inafanya kazi ipasavyo.\n- Faida: Inaruhusu kuatamia mayai mengi kwa wakati mmoja na kudhibiti matokeo.\n\n### Mbinu ya mchanganyiko\n- Wafugaji wengi wanachanganya njia mbili: mayai machache sana kwa mama kuku na mabaki kwa incubator ili kuongeza tija."
        },
        "Malezi ya vifaranga baada ya kenguliwa": {
          "chapter_title": "Malezi ya Vifaranga Baada ya Kenguliwa",
          "content": "### Mahitaji ya msingi\n1. **Joto:** Weka vifaranga wachanga kwenye brooder yenye joto 32–35°C kwa wiki ya kwanza, kisha punguza hatua kwa hatua.\n2. **Maji safi:** Kutoa maji ya kutosha kila siku, hakikisha hayana sumu.\n3. **Lishe:** Anza na starter feed yenye protini 18–20% kwa wiki 0–8.\n4. **Usafi:** Safisha brooder kila siku, toa kinyesi na mabaki ya chakula.\n\n### Afya na kinga\n- Tenga wagonjwa ili wasiene. \n- Angalia dalili za magonjwa kama kupoteza hamu, kutapika au kuishiwa nguvu.\n- Tumia chanjo na dawa za kinga kama ilivyoelezwa katika sura ya chanjo.\n\n### Ukuaji na ufuatiliaji\n- Kagua uzito wa vifaranga mara kwa mara.\n- Rekodi ukuaji, tabia, na afya ili kubaini changamoto mapema.\n- Weka mwanga wa kutosha kwa saa 20 kwa siku ya wiki ya kwanza, kisha punguza hadi 16–18."
        },
        "Hitimisho": {
          "chapter_title": "Hitimisho",
          "content": "### Muhtasari\nMbinu bora za uzalishaji wa vifaranga zinahakikisha uendelezaji wa mifugo wenye afya na uzalishaji wa mayai na nyama wenye tija. Hatua kuu ni: \n1. Kuchagua mayai yenye afya na ubora.\n2. Kuatamia kwa njia sahihi (natural au artificial).\n3. Malezi makini ya vifaranga wachanga na lishe bora.\n4. Ufuatiliaji wa afya na ukuaji.\n\n**Mfugaji anayefuata hatua hizi kwa nidhamu ana nafasi kubwa ya kupata vifaranga vingi, wenye afya njema, na kuongeza faida ya mradi wake.**"
        }
      }
}