{
  "Mr Hurry and the Phone That Ate Bread": {
    "Introduction": {
      "chapter_title": "Welcome to Mcheche Village",
      "content": "In the small village of Mcheche, everyone knew one man: Bwana Haraka. He was called Haraka because he was always running. Running to work, running to church, running to the shop, running to the toilet. But somehow, he was still late for everything.\n\n![Bwana Haraka running with phone](https://picsum.photos/seed/bwana-haraka-running/800/600)\n\nOne day he bought the newest phone in Dar es Salaam – a shiny Samsung Galaxy Ultra Mega Plus. He loved it more than his own children. He even kissed it goodnight.\n\nLittle did he know… this phone had a very strange habit."
    },
    "Chapter 1": {
      "chapter_title": "The Day the Phone Discovered Chapati",
      "content": "Bwana Haraka grabbed his fresh chapati from Mama Ntilie, put on his shoes, and ran out the door.\n\nWhile running to the daladala stand, he took out his new phone to check WhatsApp. The phone slipped, fell straight onto the chapati, and… CHOMP!\n\n![Phone biting a chapati with teeth marks](https://picsum.photos/seed/phone-eating-chapati/800/600)\n\nThe phone ate the entire chapati in 3 seconds flat.\n\nBwana Haraka screamed, 'Wewe! My breakfast!' The phone just showed a smiling emoji and said, 'Yummy 😋' on the screen."
    },
    "Chapter 2": {
      "chapter_title": "Breakfast Disaster at 200 km/h",
      "content": "The next morning, he tied the chapati with seven knots and held it in his teeth while running.\n\nThe phone saw the chapati in his mouth and… ZOOM! It flew out of his hand like a missile and swallowed everything – plastic, knots, and all.\n\n![Phone flying towards chapati like a shark](https://picsum.photos/seed/phone-attacking-food/800/600)\n\nNow the phone started burping notifications: 'Burp… new message… burp… low battery.'\n\nThe whole daladala laughed until they cried."
    },
    "Chapter 3": {
      "chapter_title": "The Phone Joins WhatsApp Food Group",
      "content": "By the third day, the phone had joined every food group in Tanzania. Every time someone posted ugali, nyama choma or chipsi mayai, the phone would vibrate and drool on the screen.\n\n![Phone screen covered in food emojis and drool](https://picsum.photos/seed/hungry-phone-screen/800/600)\n\nBwana Haraka’s boss wrote: 'Come to office NOW!' The phone read 'NOW' as 'NAAN' and ate the message."
    },
    "Chapter 4": {
      "chapter_title": "Village Meeting: Should We Ban Bread Near Phones?",
      "content": "Emergency village meeting under the mango tree.\n\nMzee Koba: “This phone tried to eat my mandazi during video call!”\nMama Fatuma: “It stole my child’s biscuit!”\n\nThey passed a law: No chapati, mandazi or vitumbua within 2 metres of Bwana Haraka’s phone!\n\n![Village elders holding emergency meeting about phones](https://picsum.photos/seed/village-elders-angry/800/600)"
    },
    "Chapter 5": {
      "chapter_title": "Mr Hurry vs Samsung – The Final Bite",
      "content": "That night Bwana Haraka made 50 chapatis, stacked them like a mountain, and left the phone on top as bait.\n\nIn the morning… phone gone! Only a small note:\n\n'Thank you for the buffet ❤️ Battery 100% for 10 years!'\n\n![Empty plate with only crumbs and a tiny thank-you note](https://picsum.photos/seed/empty-plate-thankyou/800/600)"
    },
    "Conclusion": {
      "chapter_title": "The Moral of the Story",
      "content": "From that day, Bwana Haraka walks slowly, eats his chapati first, then checks his phone.\n\nAnd somewhere in the clouds, there is one very fat, very happy Samsung that never needs charging again.\n\n![Fat happy phone floating in heaven](https://picsum.photos/seed/happy-fat-phone/800/600)\n\nThe end.\n\n(But at night, people in Mcheche still hear a quiet burp from the sky…)"
    }
  }
}
