{
  "The Boy Who Sold His Shadow": {
    "Introduction": {
      "chapter_title": "Juma and His Perfect Shadow 🌞",
      "content": "Juma was twelve years old and lived in a dusty little town.\n\nHe had the most beautiful shadow in the world: tall, straight, and always dancing when he walked.\n\nEvery afternoon, children followed him just to watch his shadow play on the walls.\n\nJuma was proud of it.\n\nOne day, a rich stranger in a shiny car stopped beside him.\n\n“I will give you one million shillings for your shadow,” the man said.\n\nJuma laughed… then stopped laughing.\n\nOne million was a lot of money."
    },

    "Chapter 1": {
      "chapter_title": "The Deal is Made 💰",
      "content": "The stranger opened a black suitcase full of crisp notes.\n\nJuma’s eyes became big.\n\nHe thought: With this money Mama can stop washing clothes. We can fix the roof. I can go to school.\n\nHe said, “Okay. Take my shadow.”\n\nThe man smiled, took out silver scissors, and cut the shadow from Juma’s feet.\n\nIt hurt like ice.\n\n![Man cutting shadow with silver scissors](https://picsum.photos/seed/shadow-cut-scissors/800/600)\n\nThe shadow rolled up like black cloth and went into the suitcase.\n\nThe car drove away."
    },

    "Chapter 2": {
      "chapter_title": "Life Without a Shadow 🕳️",
      "content": "At first everyone was happy.\n\nMama bought a new roof. Juma wore shoes for the first time.\n\nBut soon strange things started.\n\n- Dogs barked at him\n- Birds flew away scared\n- His own mother sometimes looked past him like he was not there\n\nAt noon, when shadows are shortest, Juma disappeared completely.\n\n![Boy with no shadow at noon](https://picsum.photos/seed/juma-no-shadow-noon/800/600)\n\nHe felt cold even in the sun."
    },

    "Chapter 3": {
      "chapter_title": "The Shadow Becomes Famous ⭐",
      "content": "The rich man took Juma’s shadow to the city.\n\nHe put it in a glass box in the biggest mall.\n\nTicket: 500 shillings to see “The Perfect Dancing Shadow”.\n\nPeople came from everywhere. The shadow danced day and night under bright lights.\n\nIt became more famous than any singer.\n\nBut every night, the shadow pressed its hands against the glass and cried silent tears.\n\n![Shadow crying inside glass box](https://picsum.photos/seed/shadow-cry-glass/800/600)"
    },

    "Chapter 4": {
      "chapter_title": "Juma Goes to Find His Shadow 🚶‍♂️",
      "content": "Juma saved bus money for months.\n\nHe travelled to the city alone.\n\nWhen he reached the mall, he stood in front of the glass box.\n\nThe shadow saw him and started jumping with joy.\n\nJuma pressed his hand on the glass. The shadow pressed back.\n\nJuma whispered, “I am sorry. I will bring you home.”\n\n![Boy and shadow touching through glass](https://picsum.photos/seed/boy-shadow-glass/800/800/600)"
    },

    "Chapter 5": {
      "chapter_title": "The Shadow Comes Home ❤️",
      "content": "That night Juma waited until the mall closed.\n\nHe broke the glass with a stone.\n\nThe shadow ran to him and wrapped around his feet like a warm blanket.\n\nJuma felt whole again.\n\nThe million shillings? He left every coin on the floor.\n\nHe only wanted his shadow back.\n\n![Shadow hugging boy’s feet](https://picsum.photos/seed/shadow-hug-feet/800/600)"
    },

    "Conclusion": {
      "chapter_title": "Happy Again 🌈",
      "content": "Juma returned to his town poorer but warmer.\n\nHis shadow danced bigger and happier than ever.\n\nNow when children ask, “Why is your shadow the best?”\n\nJuma smiles and answers:\n\n“Because it travelled the world and chose to come home.”\n\nAnd every afternoon, the shadow waves at the sky as if saying thank you for letting it go and thank you for bringing it back.\n\nThe end.\n\n![Boy and happy shadow dancing together](https://picsum.photos/seed/juma-happy-dance/800/600)"
    }
  }
}
