{
  "The Genie Who Wanted a Government Job": {
    "Introduction": {
      "chapter_title": "A Very Modern Genie",
      "content": "Ali was a poor fisherman. One day he pulled up an old lamp from the sea.\n\nHe rubbed it. POOF! A big smoke and a genie appeared.\n\nThe genie wore sunglasses and a smart shirt.\n\nHe said, “Thank you for freeing me! I will give you three wishes!”\n\nAli thought for two seconds and answered…"
    },

    "Chapter 1": {
      "chapter_title": "No Money, No Cars – I Want a Job!",
      "content": "Ali said, “I don’t want gold or a big house.\n\nI want a permanent government job with salary, medical cover, and pension!”\n\n![Genie looking confused](https://picsum.photos/seed/genie-confused-job/800/600)\n\nThe genie scratched his head.\n\n“Brother, I have been in that lamp for 2,000 years. Government forms are harder than magic!”"
    },

    "Chapter 2": {
      "chapter_title": "Filling Forms for 24 Hours a Day",
      "content": "The genie worked day and night.\n\nHe printed Form Four results, birth certificate, NIDA number, and even a letter from the street chairman.\n\nHe stood in queue from 4 AM.\n\nAt the office window the clerk said, “Come back tomorrow.\n\n![Genie in long government queue](https://picsum.photos/seed/genie-queue-office/800/600)\n\nThe genie cried real tears."
    },

    "Chapter 3": {
      "chapter_title": "The Interview Day Disaster",
      "content": "Finally the interview day came.\n\nThe panel asked Ali, “Why do you want this job?”\n\nBefore Ali could speak, the genie became angry and shouted,\n\n“Because I can make all of you disappear with one clap!”\n\n![Genie angry at interview panel](https://picsum.photos/seed/genie-angry-interview/800/600)\n\nPOOF! The three interviewers turned into green frogs.\n\nThey jumped out the window. Ribbit! Ribbit!"
    },

    "Chapter 4": {
      "chapter_title": "Corruption Investigation",
      "content": "Police came to arrest the genie for turning officers into frogs.\n\nGenie said, “They asked for tea money first! I only granted their wish!”\n\n![Police arresting surprised genie](https://picsum.photos/seed/police-arrest-genie/800/600)\n\nThe case went to court. The judge also asked for a small gift.\n\nPOOF! The judge became a goat."
    },

    "Chapter 5": {
      "chapter_title": "Genie Becomes Minister of Magic",
      "content": "The president saw everything on TV.\n\nHe called the genie to the State House and said,\n\n“We need someone like you! Be my Minister of Magic!”\n\nThe genie got a big office, driver, and free fuel.\n\n![Genie happy in big office with flag](https://picsum.photos/seed/genie-minister-office/800/600)\n\nHis first law: Every Friday is Wish Day for good children."
    },

    "Conclusion": {
      "chapter_title": "Happy Ending for Everyone",
      "content": "Ali got his government job (driver for the new minister).\n\nThe frogs and goat became human again after saying sorry.\n\nThe genie now wears suit and tie every day.\n\n![Genie waving from government car](https://picsum.photos/seed/genie-government-car/800/600)\n\nMoral of the story:\nEven magic cannot beat government forms… but it can make you a minister!\n\nThe end."
    }
  }
}
