{
  "The Old Craftsman Who Bought WiFi for a Snake": {
    "Introduction": {
      "chapter_title": "Mzee Fundi and His Unusual Tenant",
      "content": "Everyone in Kijijini knew Mzee Fundi – the best carpenter in the whole of Tanga region. He was 82 years old, wore the same blue overall for 20 years, and shared his workshop with one very special tenant: a huge black cobra that lived under the workbench.\n\nMzee Fundi called the snake ‘Bwana Nyoka’. He greeted him every morning with a respectful “Shikamoo, Bwana Nyoka” and the snake would nod back.\n\nOne day Mzee Fundi noticed something strange…"
    },

    "Chapter 1": {
      "chapter_title": "The Day the Snake Started Saying “Password”",
      "content": "Mzee Fundi arrived at the workshop and said his usual “Shikamoo!”\n\nInstead of nodding, the cobra lifted its head and hissed:\n\n“Pass… word… ni… gani…?”\n\n![Shocked old man hearing snake talk](https://picsum.photos/seed/shocked-mzee-snake/800/600)\n\nMzee Fundi dropped his hammer. “Wewe unazungumza?! Since when?!”\n\nThe snake flicked its tongue and replied slowly: “Since… nimechoka… kuwa… offline…”"
    },

    "Chapter 2": {
      "chapter_title": "Installing a Router in a Cobra’s Hole",
      "content": "Mzee Fundi didn’t hesitate. He went straight to the Vodacom shop.\n\n“Nataka WiFi bundle ya unlimited!”\n\nShop lady: “How many devices, babu?”\n\nMzee Fundi: “Moja tu… lakini ni nyoka.”\n\n![Shop attendant confused by old man buying WiFi for snake](https://picsum.photos/seed/confused-vodacom-lady/800/600)\n\nHalf an hour later he came back with a router, 50-metre LAN cable, and a power bank. He drilled a tiny hole next to Bwana Nyoka’s home and installed the router inside the wall.\n\nPassword: **Shikamoo123**"
    },

    "Chapter 3": {
      "chapter_title": "Netflix and Chill… Literally",
      "content": "That evening the workshop lights were off, but the router was blinking blue.\n\nMzee Fundi peeped through the window and saw this:\n\n- The cobra wearing tiny sunglasses\n- Watching **Money Heist** on a cracked tablet\n- Eating popcorn (yes, real popcorn)\n\n![Cobra wearing sunglasses watching Netflix](https://picsum.photos/seed/cobra-netflix-sunglasses/800/600)\n\nEvery time Tokyo appeared on screen, the snake would hiss “Ayyyy Tokyo mi amor!”"
    },

    "Chapter 4": {
      "chapter_title": "Bwana Nyoka Becomes an Instagram Influencer",
      "content": "Within a week the snake had:\n\n- 87k followers @bwana_nyoka_official\n- Blue tick\n- Brand deals with Cobra Energy Drink\n\nHis most viral reel: slow-motion hood flare set to “Waka Waka” by Shakira.\n\n![Snake taking selfie with iPhone](https://picsum.photos/seed/snake-influencer-selfie/800/600)\n\nCaption: “Living my best life. Thanks to my human @mzee_fundi”"
    },

    "Chapter 5": {
      "chapter_title": "The Day Vodacom Sent a Bill to Mr Sssssslither",
      "content": "End of the month, a Vodacom envelope arrived:\n\n“To: Mr Sssssslither\nAddress: Under the workbench, Kijijini Workshop”\n\nBill: 187,000 TShs – 4.7 TB data used!\n\nBreakdown:\n- Netflix 4K → 2.1 TB\n- TikTok → 1.8 TB\n- Snake porn → 0.8 TB (don’t ask)\n\n![Vodacom bill addressed to snake](https://picsum.photos/seed/vodacom-bill-snake/800/600)\n\nMzee Fundi paid without complaining. “Education is expensive,” he said."
    },

    "Conclusion": {
      "chapter_title": "Happily Ever After… With Good Internet",
      "content": "Today Mzee Fundi and Bwana Nyoka are best friends.\n\nThe workshop now has fibre optic, a second router just in case.\n\nNeighbours no longer fear the snake – they fear missing his 8 PM Instagram Live.\n\n![Mzee Fundi and snake taking selfie together](https://picsum.photos/seed/mzee-and-cobra-selfie/800/600)\n\nMoral of the story:\nNever say “Hakuna kitu” when an old man tells you his snake needs WiFi.\n\nThe end."
    }
  }
}
