{  "CSS - SERIES2": {
  "PHYSICS": {
    "chapter_title": "Physics - Examination",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n031 PHYSICS - PAPER 2\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of Sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written clearly.\n5. All writing must be in blue or black ink; diagrams in pencil.\n6. Calculators and cellular phones are not allowed.\n7. Write your Assessment Number at the top right corner of every page.\n8. Constants:\n   Acceleration due to gravity, g = 10 m/s²\n   Density of water = 1000 kg/m³\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i)–(x), write the correct answer beside the item number.\n\n   (i) SI unit of energy is\n   - A. Watt\n   - B. Joule\n   - C. Newton\n   - D. Pascal\n\n   (ii) The force that opposes motion is called\n   - A. Gravity\n   - B. Friction\n   - C. Tension\n   - D. Buoyancy\n\n   (iii) A concave lens always forms an image that is\n   - A. Virtual and erect\n   - B. Real and inverted\n   - C. Real and erect\n   - D. Virtual and inverted\n\n   (iv) The process of converting a liquid to vapour at all temperatures is called\n   - A. Evaporation\n   - B. Boiling\n   - C. Condensation\n   - D. Sublimation\n\n   (v) Instrument for measuring potential difference is\n   - A. Ammeter\n   - B. Voltmeter\n   - C. Ohmmeter\n   - D. Galvanometer\n\n   (vi) The slope of a distance-time graph gives\n   - A. Acceleration\n   - B. Velocity\n   - C. Displacement\n   - D. Force\n\n   (vii) Momentum of a 2 kg mass moving at 5 m/s is\n   - A. 10 kg·m/s\n   - B. 7 kg·m/s\n   - C. 5 kg·m/s\n   - D. 12 kg·m/s\n\n   (viii) The bending of waves around corners is called\n   - A. Diffraction\n   - B. Reflection\n   - C. Refraction\n   - D. Interference\n\n   (ix) Electric power is calculated by\n   - A. P = VI\n   - B. P = I/R\n   - C. P = V/R\n   - D. P = V + I\n\n   (x) Frequency is the reciprocal of\n   - A. Time period\n   - B. Wavelength\n   - C. Velocity\n   - D. Acceleration\n\n2. Match List A with List B:\n\n   List A\n   (i) Boyle’s Law\n   (ii) Archimedes’ Principle\n   (iii) Ohm’s Law\n   (iv) Newton’s Third Law\n   (v) Law of Reflection\n\n   List B\n   A. Action–Reaction\n   B. Current is proportional to voltage / resistance\n   C. Pressure × Volume = constant (at constant T)\n   D. Buoyant force = weight of fluid displaced\n   E. Angle of incidence = angle of reflection\n\n3. (a) Define power in physics.\n   (b) A machine does 2000 J of work in 40 s. Calculate the power.\n\n4. (a) State Newton’s first law of motion.\n   (b) A ball of mass 0.5 kg is acted upon by a net force of 10 N. Find its acceleration.\n\n5. (a) Define latent heat of fusion.\n   (b) Calculate heat required to melt 0.2 kg of ice. Latent heat of fusion of ice = 3.4 × 10^5 J/kg.\n\n6. (a) Draw and label a simple circuit with battery, resistor, switch, and ammeter.\n   (b) State two safety precautions when using electrical circuits.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. Explain with examples the difference between speed and velocity.\n\n8. (a) A cube of side 0.1 m has mass 2 kg. Determine its density and whether it floats in water.\n   (b) If it floats, calculate the fraction of volume submerged.\n\n9. (a) Define efficiency of a device and its formula.\n   (b) A machine absorbs 5000 J of energy and does 4000 J useful work. Calculate efficiency.\n\n10. (a) Describe formation of a real image by a convex lens when object is beyond 2F.\n    (b) Draw a ray diagram to show this image.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to determine the acceleration due to gravity using a simple pendulum.\n    (b) Length of pendulum = 1 m, period = 2 s. Estimate g.\n    (c) State three precautions to improve accuracy of the experiment."
  },
"PAnswers": {
    "chapter_title": "Physics - Answers Paper 2",
    "content": "SECTION A\n\n1. Multiple choice answers (with explanations)\n\n(i) B. Joule — Energy is measured in joules (J), which is the work done when a force of one newton moves an object 1 meter in the direction of the force.\n\n(ii) B. Friction — Friction is the resistive force that opposes relative motion between two surfaces in contact.\n\n(iii) A. Virtual and erect — A concave lens always produces an image that is upright (erect) and cannot be projected on a screen (virtual).\n\n(iv) A. Evaporation — Evaporation is the process by which liquid changes to vapour at temperatures below its boiling point.\n\n(v) B. Voltmeter — A voltmeter measures the potential difference between two points and must be connected in parallel.\n\n(vi) B. Velocity — The slope of a distance-time graph gives the speed or velocity of an object. Slope = rise/run = Δdistance/Δtime.\n\n(vii) A. 10 kg·m/s — Momentum, p = mass × velocity. p = 2 × 5 = 10 kg·m/s.\n\n(viii) A. Diffraction — Diffraction is the bending of waves (light, sound, etc.) around obstacles or through openings.\n\n(ix) A. P = VI — Electric power is the product of potential difference and current.\n\n(x) A. Time period — Frequency f = 1/T, where T is the time period.\n\n2. Matching\n\n(i) C; (ii) D; (iii) B; (iv) A; (v) E\n\nExplanations:\n- Boyle’s law (C): At constant temperature, pressure × volume = constant.\n- Archimedes’ principle (D): Buoyant force = weight of fluid displaced.\n- Ohm’s law (B): Current is proportional to voltage / resistance.\n- Newton’s third law (A): Action–reaction; every action has equal and opposite reaction.\n- Law of reflection (E): Angle of incidence = angle of reflection.\n\n3. Work and power\n\n(a) Definition: Power is the rate at which work is done or energy is transferred. P = W/t, units = watt (W).\n\n(b) Calculation: W = 2000 J, t = 40 s.\n- P = W/t = 2000/40 = 50 W.\n\nExplanation: Power indicates how fast work is done.\n\n4. Newton’s first law and application\n\n(a) Statement: An object will remain at rest or continue to move at constant velocity unless acted upon by a net external force.\n\n(b) Calculation: F = 10 N, m = 0.5 kg.\n- a = F/m = 10/0.5 = 20 m/s².\n\nExplanation: Acceleration is proportional to net force and inversely proportional to mass.\n\n5. Latent heat of fusion\n\n(a) Definition: Latent heat of fusion is the heat energy required to change 1 kg of a solid into liquid at constant temperature.\n\n(b) Calculation: Q = m × Lf = 0.2 × 3.4 × 10^5 = 68000 J.\n\nExplanation: No temperature change occurs during the phase change; energy is used to break molecular bonds.\n\n6. Electric circuit and safety\n\n(a) Diagram description: Battery (cell) connected to resistor R; ammeter A in series; switch S; wires connecting all components. Labels clearly shown.\n\n(b) Safety precautions:\n- Switch off power before adjusting circuit.\n- Avoid touching live wires and use components rated for current.\n\nSECTION B\n\n7. Speed vs velocity\n\nExplanation: \n- Speed is a scalar quantity, giving magnitude only; average speed = total distance / total time.\n- Velocity is a vector quantity, giving both magnitude and direction; average velocity = displacement / time.\n- Example: If a car moves 100 m east in 10 s, speed = 10 m/s, velocity = 10 m/s east.\n\n8. Density and floating\n\n(a) Calculation:\n- Volume V = 0.1³ = 0.001 m³\n- Mass m = 2 kg\n- Density ρ = m/V = 2 / 0.001 = 2000 kg/m³\n- Since ρ > 1000 kg/m³, cube is denser than water → sinks.\n\n(b) Fraction submerged: Not applicable (sinks entirely).\n\nExplanation: Floating occurs if object density < fluid density; otherwise, it sinks.\n\n9. Efficiency\n\n(a) Definition: Efficiency = (useful energy output / total energy input) × 100%.\n\n(b) Calculation: useful = 4000 J, input = 5000 J\n- Efficiency = (4000/5000) × 100% = 80%.\n\nExplanation: 20% of energy lost as heat, friction, etc.\n\n10. Convex lens real image\n\n(a) Description: Object beyond 2F forms a real, inverted, and diminished image between F and 2F on the opposite side. Real image can be projected on screen.\n\n(b) Ray diagram description: Principal axis, convex lens, F points marked. Ray 1: parallel to axis, refracted through far focal point. Ray 2: through centre of lens, straight. Intersection of rays on opposite side forms real image.\n\nSECTION C\n\n11. Simple pendulum experiment\n\n(a) Steps:\n1. Suspend a small dense bob from a string of known length L.\n2. Pull bob to small angle and release; start timing.\n3. Measure time for multiple oscillations to reduce error.\n4. Calculate period T = total time / number of oscillations.\n5. Use formula g = 4π²L/T² to determine acceleration due to gravity.\n\n(b) Calculation: L = 1 m, T = 2 s\n- g = 4π² × 1 / 2² = 4π² / 4 ≈ 9.87 ≈ 10 m/s²\n\n(c) Precautions:\n- Small oscillation angle (<15°) to ensure simple harmonic motion.\n- Measure length L accurately from pivot to centre of mass of bob.\n- Use precise timing instruments; repeat measurements to get average.\n\nExplanation: These precautions minimize errors from amplitude, measurement, and reaction time.\n\nTEACHER NOTES\n\n- Ensure students show units at every step.\n- Draw labelled diagrams for all optics and circuits questions.\n- Method marks should be awarded even if final numerical answers have minor arithmetic mistakes.\n\nEnd of Answers."
  },
  "CHEMISTRY": {
    "chapter_title": "Chemistry - Examination",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 2\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. Write all answers clearly in the spaces provided.\n4. Chemical symbols and formulae must be correct.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions.\n\n1. For each of the items (i)–(x), choose the correct answer and write its letter beside the item number.\n\n   (i) Which of the following is a physical change?\n   - A. Burning wood\n   - B. Melting butter\n   - C. Rusting of iron\n   - D. Cooking egg\n\n   (ii) Which of the following is a compound?\n   - A. H2\n   - B. O2\n   - C. CO2\n   - D. Na\n\n   (iii) The number of neutrons in an atom can be calculated by\n   - A. Mass number + atomic number\n   - B. Mass number - atomic number\n   - C. Atomic number - mass number\n   - D. Proton number only\n\n   (iv) The type of bond in sodium chloride is\n   - A. Ionic\n   - B. Covalent\n   - C. Metallic\n   - D. Hydrogen\n\n   (v) A solution with pH 12 is\n   - A. neutral\n   - B. acidic\n   - C. basic\n   - D. buffer\n\n   (vi) Which gas is evolved when acids react with carbonates?\n   - A. Oxygen\n   - B. Hydrogen\n   - C. Carbon dioxide\n   - D. Nitrogen\n\n   (vii) The process of converting a liquid to vapour is called\n   - A. Freezing\n   - B. Condensation\n   - C. Evaporation\n   - D. Sublimation\n\n   (viii) Electroplating involves\n   - A. Removal of metals using acid\n   - B. Deposition of metal on a surface using electricity\n   - C. Burning metal\n   - D. Dissolving metal in water\n\n   (ix) Which of the following is an amphoteric oxide?\n   - A. Na2O\n   - B. ZnO\n   - C. CO2\n   - D. SO2\n\n   (x) Which of the following statements is true for endothermic reactions?\n   - A. Heat is released\n   - B. Heat is absorbed\n   - C. Temperature decreases\n   - D. No heat change occurs\n\n2. Match the items in **List A** with **List B**.\n\n   List A\n   (i) Titration\n   (ii) Avogadro constant\n   (iii) Catalyst\n   (iv) Reduction\n   (v) Solubility\n\n   List B\n   A. Amount of substance containing 6.02 × 10^23 particles\n   B. Measure how much solute dissolves in a given solvent\n   C. Substance that speeds up reaction without being consumed\n   D. Procedure to determine concentration of solution\n   E. Gain of electrons\n\nSECTION B (54 Marks)\nAnswer all questions.\n\n3. (a) Define *element* and *mixture*.\n   (b) Give two examples of heterogeneous mixtures.\n\n4. (a) Explain the difference between ionic and covalent compounds.\n   (b) Draw Lewis structure for CO2 molecule.\n\n5. (a) State Boyle’s law.\n   (b) A sample of gas occupies 6 L at 2 atm pressure. Find its volume at 4 atm, temperature constant.\n\n6. (a) Define strong and weak acids with examples.\n   (b) Calculate [H+] for a solution with pH = 3.\n\n7. (a) Explain factors affecting rate of reaction with examples.\n   (b) Suggest one method to decrease reaction rate.\n\n8. (a) State law of definite proportions.\n   (b) A compound contains 40 g C and 6.7 g H. Find mass of O if total mass = 100 g.\n\n9. (a) Define oxidation number.\n   (b) Find oxidation number of S in H2SO4.\n\n10. (a) Explain process of electrolysis of molten sodium chloride.\n     (b) State products formed at anode and cathode.\n\nSECTION C (30 Marks)\nAnswer any TWO questions.\n\n11. (a) Describe how to prepare 250 cm³ of 0.5 M NaOH solution from solid NaOH.\n     (b) Mention three laboratory precautions when preparing solutions.\n\n12. (a) Describe how to carry out a precipitation reaction to obtain barium sulfate from barium chloride and sulfuric acid.\n     (b) Write balanced chemical equation.\n\n13. (a) Explain methods of preventing corrosion of iron.\n     (b) Explain why dry conditions slow down corrosion."
  },
  "CAnswers": {
    "chapter_title": "Chemistry - Answers",
    "content": "SECTION A\n\n1. Multiple choice answers with explanations:\n\n(i) B. Melting butter — Physical change only, substance changes state but no new substance forms.\n\n(ii) C. CO2 — Compound made of carbon and oxygen chemically bonded.\n\n(iii) B. Mass number - atomic number — Neutrons = Mass number - Atomic number.\n\n(iv) A. Ionic — NaCl formed by transfer of electron from Na to Cl.\n\n(v) C. Basic — pH > 7 indicates base.\n\n(vi) C. Carbon dioxide — Carbonates react with acids to release CO2.\n\n(vii) C. Evaporation — Liquid molecules escape to gas phase at surface.\n\n(viii) B. Deposition of metal using electricity — Electroplating deposits metal on surface.\n\n(ix) B. ZnO — Amphoteric oxide reacts with acids and bases.\n\n(x) B. Heat is absorbed — Endothermic reactions absorb energy.\n\n2. Matching:\n\n(i) D — Titration determines concentration of solution.\n(ii) A — Avogadro constant = 6.02 × 10^23 particles.\n(iii) C — Catalyst speeds reaction without consumption.\n(iv) E — Reduction = gain of electrons.\n(v) B — Solubility measures amount of solute dissolved.\n\nSECTION B\n\n3. (a) Element: pure substance made of one type of atom; Mixture: combination of two or more substances not chemically combined.\n(b) Examples: sand in water, oil in water.\n\n4. (a) Ionic compounds transfer electrons (metal + non-metal), covalent share electrons (non-metal + non-metal).\n(b) CO2 Lewis structure: O=C=O (double bonds on both sides).\n\n5. (a) Boyle’s law: At constant temperature, volume inversely proportional to pressure.\n(b) V1P1=V2P2 → 6×2 = V2×4 → V2 = 3 L.\n\n6. (a) Strong acid: completely ionizes (HCl); weak acid: partially ionizes (CH3COOH).\n(b) [H+] = 10^-pH = 10^-3 M.\n\n7. (a) Factors: concentration, surface area, temperature, catalyst.\n(b) Decrease rate: lower temperature or dilute reactants.\n\n8. (a) Law of definite proportions: A compound always contains elements in fixed mass ratio.\n(b) Mass O = 100 - (40+6.7) = 53.3 g.\n\n9. (a) Oxidation number: charge an atom would have if electrons were transferred completely.\n(b) In H2SO4: H = +1×2 = +2; O = -2×4 = -8 → S +2-8=0 → S = +6.\n\n10. (a) Electrolysis of molten NaCl: Na+ attracted to cathode, reduced to Na; Cl- attracted to anode, oxidized to Cl2 gas.\n(b) Products: Cathode – Na; Anode – Cl2.\n\nSECTION C\n\n11. (a) Prepare 250 cm³ 0.5 M NaOH: 0.5×0.25 = 0.125 mol; mass = 0.125×40=5 g NaOH; dissolve in water and make up to 250 cm³.\n(b) Precautions: wear gloves/goggles, add solid slowly, label solution.\n\n12. (a) Precipitation reaction: Mix BaCl2 solution with H2SO4 solution; white precipitate BaSO4 forms.\n(b) Reaction: BaCl2(aq) + H2SO4(aq) → BaSO4(s) + 2HCl(aq)\n\n13. (a) Prevent corrosion: paint, galvanize, oil/grease, sacrificial protection.\n(b) Dry conditions slow corrosion because water is necessary to form hydrated iron(III) oxide; oxygen alone reacts slowly."
  }
}
}
