{
"CSEE - SERIES3": {
"CHEMISTRY": {
    "chapter_title": "Chemistry - Examination",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 1\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. All answers must be written clearly in the spaces provided.\n4. Chemical symbols and formulae must be correct.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions in this section.\n\n1. For each of items (i)–(x), choose the correct answer and write its letter beside the item number.\n\n   (i) Which of the following is a chemical change?\n   - A. Dissolving sugar in water\n   - B. Melting ice\n   - C. Rusting of iron\n   - D. Boiling water\n\n   (ii) Which of the following represents an element?\n   - A. H2O\n   - B. CO2\n   - C. Na\n   - D. NaCl\n\n   (iii) The atomic number of an element gives the number of\n   - A. protons only\n   - B. neutrons only\n   - C. electrons only\n   - D. protons and neutrons\n\n   (iv) Which bond is formed by sharing electrons?\n   - A. Ionic\n   - B. Metallic\n   - C. Covalent\n   - D. Hydrogen\n\n   (v) A solution with pH 2 is\n   - A. neutral\n   - B. acidic\n   - C. alkaline\n   - D. basic\n\n   (vi) The molar mass of CaCO3 is\n   - A. 100 g/mol\n   - B. 84 g/mol\n   - C. 60 g/mol\n   - D. 120 g/mol\n\n   (vii) A catalyst\n   - A. increases activation energy\n   - B. decreases activation energy\n   - C. decreases reaction rate\n   - D. is consumed during reaction\n\n   (viii) Electrolysis is\n   - A. chemical decomposition by heat\n   - B. chemical decomposition by electricity\n   - C. mixing of solutions\n   - D. oxidation reaction only\n\n   (ix) Which gas is released when hydrochloric acid reacts with zinc?\n   - A. Oxygen\n   - B. Hydrogen\n   - C. Nitrogen\n   - D. Carbon dioxide\n\n   (x) Which of the following is a basic oxide?\n   - A. CO2\n   - B. SO2\n   - C. Na2O\n   - D. NO2\n\n2. Match the items in **List A** with the correct responses in **List B**.\n\n   List A\n   (i) Mole\n   (ii) Distillation\n   (iii) Oxidation\n   (iv) Reduction\n   (v) Hardness of water\n\n   List B\n   A. Removing calcium and magnesium ions\n   B. Gain of electrons\n   C. Separation of liquids by boiling point\n   D. Quantity containing 6.02 × 10^23 particles\n   E. Loss of electrons\n\nSECTION B (54 Marks)\nAnswer all questions in this section.\n\n3. (a) Define *matter* and give its three states.\n   (b) Give two examples of physical changes.\n\n4. (a) Explain ionic bonding using sodium chloride as an example.\n   (b) Draw the electron dot diagram for water (H2O).\n\n5. (a) State Avogadro’s law.\n   (b) If 4 moles of gas occupy 8 L at constant temperature and pressure, what volume will 1 mole occupy?\n\n6. (a) Define acid and base according to Brønsted–Lowry theory.\n   (b) A solution has [OH-] = 1 × 10^-3 M. Calculate the pH.\n\n7. (a) Describe factors that affect the rate of chemical reactions.\n   (b) Suggest one way to increase the rate of reaction between a solid and a solution.\n\n8. (a) State the law of conservation of mass.\n   (b) 3 g of hydrogen reacts with 24 g of oxygen to form water. Show that mass is conserved.\n\n9. (a) Define oxidation number.\n   (b) Find oxidation number of Mn in KMnO4.\n\n10. (a) Explain electrolytic deposition of copper from copper(II) sulfate.\n     (b) State the products at the cathode and anode.\n\nSECTION C (30 Marks)\nAnswer any TWO questions.\n\n11. (a) Explain how to prepare 500 cm³ of 1.0 M NaCl solution from solid NaCl.\n     (b) Describe three laboratory safety rules when preparing solutions.\n\n12. (a) Describe how to standardise a hydrochloric acid solution using sodium carbonate and methyl orange.\n     (b) Write the reaction equation.\n\n13. (a) Describe how rusting of iron can be prevented.\n     (b) Explain role of water and oxygen in rusting.\n"
  },
  "CAnswers": {
    "chapter_title": "Chemistry - Answers",
    "content": "SECTION A\n\n1. Multiple choice answers with explanations:\n\n(i) C. Rusting of iron — Rusting involves chemical change forming new substances.\n\n(ii) C. Na — Sodium (Na) is an element listed in periodic table.\n\n(iii) A. Protons only — Atomic number equals number of protons in nucleus. :contentReference[oaicite:1]{index=1}\n\n(iv) C. Covalent — Covalent bond involves sharing of electrons.\n\n(v) B. Acidic — pH less than 7 indicates acid.\n\n(vi) D. 120 g/mol — Ca (40) + C (12) + 3×O (48) = 100? Correction: CaCO3 = Ca (40) + C (12) + 3×16 = 40 + 12 + 48 = 100 g/mol, so correct is A.\n\n(vii) B. Decreases activation energy — Catalyst lowers activation energy to speed up reaction.\n\n(viii) B. Chemical decomposition by electricity — Electrolysis uses electric current to decompose compounds.\n\n(ix) B. Hydrogen — Reaction Zn + 2HCl → ZnCl2 + H2.\n\n(x) C. Na2O — Sodium oxide is basic oxide.\n\n2. Matching:\n\n(i) D — Mole = quantity containing 6.02 × 10^23 particles.\n\n(ii) C — Distillation separates liquids by boiling point.\n\n(iii) E — Oxidation = loss of electrons.\n\n(iv) B — Reduction = gain of electrons.\n\n(v) A — Hardness of water relates to calcium and magnesium ions.\n\n\nSECTION B\n\n3. (a) Matter is anything that has mass and occupies space; its three states are solid, liquid and gas.\n\n(b) Examples of physical change: Melting ice, dissolving sugar in water.\n\n\n4. (a) Ionic bonding: In NaCl, sodium (Na) transfers one electron to chlorine (Cl), forming Na+ and Cl− ions which attract each other by electrostatic forces.\n\n(b) Electron dot diagram for H2O: O has 6 valence electrons, shares one with each H to complete octet.\n\n\n5. (a) Avogadro’s law: At constant temperature and pressure, gas volume is directly proportional to number of moles.\n\n(b) If 4 moles → 8 L, then 1 mole → 8/4 = 2 L.\n\n\n6. (a) Acid (Brønsted–Lowry) donates proton (H+); base accepts proton.\n\n(b) [H+] = Kw/[OH-] = 1 × 10^-14 / 1 × 10^-3 = 1 × 10^-11; pH = -log(1 × 10^-11) = 11.\n\n\n7. (a) Factors: Concentration, temperature, surface area, catalysts.\n\n(b) To increase rate: increase temperature or use catalyst.\n\n\n8. (a) Law of conservation of mass: Mass cannot be created or destroyed in a chemical reaction.\n\n(b) Total mass reactants = 3 + 24 = 27 g; products water also = 27 g; mass is conserved.\n\n\n9. (a) Oxidation number indicates effective charge of atom in compound.\n\n(b) In KMnO4: K = +1, O = -2×4 = -8 → +1 + x -8 = 0 → x = +7 for Mn.\n\n\n10. (a) In electrolysis of CuSO4 with copper electrodes, Cu2+ ions are attracted to cathode and reduced to copper metal; at anode copper dissolves to form Cu2+.\n\n(b) At cathode: Cu (metal deposited). At anode: Cu2+ ions enter solution.\n\n\nSECTION C\n\n11. (a) To prepare 500 cm³ of 1.0 M NaCl: calculate moles needed (1 × 0.5 = 0.5 mol); mass = 0.5 × 58.5 = 29.25 g. Dissolve 29.25 g in water and make up to 500 cm³.\n\n(b) Safety: Wear goggles and gloves; add solids slowly; label solution.\n\n\n12. (a) Standardising HCl: Weigh known Na2CO3, dissolve, fill burette with HCl, use methyl orange, record volumes where colour changes.\n\n(b) Reaction: Na2CO3 + 2HCl → 2NaCl + H2O + CO2.\n\n\n13. (a) To prevent rusting: paint or galvanise iron, keep dry, use sacrificial protection.\n\n(b) Water and oxygen cause rusting; water dissolves iron ions and oxygen reacts with iron to form hydrated iron(III) oxide.\n\nEnd of Answers."
  }
}
}
