{
  "CSEE-SERIES10": {
    "CHEMISTRY_P8": {
    "chapter_title": "Chemistry - Examination Paper 8",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 8\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. All answers must be written clearly in the spaces provided.\n4. Use correct chemical symbols and formulae.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions in this section.\n\n1. For each item (i)–(x), choose the correct answer.\n\n   (i) Which of the following is a diatomic molecule?\n   - A. CO2\n   - B. H2\n   - C. H2O\n   - D. CH4\n\n   (ii) An example of a weak base is:\n   - A. NaOH\n   - B. NH4OH\n   - C. KOH\n   - D. Ba(OH)2\n\n   (iii) When magnesium burns in air it forms:\n   - A. MgO\n   - B. MgCO3\n   - C. Mg(OH)2\n   - D. MgCl2\n\n   (iv) The electron configuration of sodium is:\n   - A. 1s2 2s2 2p6 3s1\n   - B. 1s2 2s2 2p6 3s2\n   - C. 1s2 2s2 2p5 3s1\n   - D. 1s2 2s2 2p6 3p1\n\n   (v) The functional group of alcohols is:\n   - A. -COOH\n   - B. -OH\n   - C. -NH2\n   - D. -CHO\n\n   (vi) A substance that cannot be broken down chemically into simpler substances is called:\n   - A. Compound\n   - B. Element\n   - C. Mixture\n   - D. Alloy\n\n   (vii) Which gas is collected by downward displacement of water?\n   - A. CO2\n   - B. O2\n   - C. H2\n   - D. NH3\n\n   (viii) Which of the following is a non-metal oxide?\n   - A. CO2\n   - B. Na2O\n   - C. MgO\n   - D. CaO\n\n   (ix) Which of the following increases solubility of solids in water?\n   - A. Increasing temperature\n   - B. Decreasing temperature\n   - C. Decreasing pressure\n   - D. Increasing pressure\n\n   (x) The main product of complete combustion of methane is:\n   - A. CO + H2O\n   - B. CO2 + H2O\n   - C. C + H2O\n   - D. CH3OH\n\n2. Match the items in List A with responses in List B.\n\n   List A\n   (i) Electrolyte\n   (ii) Saturated solution\n   (iii) Isotope\n   (iv) Endothermic reaction\n   (v) Precipitate\n\n   List B\n   A. Substance that dissolves no more solute at given temperature\n   B. Atoms of same element with different mass numbers\n   C. Solid formed in a reaction in solution\n   D. Conducts electricity in solution\n   E. Reaction that absorbs heat from surroundings\n\nSECTION B (54 Marks)\nAnswer all questions in this section.\n\n3. (a) Define a covalent bond.\n   (b) Draw the electron dot structure of H2O.\n\n4. (a) Define oxidation and reduction in terms of oxygen transfer.\n   (b) Identify the oxidising and reducing agents in the reaction: 2Fe + 3Cl2 → 2FeCl3.\n\n5. (a) Explain the term relative molecular mass.\n   (b) Calculate the relative molecular mass of H2SO4.\n\n6. (a) Define an acid according to Lewis theory.\n   (b) Give one example of a Lewis acid-base reaction.\n\n7. (a) Explain the differences between endothermic and exothermic reactions.\n   (b) Give one example of each type.\n\n8. (a) Describe the laboratory preparation of oxygen gas using manganese(IV) oxide and hydrogen peroxide.\n   (b) State one use of oxygen gas.\n\n9. (a) Define isotopes and give one example.\n   (b) State one application of isotopes in everyday life.\n\n10. (a) Explain how temperature affects the solubility of gases in liquids.\n     (b) Give one example of gas solubility decreasing with temperature.\n\nSECTION C (30 Marks)\nAnswer any two questions.\n\n11. (a) Describe how to carry out a titration of hydrochloric acid with sodium carbonate solution.\n     (b) Write the balanced chemical equation for the reaction.\n\n12. (a) Describe the steps in the preparation of a pure dry sample of copper(II) sulfate from copper metal.\n     (b) Write the chemical equations involved.\n\n13. (a) Explain the method of obtaining pure water from impure water by distillation.\n     (b) State two observations during the distillation process."
  },
  "CAnswers_P8": {
    "chapter_title": "Chemistry - Answers Paper 8",
    "content": "SECTION A\n\n1. Multiple choice answers with explanations:\n\n(i) B — H2 is diatomic; contains two atoms of hydrogen.\n(ii) B — NH4OH is a weak base; partially dissociates in water.\n(iii) A — Magnesium burns in air to form magnesium oxide: 2Mg + O2 → 2MgO.\n(iv) A — Sodium electron configuration: 1s2 2s2 2p6 3s1.\n(v) B — Alcohols have -OH functional group.\n(vi) B — Element is a pure substance that cannot be chemically broken down.\n(vii) C — Hydrogen is collected by downward displacement of water due to being insoluble.\n(viii) A — CO2 is a non-metal oxide.\n(ix) A — Increasing temperature generally increases solubility of solids in water.\n(x) B — Complete combustion of methane: CH4 + 2O2 → CO2 + 2H2O.\n\n2. Matching:\n(i) D — Electrolyte: conducts electricity in solution.\n(ii) A — Saturated solution: no more solute can dissolve.\n(iii) B — Isotope: atoms of same element with different mass numbers.\n(iv) E — Endothermic reaction: absorbs heat.\n(v) C — Precipitate: solid formed in a reaction in solution.\n\nSECTION B\n\n3. (a) Covalent bond: sharing of electron pairs between atoms.\n   (b) H2O: O atom with two lone pairs, single bonds to two H atoms.\n\n4. (a) Oxidation: gain of oxygen; Reduction: loss of oxygen.\n   (b) 2Fe + 3Cl2 → 2FeCl3: Fe is oxidised (loses electrons), Cl2 is reduced (gains electrons).\n\n5. (a) Relative molecular mass: sum of relative atomic masses of all atoms in a molecule.\n   (b) H2SO4: H=1×2, S=32×1, O=16×4 → Mr = 2 + 32 + 64 = 98.\n\n6. (a) Lewis acid: electron pair acceptor.\n   (b) Example: BF3 + NH3 → F3B·NH3.\n\n7. (a) Endothermic: absorbs heat; Exothermic: releases heat.\n   (b) Endothermic: photosynthesis; Exothermic: combustion of methane.\n\n8. (a) Laboratory O2: Mix H2O2 with MnO2 catalyst; collect O2 over water or by displacement of air.\n   (b) Uses: respiration experiments, oxy-acetylene welding.\n\n9. (a) Isotopes: atoms of same element with same number of protons but different neutrons, e.g., 12C and 14C.\n   (b) Application: Carbon-14 dating, medical tracers.\n\n10. (a) As temperature increases, solubility of gases in liquids decreases due to increased kinetic energy.\n     (b) Example: CO2 in soda soft drinks.\n\nSECTION C\n\n11. (a) Pipette Na2CO3, add indicator, titrate with HCl until colour changes; record volume.\n     (b) Equation: Na2CO3 + 2HCl → 2NaCl + H2O + CO2.\n\n12. (a) Dissolve copper metal in dilute H2SO4, filter to remove excess metal, evaporate solution to crystallise CuSO4, dry crystals.\n     (b) Equations: Cu + H2SO4 → CuSO4 + H2↑\n\n13. (a) Distillation: heat impure water, collect condensed pure water in a separate container.\n     (b) Observations: vapour rises, condenses on cooler surface, impurities remain behind."
  }
}
}
