{
  "CSEE-SERIES8": {
    "CHEMISTRY": {
    "chapter_title": "Chemistry - Examination",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 6\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. All answers must be clearly written.\n4. Use chemical symbols and formulae correctly.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i)–(x), choose the correct answer.\n\n   (i) A pure substance that cannot be broken down by chemical means is called:\n   - A. Mixture\n   - B. Element\n   - C. Compound\n   - D. Alloy\n\n   (ii) The gas evolved when sodium bicarbonate reacts with hydrochloric acid is:\n   - A. Oxygen\n   - B. Hydrogen\n   - C. Carbon dioxide\n   - D. Nitrogen\n\n   (iii) Which solution has a pH greater than 7?\n   - A. Vinegar\n   - B. Lemon juice\n   - C. Soap solution\n   - D. Battery acid\n\n   (iv) The relative formula mass of CH4 is:\n   - A. 12\n   - B. 16\n   - C. 14\n   - D. 18\n\n   (v) Which of the following is an oxidising agent?\n   - A. H2\n   - B. O2\n   - C. N2\n   - D. CO2\n\n   (vi) A standard solution is one that:\n   - A. Has unknown concentration\n   - B. Has known volume only\n   - C. Has known concentration\n   - D. Produces precipitate\n\n   (vii) The ion that makes water hard is:\n   - A. Na+\n   - B. Ca2+\n   - C. Cl−\n   - D. NO3−\n\n   (viii) Which of the following indicates that a reaction has reached equilibrium?\n   - A. All reactants are used up\n   - B. Reactants and products form at equal rates\n   - C. Reaction stops completely\n   - D. Temperature increases\n\n   (ix) Which one of the following is a non‑metal?\n   - A. Fe\n   - B. Cu\n   - C. S\n   - D. Al\n\n   (x) Which of the following is an example of fractional distillation use?\n   - A. Separating sand and water\n   - B. Purifying salt water\n   - C. Separating components of crude oil\n   - D. Filtering fine particles\n\n2. Match the items in List A with responses in List B.\n\n   List A\n   (i) Mole\n   (ii) Electrolyte\n   (iii) Oxidation\n   (iv) Volatile substance\n   (v) Precipitation\n\n   List B\n   A. Reaction forming insoluble solid\n   B. Loss of electrons\n   C. Amount containing 6.02 × 10^23 particles\n   D. Substance that conducts electricity in solution\n   E. Tendency to vaporize easily\n\nSECTION B (54 Marks)\nAnswer all questions in this section.\n\n3. (a) Define compound and give two examples.\n   (b) Explain one difference between a mixture and a compound.\n\n4. (a) Describe what is meant by a balanced chemical equation.\n   (b) Balance the equation: Al + O2 → Al2O3.\n\n5. (a) Define solubility.\n   (b) Explain the effect of temperature on solubility of solids in liquids.\n\n6. (a) Explain the Arrhenius concept of acids and bases.\n   (b) Give a use for hydrochloric acid in industry.\n\n7. (a) Describe how to prepare oxygen gas in the laboratory.\n   (b) State one use of oxygen in industry.\n\n8. (a) Explain the term *hard water*.\n   (b) Describe one method of removing hardness from water.\n\n9. (a) Define oxidation number.\n   (b) Find the oxidation number of Mn in KMnO4.\n\n10. (a) Explain how catalysts affect reaction rate.\n     (b) Give one example of a catalytic process in everyday life.\n\nSECTION C (30 Marks)\nAnswer any two questions.\n\n11. (a) Describe the titration method for determining the concentration of sodium hydroxide solution using a standard hydrochloric acid standardised solution.\n     (b) Write the balanced chemical equation for the reaction.\n\n12. (a) Explain how rusting of iron can be prevented.\n     (b) Discuss why layers of paint prevent rusting.\n\n13. (a) Describe the steps to prepare a standard solution of potassium permanganate.\n     (b) Explain how you would standardize it using known oxalic acid solution."
  },
  "CAnswers": {
    "chapter_title": "Chemistry - Answers",
    "content": "SECTION A\n\n1. Multiple choice answers with explanations:\n\n(i) B — An element is a pure substance that cannot be broken down chemically. :contentReference[oaicite:2]{index=2}\n\n(ii) C — Carbon dioxide is evolved when sodium bicarbonate reacts with hydrochloric acid: NaHCO₃ + HCl → NaCl + H₂O + CO₂.\n\n(iii) C — Soap solution is basic (pH > 7), whereas vinegar and lemon juice are acidic. :contentReference[oaicite:3]{index=3}\n\n(iv) B — Relative formula mass of CH₄ = 12 + (1×4) = 16.\n\n(v) B — Oxygen is an oxidising agent as it gains electrons in many reactions.\n\n(vi) C — A standard solution has a known concentration used in titrations. :contentReference[oaicite:4]{index=4}\n\n(vii) B — Calcium ions (Ca²⁺) contribute to water hardness along with Mg²⁺. :contentReference[oaicite:5]{index=5}\n\n(viii) B — At equilibrium, forward and reverse reaction rates are equal.\n\n(ix) C — Sulfur (S) is a non‑metal.\n\n(x) C — Fractional distillation is used to separate components of crude oil due to different boiling points.\n\n2. Matching:\n(i) C — Mole = 6.02 × 10²³ particles.\n(ii) D — Electrolyte conducts electricity in solution.\n(iii) B — Oxidation = loss of electrons.\n(iv) E — Volatile substances vaporize easily.\n(v) A — Precipitation produces insoluble solids.\n\n\nSECTION B\n\n3. (a) Compound: substance made of two or more elements chemically combined (e.g., water H₂O, carbon dioxide CO₂).\n   (b) Mixture components are not chemically bonded and can be separated physically; compounds require chemical change to separate.\n\n4. (a) Balanced equation has equal atoms of each element on both sides.\n   (b) 4Al + 3O₂ → 2Al₂O₃ (adjust coefficients to balance atoms).\n\n5. (a) Solubility: maximum amount of solute that dissolves in a given solvent at specific temperature.\n   (b) For solids, solubility generally increases with temperature; more solute dissolves at higher temperatures.\n\n6. (a) Arrhenius acid produces H⁺ ions in aqueous solution; base produces OH⁻ ions.\n   (b) Hydrochloric acid is used in pickling of steel and cleaning metal surfaces.\n\n7. (a) Prepare oxygen by heating potassium permanganate (KMnO₄); collect gas over water.\n   (b) Oxygen is used in steel manufacturing and medical respiration support.\n\n8. (a) Hard water contains high concentrations of Ca²⁺ and Mg²⁺ ions.\n   (b) One method to remove hardness is using a water softener (ion exchange) or boiling to precipitate carbonates.\n\n9. (a) Oxidation number: charge that an atom would have if electrons were completely transferred.\n   (b) In KMnO₄: K +1, O -2×4 = -8, so Mn×2 + (+1×2) -8 = 0 → 2Mn +2 -8 = 0 → 2Mn = +6 → Mn = +3 (correction: actually +7 in KMnO₄).\n\n10. (a) Catalysts provide an alternative reaction pathway with lower activation energy, increasing reaction rate without being consumed.\n     (b) Example: catalase in the body speeds breakdown of hydrogen peroxide; catalytic converters in cars reduce emissions.\n\n\nSECTION C\n\n11. (a) Titration: pipette measured volume of NaOH into flask, add indicator, titrate with standardised HCl from burette until colour change at end‑point; record volume used.\n     (b) Equation: NaOH + HCl → NaCl + H₂O.\n\n12. (a) Prevent rusting by painting metal surfaces, galvanizing (coating with zinc), or using sacrificial anodes.\n     (b) Paint blocks contact with oxygen and moisture, slowing rust formation.\n\n13. (a) Prepare KMnO₄ solution by weighing solid, dissolving in distilled water, and making up to specific volume in volumetric flask.\n     (b) Standardize using oxalic acid; titrate until end‑point with suitable indicator or permanganate self‑indicator (pink fade).\n\nEnd of Answers."
  }
}
}
