{
  "CSEE-SERIES9": {
 "CHEMISTRY_P7": {
    "chapter_title": "Chemistry - Examination Paper 7",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 7\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. All answers must be written clearly in the spaces provided.\n4. Use correct chemical symbols and formulae.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions in this section.\n\n1. For each item (i)–(x), choose the correct answer.\n\n   (i) The unit of concentration expressed in mol/L is:\n   - A. Gram\n   - B. Mole fraction\n   - C. Molarity\n   - D. Normality\n\n   (ii) Which of the following is amphoteric?\n   - A. HCl\n   - B. NaOH\n   - C. Al(OH)3\n   - D. H2SO4\n\n   (iii) The gas liberated when zinc reacts with dilute sulphuric acid is:\n   - A. Oxygen\n   - B. Hydrogen\n   - C. Nitrogen\n   - D. Carbon dioxide\n\n   (iv) Which of the following is a covalent compound?\n   - A. NaCl\n   - B. H2O\n   - C. CaO\n   - D. KBr\n\n   (v) The correct electron configuration of oxygen is:\n   - A. 1s2 2s2 2p4\n   - B. 1s2 2s2 2p6\n   - C. 1s2 2s2 2p3\n   - D. 1s2 2s1 2p5\n\n   (vi) Which of the following represents a physical change?\n   - A. Burning of paper\n   - B. Dissolving sugar in water\n   - C. Rusting of iron\n   - D. Electrolysis of water\n\n   (vii) The process of separating two liquids with different boiling points is called:\n   - A. Filtration\n   - B. Distillation\n   - C. Evaporation\n   - D. Sublimation\n\n   (viii) Which of the following is a strong acid?\n   - A. CH3COOH\n   - B. H2SO4\n   - C. H2CO3\n   - D. HCN\n\n   (ix) The substance which speeds up a reaction without being consumed is:\n   - A. Reactant\n   - B. Product\n   - C. Catalyst\n   - D. Solvent\n\n   (x) Which of the following is insoluble in water?\n   - A. NaCl\n   - B. KNO3\n   - C. BaSO4\n   - D. NH4Cl\n\n2. Match the items in List A with responses in List B.\n\n   List A\n   (i) Mole concept\n   (ii) Oxidising agent\n   (iii) Electrolysis\n   (iv) Precipitation reaction\n   (v) Volatile liquid\n\n   List B\n   A. Conducts electricity when molten or in solution\n   B. Tendency to vaporize easily\n   C. Substance that gains electrons\n   D. Formation of insoluble solid\n   E. Amount of substance containing 6.02 × 10^23 particles\n\nSECTION B (54 Marks)\nAnswer all questions in this section.\n\n3. (a) Define a mole and give its value.\n   (b) Calculate the number of moles in 36 g of H2O.\n\n4. (a) Explain the difference between ionic and covalent bonds.\n   (b) Draw the electron dot structure of NH3.\n\n5. (a) Describe what is meant by an acid and a base according to Bronsted-Lowry theory.\n   (b) Give one example of an acid-base reaction.\n\n6. (a) Define relative atomic mass.\n   (b) Calculate the relative molecular mass of CO2.\n\n7. (a) Explain the difference between homogeneous and heterogeneous mixtures.\n   (b) Give one method of separating each type.\n\n8. (a) Describe the laboratory preparation of hydrogen gas using zinc and dilute HCl.\n   (b) State one use of hydrogen gas.\n\n9. (a) Define oxidation and reduction in terms of electron transfer.\n   (b) Identify the oxidising and reducing agents in the reaction: Zn + Cu2+ → Zn2+ + Cu.\n\n10. (a) Explain the effect of temperature on the rate of reaction.\n     (b) Give one example of temperature affecting a reaction rate.\n\nSECTION C (30 Marks)\nAnswer any two questions.\n\n11. (a) Describe the steps of a titration to determine the concentration of HCl using standard Na2CO3 solution.\n     (b) Write the balanced chemical equation for the reaction.\n\n12. (a) Explain how corrosion of iron can be prevented.\n     (b) Discuss why galvanising protects iron from corrosion.\n\n13. (a) Describe how to prepare a standard solution of NaOH.\n     (b) Explain how you would standardise it using a primary standard such as potassium hydrogen phthalate."
  },
  "CAnswers_P7": {
    "chapter_title": "Chemistry - Answers Paper 7",
    "content": "SECTION A\n\n1. Multiple choice answers with explanations:\n\n(i) C — Molarity is the number of moles of solute per litre of solution.\n(ii) C — Al(OH)3 is amphoteric; it reacts with acids and bases.\n(iii) B — Hydrogen gas is evolved when zinc reacts with dilute H2SO4: Zn + H2SO4 → ZnSO4 + H2.\n(iv) B — H2O is a covalent compound with shared electron pairs.\n(v) A — Oxygen electron configuration: 1s2 2s2 2p4.\n(vi) B — Dissolving sugar in water is a physical change; no new substance formed.\n(vii) B — Distillation separates liquids based on different boiling points.\n(viii) B — Sulphuric acid H2SO4 is a strong acid.\n(ix) C — A catalyst speeds up reactions without being consumed.\n(x) C — BaSO4 is insoluble in water.\n\n2. Matching:\n(i) E — Mole concept: 6.02 × 10^23 particles.\n(ii) C — Oxidising agent: gains electrons.\n(iii) A — Electrolysis: conducts electricity when molten or in solution.\n(iv) D — Precipitation reaction: formation of insoluble solid.\n(v) B — Volatile liquid: tendency to vaporize easily.\n\nSECTION B\n\n3. (a) Mole: amount of substance containing 6.02 × 10^23 particles.\n   (b) Moles = mass / Mr = 36 / 18 = 2 moles.\n\n4. (a) Ionic bond: transfer of electrons; covalent bond: sharing of electrons.\n   (b) NH3 electron dot: N with 3 bonds to H and one lone pair.\n\n5. (a) Bronsted-Lowry: acid donates H+, base accepts H+.\n   (b) HCl + NaOH → NaCl + H2O.\n\n6. (a) Relative atomic mass: weighted average mass of an atom compared to 1/12 of C‑12.\n   (b) CO2: C =12, O=16×2=32; Mr=12+32=44.\n\n7. (a) Homogeneous: uniform composition; heterogeneous: visibly different components.\n   (b) Separation: homogeneous → distillation; heterogeneous → filtration.\n\n8. (a) Zn + dilute HCl in flask, collect H2 over water.\n   (b) Hydrogen used in Haber process, hydrogenation.\n\n9. (a) Oxidation: loss of electrons; reduction: gain of electrons.\n   (b) Zn loses 2e- → oxidised; Cu2+ gains 2e- → reduced.\n\n10. (a) Increasing temperature increases kinetic energy, increasing collision frequency and reaction rate.\n     (b) Example: rate of food spoilage increases at higher temperatures.\n\nSECTION C\n\n11. (a) Pipette Na2CO3 into flask, add indicator, titrate with HCl from burette until end-point colour change; record volume.\n     (b) Equation: Na2CO3 + 2HCl → 2NaCl + H2O + CO2.\n\n12. (a) Prevent corrosion by painting, galvanising, coating with oil/grease.\n     (b) Galvanising: zinc layer corrodes preferentially, protecting iron.\n\n13. (a) Prepare NaOH by dissolving weighed NaOH in distilled water and making up to volume.\n     (b) Standardise using primary standard KHP: titrate until endpoint with suitable indicator; calculate exact concentration.\n\nEnd of Answers."
  }
}
}
