{
  "CSEE - SERIES6": {
"CHEMISTRY_P5": {
    "chapter_title": "Chemistry - Examination Paper 5",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 5\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. All answers must be clearly written in the spaces provided.\n4. Use chemical symbols and formulae correctly.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i)–(x), choose the correct answer.\n\n   (i) Which of the following is a pure substance?\n   - A. Sand\n   - B. Air\n   - C. Gold\n   - D. Seawater\n\n   (ii) Which process separates a liquid from a soluble solid?\n   - A. Filtration\n   - B. Distillation\n   - C. Sieving\n   - D. Decantation\n\n   (iii) A solution with pH 1 is\n   - A. Neutral\n   - B. Weakly acidic\n   - C. Strongly acidic\n   - D. Basic\n\n   (iv) The empirical formula of glucose (C6H12O6) is\n   - A. CH2O\n   - B. C2H4O2\n   - C. C6H12O6\n   - D. CHO\n\n   (v) A gas that supports combustion is\n   - A. Nitrogen\n   - B. Carbon dioxide\n   - C. Oxygen\n   - D. Hydrogen\n\n   (vi) Which type of chemical bond exists in magnesium chloride?\n   - A. Metallic\n   - B. Covalent\n   - C. Ionic\n   - D. Hydrogen\n\n   (vii) Which indicator turns red in acid and yellow in base?\n   - A. Litmus\n   - B. Methyl orange\n   - C. Phenolphthalein\n   - D. Bromothymol blue\n\n   (viii) Which product is formed when sodium reacts with water?\n   - A. Sodium oxide\n   - B. Sodium hydroxide\n   - C. Sodium chloride\n   - D. Sodium sulfate\n\n   (ix) Which of the following is a reduction reaction?\n   - A. Zn → Zn2+ + 2e−\n   - B. Cu2+ + 2e− → Cu\n   - C. 2Mg + O2 → 2MgO\n   - D. H2O → H2 + O2\n\n   (x) The hardness of water is mainly due to the presence of\n   - A. Na+ ions\n   - B. Cl− ions\n   - C. Ca2+ and Mg2+ ions\n   - D. K+ ions\n\n2. Match the items in List A with the correct responses in List B.\n\n   List A\n   (i) Relative atomic mass\n   (ii) Saturated solution\n   (iii) Catalyst\n   (iv) Precipitate\n   (v) Electrolysis\n\n   List B\n   A. Substance used to speed up a reaction\n   B. Solid formed from insoluble products\n   C. Solution containing maximum amount of solute\n   D. Process of decomposing using electricity\n   E. Average mass of atoms compared to 1/12 of carbon‑12\n\nSECTION B (54 Marks)\nAnswer all questions in this section.\n\n3. (a) Define *mixture* and *compound*.\n   (b) Give one example of each and explain how they differ.\n\n4. (a) Explain the process of filtration.\n   (b) Describe a real‑life situation where filtration is used.\n\n5. (a) Define the term *solubility*.\n   (b) A student dissolves 50 g of sugar in 100 mL water and no more dissolves. Explain whether the solution is saturated or unsaturated.\n\n6. (a) Explain why ionic compounds conduct electricity only when molten or in solution.\n   (b) Give one example of an ionic compound and its use.\n\n7. (a) Define *oxidation* and *reduction* with examples.\n   (b) In the reaction Fe2O3 + 3CO → 2Fe + 3CO2, identify the oxidising and reducing agents.\n\n8. (a) Define *acid rain*.\n   (b) Explain two harmful effects of acid rain on the environment.\n\n9. (a) Describe how to test for the presence of oxygen gas in a sample.\n   (b) State one industrial use of oxygen gas.\n\n10. (a) Define *hydrocarbon*.\n     (b) Write the formula of an alkene and explain how it differs from an alkane.\n\nSECTION C (30 Marks)\nAnswer any two questions.\n\n11. (a) Describe how to prepare 250 cm³ of 1.0 M NaCl solution from solid NaCl. Include calculations.\n     (b) State two safety precautions when preparing chemical solutions.\n\n12. (a) Describe the steps to carry out a volumetric titration to find the concentration of a hydrochloric acid solution using standard sodium carbonate.\n     (b) Write the balanced equation for the reaction.\n\n13. (a) Explain how to carry out a flame test to identify metal ions.\n     (b) State the observed colours for sodium and copper ions."
  },
  "CAnswers_P5": {
    "chapter_title": "Chemistry - Answers Paper 5",
    "content": "SECTION A\n\n1. (i) C — Gold is a pure substance (element) with definite composition.\n\n(ii) B — Distillation separates a liquid from a soluble solid by boiling and condensing. :contentReference[oaicite:1]{index=1}\n\n(iii) C — pH 1 indicates strong acid. :contentReference[oaicite:2]{index=2}\n\n(iv) A — Empirical formula of glucose: CH2O (simplest whole number ratio).\n\n(v) C — Oxygen supports combustion; essential for burning.\n\n(vi) C — Ionic bond between Mg2+ and Cl− in magnesium chloride.\n\n(vii) B — Methyl orange turns red in acid and yellow in base.\n\n(viii) B — Sodium reacts with water to produce sodium hydroxide.\n\n(ix) B — Cu2+ + 2e− → Cu is reduction (gain of electrons).\n\n(x) C — Calcium and magnesium ions cause hardness of water. :contentReference[oaicite:3]{index=3}\n\n2. Matching:\n(i) E — Relative atomic mass is average mass compared to carbon‑12.\n(ii) C — Saturated solution contains maximum solute.\n(iii) A — Catalyst speeds up reaction without being consumed.\n(iv) B — Precipitate is incontestable solid formed.\n(v) D — Electrolysis decomposes compounds using electricity.\n\n\nSECTION B\n\n3. (a) Mixture: physical combination of substances not chemically bonded; Compound: pure substance of two or more elements chemically bonded.\n   (b) Example: Air (mixture), water (compound). Mixture can be separated by physical means; compound requires chemical change.\n\n4. (a) Filtration: pour mixture through filter paper; solid stays, liquid passes through.\n   (b) Used to separate sand from water in water treatment.\n\n5. (a) Solubility: maximum amount of solute that dissolves in solvent at given temperature.\n   (b) If no more dissolves, the solution is saturated.\n\n6. (a) Ionic compounds conduct when ions are free to move (molten or dissolved), not in solid state.\n   (b) Example: NaCl — used in table salt.\n\n7. (a) Oxidation: loss of electrons (Fe → Fe2+ + 2e−), Reduction: gain of electrons (Cu2+ + 2e− → Cu).\n   (b) In Fe2O3 + 3CO → 2Fe + 3CO2: CO is reducing agent, Fe2O3 is oxidising agent.\n\n8. (a) Acid rain: precipitation containing dissolved acidic gases like SO2.\n   (b) Harms plants by lowering soil pH; damages buildings and aquatic life.\n\n9. (a) Test for oxygen: insert glowing splint; it relights if oxygen present.\n   (b) Industrial use: steel manufacturing.\n\n10. (a) Hydrocarbon: compound of carbon and hydrogen only.\n     (b) Alkene: C2H4; differs from alkane (C2H6) by containing a double bond.\n\n\nSECTION C\n\n11. (a) Moles of NaCl: M = 1.0, V = 0.25 L → moles = 1×0.25 = 0.25. Mass = 0.25×58.5 = 14.625 g; dissolve and make up to 250 cm³.\n     (b) Safety: wear goggles and gloves, handle solids carefully.\n\n12. (a) Titration steps: prepare standard Na2CO3, pipette to conical flask, add indicator, titrate with HCl from burette until colour change, record volume.\n     (b) Equation: Na2CO3 + 2HCl → 2NaCl + H2O + CO2.\n\n13. (a) Flame test: clean nichrome wire, dip in sample, place in flame; observe colour.\n     (b) Na+ produces yellow flame; Cu2+ gives green/blue flame.\n\nEnd of Answers."
  }
}
}
