{  "CSEE - SERIES2": {
  "CHEMISTRY": {
    "chapter_title": "Chemistry - Theory",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 2\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer only two (2) questions.\n3. All answers must be clearly written.\n4. Use chemical symbols and formulae correctly.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (15 Marks)\nAnswer all questions in this section.\n\n1. For each of the following items (i)–(x), choose the correct answer.\n\n   (i) The basic unit of an element is:\n   - A. Atom\n   - B. Molecule\n   - C. Compound\n   - D. Proton\n\n   (ii) Which of the following is a physical change?\n   - A. Rusting of iron\n   - B. Melting of ice\n   - C. Burning of wood\n   - D. Neutralization of acid\n\n   (iii) Which of the following acids is found in vinegar?\n   - A. Hydrochloric acid\n   - B. Sulfuric acid\n   - C. Ethanoic acid\n   - D. Nitric acid\n\n   (iv) Which gas is evolved when zinc reacts with dilute hydrochloric acid?\n   - A. Oxygen\n   - B. Hydrogen\n   - C. Carbon dioxide\n   - D. Nitrogen\n\n   (v) The pH of neutral solution is:\n   - A. 0\n   - B. 7\n   - C. 14\n   - D. 1\n\n   (vi) Which of the following is an example of an ionic compound?\n   - A. H2O\n   - B. NaCl\n   - C. CO2\n   - D. CH4\n\n   (vii) Which process separates insoluble solids from liquids?\n   - A. Distillation\n   - B. Filtration\n   - C. Evaporation\n   - D. Crystallization\n\n   (viii) The relative molecular mass of H2SO4 is:\n   - A. 98\n   - B. 100\n   - C. 120\n   - D. 64\n\n   (ix) Which element is found in all organic compounds?\n   - A. Oxygen\n   - B. Carbon\n   - C. Hydrogen\n   - D. Nitrogen\n\n   (x) Which factor increases rate of reaction?\n   - A. Lowering temperature\n   - B. Using smaller surface area\n   - C. Using catalyst\n   - D. Decreasing concentration\n\n2. Match items in List A with List B.\n\n   List A\n   (i) Electroplating\n   (ii) Alloy\n   (iii) Mole concept\n   (iv) Reduction\n   (v) Oxidation\n\n   List B\n   A. Loss of electrons\n   B. Gain of electrons\n   C. Mixture of metals\n   D. Amount containing 6.02×10^23 particles\n   E. Coating of metal using electricity\n\nSECTION B (70 Marks)\nAnswer all questions in this section.\n\n3. (a) Define matter and describe its three states.\n   (b) Explain two differences between physical and chemical changes.\n\n4. (a) Explain how ionic and covalent compounds conduct electricity.\n   (b) Draw a dot-and-cross diagram for H2O.\n\n5. (a) Define acids and bases according to Arrhenius theory.\n   (b) Name two laboratory indicators and state their color change in acids and bases.\n\n6. (a) Describe how to determine hardness of water using soap solution.\n   (b) Explain the role of calcium and magnesium ions in water hardness.\n\n7. (a) State the law of conservation of mass.\n   (b) In a reaction, 12 g of carbon reacts with 32 g of oxygen. Find the mass of carbon dioxide formed.\n\n8. (a) Explain factors that affect rate of reaction.\n   (b) Suggest one method to increase the rate of reaction in a solid-liquid reaction.\n\n9. (a) Define oxidation number.\n   (b) Calculate oxidation number of sulfur in H2SO4.\n\n10. (a) Describe the process of electrolysis of molten NaCl.\n     (b) State products at anode and cathode.\n\nSECTION C (15 Marks)\nAnswer any two questions.\n\n11. (a) Describe preparation of 250 cm³ of 0.1 M NaOH solution from solid NaOH.\n     (b) State safety precautions when handling NaOH.\n\n12. (a) Describe how to prevent rusting of iron.\n     (b) Explain role of oxygen and water in rusting.\n\n13. (a) Explain how to standardize HCl solution using Na2CO3 and methyl orange.\n     (b) Write relevant balanced chemical equation."
  },
  "CAnswers": {
    "chapter_title": "Chemistry - Answers",
    "content": "SECTION A\n\n1. (i) A — Atom is the basic unit of an element.\n(ii) B — Melting of ice is a physical change; no new substance is formed.\n(iii) C — Ethanoic acid is found in vinegar.\n(iv) B — Hydrogen gas is evolved when zinc reacts with dilute HCl.\n(v) B — Neutral solution has pH 7.\n(vi) B — NaCl is an ionic compound.\n(vii) B — Filtration separates insoluble solids from liquids.\n(viii) A — H2SO4 relative molecular mass: H(1x2)+S(32)+O(16x4)=98.\n(ix) B — Carbon is in all organic compounds.\n(x) C — Catalyst increases rate of reaction.\n\n2. Matching:\n(i) E — Electroplating uses electricity to coat metals.\n(ii) C — Alloy is a mixture of metals.\n(iii) D — Mole concept: 6.02×10^23 particles.\n(iv) B — Reduction: gain of electrons.\n(v) A — Oxidation: loss of electrons.\n\nSECTION B\n\n3. (a) Matter: anything with mass and volume; states: solid, liquid, gas.\n   (b) Physical vs chemical changes: physical — no new substance, reversible; chemical — new substance formed, often irreversible.\n\n4. (a) Ionic compounds conduct electricity in molten or aqueous state due to free ions; covalent compounds generally do not conduct (except acids that ionize).\n   (b) H2O dot-cross: O with 2 lone pairs, H shared electrons.\n\n5. (a) Arrhenius acid: produces H+ in solution; base: produces OH− in solution.\n   (b) Indicators: Methyl orange (acid red, base yellow), Phenolphthalein (acid colorless, base pink).\n\n6. (a) Hardness of water: titrate with soap solution until lather forms easily.\n   (b) Ca2+ and Mg2+ ions react with soap forming scum; responsible for hardness.\n\n7. (a) Law: mass of reactants = mass of products.\n   (b) Mass of CO2: 12 + 32 = 44 g.\n\n8. (a) Factors: temperature, concentration, surface area, catalyst.\n   (b) Increasing temperature increases particle collisions and rate.\n\n9. (a) Oxidation number: number of electrons lost/gained by element in compound.\n   (b) H2SO4: H +1, O -2×4=-8; total +2? –8? → S=+6.\n\n10. (a) Electrolysis molten NaCl: Na+ moves to cathode, Cl− to anode.\n    (b) Cathode: Na(s); Anode: Cl2(g).\n\nSECTION C\n\n11. (a) Dissolve 1 g NaOH (for 0.1 M in 0.25 L), dilute to mark.\n    (b) Wear gloves, goggles, avoid inhalation.\n\n12. (a) Prevent rusting: paint, galvanize, alloying with chromium.\n    (b) Oxygen and moisture necessary; without water rusting slows.\n\n13. (a) Standardize HCl: titrate Na2CO3 solution with HCl using methyl orange; end point is color change.\n    (b) Reaction: Na2CO3 + 2HCl → 2NaCl + H2O + CO2."
  }
}
}
