{  "CSS - SERIES2": {
  "PHYSICS": {
    "chapter_title": "Physics - Examination",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n031 PHYSICS - PAPER 2\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of Sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written clearly.\n5. All writing must be in blue or black ink; diagrams in pencil.\n6. Calculators and cellular phones are not allowed.\n7. Write your Assessment Number at the top right corner of every page.\n8. Constants:\n   Acceleration due to gravity, g = 10 m/s²\n   Density of water = 1000 kg/m³\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i)–(x), write the correct answer beside the item number.\n\n   (i) SI unit of energy is\n   - A. Watt\n   - B. Joule\n   - C. Newton\n   - D. Pascal\n\n   (ii) The force that opposes motion is called\n   - A. Gravity\n   - B. Friction\n   - C. Tension\n   - D. Buoyancy\n\n   (iii) A concave lens always forms an image that is\n   - A. Virtual and erect\n   - B. Real and inverted\n   - C. Real and erect\n   - D. Virtual and inverted\n\n   (iv) The process of converting a liquid to vapour at all temperatures is called\n   - A. Evaporation\n   - B. Boiling\n   - C. Condensation\n   - D. Sublimation\n\n   (v) Instrument for measuring potential difference is\n   - A. Ammeter\n   - B. Voltmeter\n   - C. Ohmmeter\n   - D. Galvanometer\n\n   (vi) The slope of a distance-time graph gives\n   - A. Acceleration\n   - B. Velocity\n   - C. Displacement\n   - D. Force\n\n   (vii) Momentum of a 2 kg mass moving at 5 m/s is\n   - A. 10 kg·m/s\n   - B. 7 kg·m/s\n   - C. 5 kg·m/s\n   - D. 12 kg·m/s\n\n   (viii) The bending of waves around corners is called\n   - A. Diffraction\n   - B. Reflection\n   - C. Refraction\n   - D. Interference\n\n   (ix) Electric power is calculated by\n   - A. P = VI\n   - B. P = I/R\n   - C. P = V/R\n   - D. P = V + I\n\n   (x) Frequency is the reciprocal of\n   - A. Time period\n   - B. Wavelength\n   - C. Velocity\n   - D. Acceleration\n\n2. Match List A with List B:\n\n   List A\n   (i) Boyle’s Law\n   (ii) Archimedes’ Principle\n   (iii) Ohm’s Law\n   (iv) Newton’s Third Law\n   (v) Law of Reflection\n\n   List B\n   A. Action–Reaction\n   B. Current is proportional to voltage / resistance\n   C. Pressure × Volume = constant (at constant T)\n   D. Buoyant force = weight of fluid displaced\n   E. Angle of incidence = angle of reflection\n\n3. (a) Define power in physics.\n   (b) A machine does 2000 J of work in 40 s. Calculate the power.\n\n4. (a) State Newton’s first law of motion.\n   (b) A ball of mass 0.5 kg is acted upon by a net force of 10 N. Find its acceleration.\n\n5. (a) Define latent heat of fusion.\n   (b) Calculate heat required to melt 0.2 kg of ice. Latent heat of fusion of ice = 3.4 × 10^5 J/kg.\n\n6. (a) Draw and label a simple circuit with battery, resistor, switch, and ammeter.\n   (b) State two safety precautions when using electrical circuits.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. Explain with examples the difference between speed and velocity.\n\n8. (a) A cube of side 0.1 m has mass 2 kg. Determine its density and whether it floats in water.\n   (b) If it floats, calculate the fraction of volume submerged.\n\n9. (a) Define efficiency of a device and its formula.\n   (b) A machine absorbs 5000 J of energy and does 4000 J useful work. Calculate efficiency.\n\n10. (a) Describe formation of a real image by a convex lens when object is beyond 2F.\n    (b) Draw a ray diagram to show this image.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to determine the acceleration due to gravity using a simple pendulum.\n    (b) Length of pendulum = 1 m, period = 2 s. Estimate g.\n    (c) State three precautions to improve accuracy of the experiment."
  },
"PAnswers": {
    "chapter_title": "Physics - Answers Paper 2",
    "content": "SECTION A\n\n1. Multiple choice answers (with explanations)\n\n(i) B. Joule — Energy is measured in joules (J), which is the work done when a force of one newton moves an object 1 meter in the direction of the force.\n\n(ii) B. Friction — Friction is the resistive force that opposes relative motion between two surfaces in contact.\n\n(iii) A. Virtual and erect — A concave lens always produces an image that is upright (erect) and cannot be projected on a screen (virtual).\n\n(iv) A. Evaporation — Evaporation is the process by which liquid changes to vapour at temperatures below its boiling point.\n\n(v) B. Voltmeter — A voltmeter measures the potential difference between two points and must be connected in parallel.\n\n(vi) B. Velocity — The slope of a distance-time graph gives the speed or velocity of an object. Slope = rise/run = Δdistance/Δtime.\n\n(vii) A. 10 kg·m/s — Momentum, p = mass × velocity. p = 2 × 5 = 10 kg·m/s.\n\n(viii) A. Diffraction — Diffraction is the bending of waves (light, sound, etc.) around obstacles or through openings.\n\n(ix) A. P = VI — Electric power is the product of potential difference and current.\n\n(x) A. Time period — Frequency f = 1/T, where T is the time period.\n\n2. Matching\n\n(i) C; (ii) D; (iii) B; (iv) A; (v) E\n\nExplanations:\n- Boyle’s law (C): At constant temperature, pressure × volume = constant.\n- Archimedes’ principle (D): Buoyant force = weight of fluid displaced.\n- Ohm’s law (B): Current is proportional to voltage / resistance.\n- Newton’s third law (A): Action–reaction; every action has equal and opposite reaction.\n- Law of reflection (E): Angle of incidence = angle of reflection.\n\n3. Work and power\n\n(a) Definition: Power is the rate at which work is done or energy is transferred. P = W/t, units = watt (W).\n\n(b) Calculation: W = 2000 J, t = 40 s.\n- P = W/t = 2000/40 = 50 W.\n\nExplanation: Power indicates how fast work is done.\n\n4. Newton’s first law and application\n\n(a) Statement: An object will remain at rest or continue to move at constant velocity unless acted upon by a net external force.\n\n(b) Calculation: F = 10 N, m = 0.5 kg.\n- a = F/m = 10/0.5 = 20 m/s².\n\nExplanation: Acceleration is proportional to net force and inversely proportional to mass.\n\n5. Latent heat of fusion\n\n(a) Definition: Latent heat of fusion is the heat energy required to change 1 kg of a solid into liquid at constant temperature.\n\n(b) Calculation: Q = m × Lf = 0.2 × 3.4 × 10^5 = 68000 J.\n\nExplanation: No temperature change occurs during the phase change; energy is used to break molecular bonds.\n\n6. Electric circuit and safety\n\n(a) Diagram description: Battery (cell) connected to resistor R; ammeter A in series; switch S; wires connecting all components. Labels clearly shown.\n\n(b) Safety precautions:\n- Switch off power before adjusting circuit.\n- Avoid touching live wires and use components rated for current.\n\nSECTION B\n\n7. Speed vs velocity\n\nExplanation: \n- Speed is a scalar quantity, giving magnitude only; average speed = total distance / total time.\n- Velocity is a vector quantity, giving both magnitude and direction; average velocity = displacement / time.\n- Example: If a car moves 100 m east in 10 s, speed = 10 m/s, velocity = 10 m/s east.\n\n8. Density and floating\n\n(a) Calculation:\n- Volume V = 0.1³ = 0.001 m³\n- Mass m = 2 kg\n- Density ρ = m/V = 2 / 0.001 = 2000 kg/m³\n- Since ρ > 1000 kg/m³, cube is denser than water → sinks.\n\n(b) Fraction submerged: Not applicable (sinks entirely).\n\nExplanation: Floating occurs if object density < fluid density; otherwise, it sinks.\n\n9. Efficiency\n\n(a) Definition: Efficiency = (useful energy output / total energy input) × 100%.\n\n(b) Calculation: useful = 4000 J, input = 5000 J\n- Efficiency = (4000/5000) × 100% = 80%.\n\nExplanation: 20% of energy lost as heat, friction, etc.\n\n10. Convex lens real image\n\n(a) Description: Object beyond 2F forms a real, inverted, and diminished image between F and 2F on the opposite side. Real image can be projected on screen.\n\n(b) Ray diagram description: Principal axis, convex lens, F points marked. Ray 1: parallel to axis, refracted through far focal point. Ray 2: through centre of lens, straight. Intersection of rays on opposite side forms real image.\n\nSECTION C\n\n11. Simple pendulum experiment\n\n(a) Steps:\n1. Suspend a small dense bob from a string of known length L.\n2. Pull bob to small angle and release; start timing.\n3. Measure time for multiple oscillations to reduce error.\n4. Calculate period T = total time / number of oscillations.\n5. Use formula g = 4π²L/T² to determine acceleration due to gravity.\n\n(b) Calculation: L = 1 m, T = 2 s\n- g = 4π² × 1 / 2² = 4π² / 4 ≈ 9.87 ≈ 10 m/s²\n\n(c) Precautions:\n- Small oscillation angle (<15°) to ensure simple harmonic motion.\n- Measure length L accurately from pivot to centre of mass of bob.\n- Use precise timing instruments; repeat measurements to get average.\n\nExplanation: These precautions minimize errors from amplitude, measurement, and reaction time.\n\nTEACHER NOTES\n\n- Ensure students show units at every step.\n- Draw labelled diagrams for all optics and circuits questions.\n- Method marks should be awarded even if final numerical answers have minor arithmetic mistakes.\n\nEnd of Answers."
  },
  "CHEMISTRY": {
    "chapter_title": "Chemistry - Examination",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY\n(Theory Paper)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C.\n2. Answer all questions in sections A and B.\n3. In section C, answer only one question.\n4. All writing must be in blue or black ink.\n5. Use the spaces provided for all working.\n6. Calculators and cellular phones are not allowed.\n7. Write your Assessment Number at the top right corner of every page.\n\nSECTION A (15 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i)–(x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The atomic number of an element represents the number of\n   - A. protons\n   - B. neutrons\n   - C. electrons and neutrons\n   - D. isotopes\n\n   (ii) The empirical formula of hydrogen peroxide is\n   - A. HO\n   - B. H2O2\n   - C. H2O\n   - D. OH\n\n   (iii) The gas evolved when a metal reacts with dilute hydrochloric acid is\n   - A. Oxygen\n   - B. Hydrogen\n   - C. Carbon dioxide\n   - D. Nitrogen\n\n   (iv) The bond in NaCl is\n   - A. Covalent\n   - B. Ionic\n   - C. Metallic\n   - D. Hydrogen\n\n   (v) The color change of phenolphthalein in alkaline solution is\n   - A. Colourless to pink\n   - B. Pink to colourless\n   - C. Red to blue\n   - D. Blue to red\n\n   (vi) The formula of calcium hydroxide is\n   - A. CaOH\n   - B. Ca(OH)2\n   - C. CaO2\n   - D. CaH2\n\n   (vii) Which of the following is a diatomic molecule?\n   - A. He\n   - B. N2\n   - C. Ne\n   - D. H\n\n   (viii) A substance that speeds up a chemical reaction without being consumed is called\n   - A. Catalyst\n   - B. Reactant\n   - C. Product\n   - D. Solvent\n\n   (ix) When 2 moles of water are formed, the number of molecules produced is\n   - A. 6.02 × 10^23\n   - B. 1.204 × 10^24\n   - C. 3.01 × 10^23\n   - D. 2 × 10^23\n\n   (x) The pH of a neutral solution at 25°C is\n   - A. 0\n   - B. 7\n   - C. 14\n   - D. 1\n\n2. Match the items in List A with the responses in List B.\n\n   List A\n   (i) Avogadro’s law\n   (ii) Boyle’s law\n   (iii) Law of conservation of mass\n   (iv) Oxidation\n   (v) Reduction\n\n   List B\n   A. Mass cannot be created or destroyed in a chemical reaction\n   B. Decrease in volume of gas causes increase in pressure at constant temperature\n   C. Volume of gas is proportional to number of moles at constant temperature and pressure\n   D. Gain of oxygen or loss of electrons\n   E. Loss of oxygen or gain of electrons\n\nSECTION B (70 Marks)\nAnswer all questions in this section.\n\n3. (a) Define atomic number and mass number.\n   (b) An element has 17 protons and 18 neutrons. Determine its mass number and symbol.\n\n4. (a) State the differences between ionic and covalent bonds.\n   (b) Draw the dot and cross diagram of H2O.\n\n5. (a) Define mole concept and Avogadro number.\n   (b) Calculate the number of molecules in 3 moles of CO2.\n\n6. (a) Explain the term acid and base according to Brønsted–Lowry theory.\n   (b) A solution has [H+] = 1 × 10^-4 M. Calculate the pH.\n\n7. (a) Explain factors affecting the rate of chemical reactions.\n   (b) A reaction has rate constant k = 0.5 s^-1. What does this value signify?\n\n8. (a) State and explain the law of conservation of mass with an example.\n   (b) 2 g of hydrogen reacts with 16 g of oxygen to form water. Verify the law of conservation of mass.\n\n9. (a) Define oxidation number.\n   (b) Determine the oxidation number of S in H2SO4.\n\n10. (a) Describe electrolysis of molten sodium chloride.\n    (b) Name the products formed at cathode and anode.\n\nSECTION C (15 Marks)\nAnswer only one question.\n\n11. (a) Explain how to prepare 250 cm³ of 0.5 M NaOH solution from solid NaOH. Include all steps and calculations.\n    (b) Explain three laboratory safety precautions when handling concentrated NaOH.\n    (c) Describe how to standardize HCl solution using sodium carbonate and phenolphthalein as indicator."
  },
  "CAnswers": {
    "chapter_title": "Chemistry - Answers",
    "content": "SECTION A\n\n1. Multiple choice answers (with explanation)\n\n(i) A. Protons — The atomic number equals the number of protons in an atom.\n\n(ii) A. HO — Empirical formula shows simplest ratio of elements; H2O2 → HO.\n\n(iii) B. Hydrogen — Metal + acid → hydrogen gas + salt.\n\n(iv) B. Ionic — NaCl consists of ions held by electrostatic forces.\n\n(v) A. Colourless to pink — Phenolphthalein turns pink in alkaline solution.\n\n(vi) B. Ca(OH)2 — Correct formula with two hydroxide ions.\n\n(vii) B. N2 — Nitrogen is naturally diatomic.\n\n(viii) A. Catalyst — Speeds up reaction without being consumed.\n\n(ix) B. 1.204 × 10^24 — 2 moles × 6.022 × 10^23 molecules/mole = 1.204 × 10^24 molecules.\n\n(x) B. 7 — pH neutral = 7 at 25°C.\n\n2. Matching\n\n(i) C; (ii) B; (iii) A; (iv) D; (v) E\n\nExplanation:\n- Avogadro’s law: volume ∝ moles.\n- Boyle’s law: pressure ∝ 1/volume at constant T.\n- Law of conservation of mass: mass not lost or gained.\n- Oxidation: gain of O/loss of electrons.\n- Reduction: loss of O/gain of electrons.\n\nSECTION B\n\n3. Atomic number and mass number\n\n(a) Atomic number (Z) = number of protons; Mass number (A) = protons + neutrons.\n\n(b) Mass number = 17 + 18 = 35; Symbol = Cl-35.\n\n4. Ionic vs covalent bonds\n\n(a) Ionic: transfer of electrons, metal + non-metal, forms ions.\n    Covalent: sharing of electrons, non-metal + non-metal.\n\n(b) Dot and cross diagram for H2O:\nOxygen: 6 valence electrons (dots), each H shares 1 electron (crosses) → total 8 electrons around O.\n\n5. Mole concept\n\n(a) 1 mole = 6.022 × 10^23 particles (Avogadro number).\n\n(b) Number of molecules = 3 × 6.022 × 10^23 = 1.8066 × 10^24 molecules.\n\n6. Acids and bases\n\n(a) Brønsted–Lowry: Acid = proton donor; Base = proton acceptor.\n\n(b) pH = -log[H+] = -log(1 × 10^-4) = 4.\n\n7. Reaction rates\n\n(a) Factors: concentration, temperature, surface area, catalysts.\n\n(b) k = 0.5 s^-1 — Rate constant; reaction proceeds at rate proportional to concentration; units s^-1 indicate first-order reaction.\n\n8. Law of conservation of mass\n\n(a) Mass cannot be created/destroyed. Example: 2 H2 + O2 → 2 H2O; total mass reactants = mass products.\n\n(b) Mass reactants = 2 + 16 = 18 g; Mass products = 18 g → law verified.\n\n9. Oxidation numbers\n\n(a) Oxidation number: charge an atom would have in a compound.\n\n(b) H2SO4: H +1 ×2 = +2, O -2 ×4 = -8, S = ? → +2 + S -8 = 0 → S = +6.\n\n10. Electrolysis of molten NaCl\n\n(a) Molten NaCl conducts electricity; Na+ goes to cathode, Cl- goes to anode; current flows, Na metal deposited, Cl2 gas liberated.\n\n(b) Cathode: Na, Anode: Cl2.\n\nSECTION C\n\n11. Preparation of 0.5 M NaOH\n\n(a) Calculation: Molarity M = moles/volume(L) → moles = 0.5 × 0.25 = 0.125 moles.\nMass = moles × molar mass = 0.125 × 40 = 5 g.\nSteps: weigh 5 g NaOH, dissolve in <250 cm³ water, transfer to 250 cm³ volumetric flask, make up to mark, mix.\n\n(b) Safety:\n- Wear gloves and goggles.\n- Add NaOH to water slowly (not water to NaOH).\n- Work in fume hood to avoid inhaling fumes.\n\n(c) Standardizing HCl:\n- Weigh accurate amount of sodium carbonate, dissolve in water.\n- Add HCl from burette until phenolphthalein changes colour.\n- Record volume, calculate concentration of HCl.\nExplanation: Sodium carbonate reacts with HCl stoichiometrically; phenolphthalein indicates endpoint."
  }
}
}
