{
  "CSEE - SERIES6": {
"CHEMISTRY_P4": {
    "chapter_title": "Chemistry - Examination Paper 4",
    "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM FOUR NATIONAL ASSESSMENT\n032 CHEMISTRY – THEORY PAPER 4\nTime: 3 Hours\n\nInstructions:\n1. Answer all questions in Sections A and B.\n2. In Section C answer any two (2) questions.\n3. All answers must be clearly written.\n4. Use chemical symbols and formulae correctly.\n5. Calculators and mobile phones are not allowed.\n\nSECTION A (16 Marks)\nAnswer all questions in this section.\n\n1. For each of the following items (i)–(x), choose the correct answer.\n\n   (i) Which of the following is matter?\n   - A. Light\n   - B. Sound\n   - C. Water\n   - D. Heat\n\n   (ii) Which of the following is a mixture?\n   - A. NaCl\n   - B. Air\n   - C. CO2\n   - D. H2O\n\n   (iii) Which indicator turns pink in a base?\n   - A. Methyl orange\n   - B. Litmus\n   - C. Phenolphthalein\n   - D. Bromothymol blue\n\n   (iv) Which of the following shows complete ionisation in water?\n   - A. HCl\n   - B. CH3COOH\n   - C. NH3\n   - D. H2O\n\n   (v) The product when copper(II) oxide is heated with hydrogen is\n   - A. CuO and H2O\n   - B. Cu and H2O\n   - C. Cu and H2\n   - D. CuO and H2.\n\n   (vi) Which method is used to obtain pure solid from solution?\n   - A. Filtration\n   - B. Evaporation\n   - C. Distillation\n   - D. Chromatography\n\n   (vii) A solution that resists change in pH when small amounts of acid or base are added is called\n   - A. Neutral solution\n   - B. Dilute solution\n   - C. Buffered solution\n   - D. Concentrated solution\n\n   (viii) Which of the following is used as a drying agent?\n   - A. CaCl2\n   - B. NaCl\n   - C. MgSO4\n   - D. NaOH\n\n   (ix) The colour of litmus in acid is\n   - A. Blue\n   - B. Red\n   - C. Purple\n   - D. Green\n\n   (x) Which type of reaction is Zn + CuSO4 → ZnSO4 + Cu?\n   - A. Decomposition\n   - B. Displacement\n   - C. Precipitation\n   - D. Combination\n\n2. Match the items in List A with the responses in List B.\n\n   List A\n   (i) Mole concept\n   (ii) Standard solution\n   (iii) Oxidation\n   (iv) Electrolyte\n   (v) Precipitation\n\n   List B\n   A. Reaction forming insoluble solid\n   B. Substance that conducts electricity in solution\n   C. Amount containing 6.02 × 10^23 particles\n   D. Loss of electrons\n   E. Solution of known concentration\n\nSECTION B (54 Marks)\nAnswer all questions in this section.\n\n3. (a) Define element and compound.\n   (b) Give two differences between an element and a compound.\n\n4. (a) Explain what is meant by a balanced chemical equation.\n   (b) Balance the equation: Fe + O2 → Fe2O3.\n\n5. (a) Define solvent and solute.\n   (b) Describe how to prepare a saturated solution of potassium nitrate.\n\n6. (a) State Charles’s law.\n   (b) A gas occupies 4 L at 1 atm pressure. What volume will it occupy at 2 atm pressure (temperature constant)?\n\n7. (a) Define relative atomic mass (Ar).\n   (b) Calculate the Ar of chlorine given isotopes 35Cl (75%) and 37Cl (25%).\n\n8. (a) What is meant by an acid rain?\n   (b) Explain one effect of acid rain on the environment.\n\n9. (a) Describe how to test for the presence of hydrogen gas.\n   (b) State one use of hydrogen gas.\n\n10. (a) Define saturated and unsaturated hydrocarbons.\n     (b) Give one example of each.\n\nSECTION C (30 Marks)\nAnswer any two questions.\n\n11. (a) Describe how to standardize a sodium hydroxide solution using oxalic acid and methyl orange indicator.\n     (b) Write the balanced chemical equation for the reaction.\n\n12. (a) Explain the steps involved in qualitative analysis to identify chloride ions in an unknown sample.\n     (b) State the observations in each step.\n\n13. (a) Describe how to prepare and purify oxygen gas in the laboratory.\n     (b) State two uses of oxygen gas."
  },
  "CAnswers_P4": {
    "chapter_title": "Chemistry - Answers Paper 4",
    "content": "SECTION A\n\n1. Multiple choice answers with brief explanation:\n\n(i) C. Water — Water is matter because it has mass and occupies space.\n\n(ii) B. Air — Air is a mixture of gases; not a pure substance.\n\n(iii) C. Phenolphthalein — Phenolphthalein turns pink in basic solutions.\n\n(iv) A. HCl — Strong acids like HCl completely ionise in water.\n\n(v) B. Cu and H2O — Hydrogen reduces copper(II) oxide to copper, forming water.\n\n(vi) B. Evaporation — Evaporation leaves solid behind and obtains solid pure form.\n\n(vii) C. Buffered solution — Buffer resists pH change when small amounts of acid/base are added.\n\n(viii) A. CaCl2 — Calcium chloride is a common drying agent.\n\n(ix) B. Red — Litmus turns red in acid.\n\n(x) B. Displacement — Zinc displaces copper from copper(II) sulfate solution.\n\n2. Matching:\n(i) C — Mole concept is amount containing 6.02 × 10^23 particles. :contentReference[oaicite:2]{index=2}\n(ii) E — Standard solution is solution of known concentration.\n\n(iii) D — Oxidation is loss of electrons.\n\n(iv) B — Electrolyte conducts electricity in solution.\n\n(v) A — Precipitation forms an insoluble solid.\n\n\nSECTION B\n\n3. (a) Element: pure substance of only one kind of atom; Compound: substance made of two or more elements chemically combined.\n   (b) Differences: Element cannot be broken down chemically; compound can. Elements are simplest forms; compounds have fixed chemical formula.\n\n4. (a) Balanced equation: same number of each type of atom on both sides.\n   (b) 4Fe + 3O2 → 2Fe2O3 (balance by atoms).\n\n5. (a) Solute is substance dissolved; solvent is substance doing the dissolving.\n   (b) Dissolve potassium nitrate in water until no more dissolves; solution becomes saturated when crystals remain.\n\n6. (a) Charles’s law: volume of gas ∝ absolute temperature at constant pressure.\n   (b) Boyle’s law (if temperature constant): P1V1 = P2V2 → 1×4 = 2×V2 → V2 = 2 L.\n\n7. (a) Ar is weighted average of isotopic masses.\n   (b) Ar = (75×35 + 25×37)/100 = (2625 + 925)/100 = 3550/100 = 35.5.\n\n8. (a) Acid rain is rain containing dissolved acidic gases such as SO2, NOx.\n   (b) Effect: damages plants and aquatic life by lowering pH of soil and water.\n\n9. (a) Test for H2: bring burning splint near gas; ‘pop’ sound indicates hydrogen.\n   (b) Use: manufacture of ammonia, hydrogenation of fats.\n\n10. (a) Saturated hydrocarbon contains single bonds only; unsaturated contains double/triple bonds.\n    (b) Example: Ethane (saturated), Ethene (unsaturated).\n\n\nSECTION C\n\n11. (a) Standardise NaOH: prepare primary standard of oxalic acid, titrate with NaOH using methyl orange until colour change; calculate concentration.\n     (b) Equation: H2C2O4 + 2NaOH → Na2C2O4 + 2H2O.\n\n12. (a) Qualitative analysis for chloride ions: dissolve sample in water, add nitric acid, add silver nitrate; white precipitate of AgCl forms.\n     (b) Observations: white precipitate which dissolves in ammonia.\n\n13. (a) Prepare oxygen: heat potassium permanganate; collect gas over water.\n     (b) Uses: respiration support in hospitals, rocket propulsion.\n\nEnd of Answers."
  }
  }
}
