{
  "Physics": {
    "Form 1 Terminal Examination": {
      "General": {
        "Exam Paper": {
          "chapter_title": "Physics Form 1 - Terminal Examination (English)",
          "content": "# Physics Form 1 Terminal Examination\n\n**Time: 2 Hours 30 Minutes**  \n**Total Marks: 100**\n\n## Section A: Multiple Choice (20 marks)\nAnswer all questions.\n\n1. The study of matter in relation to energy is called:\n   A. Chemistry  B. Biology  C. Physics  D. Geography\n\n2. Anything that has mass and occupies space is known as:\n   A. Energy  B. Force  C. Matter  D. Power\n\n3. The SI unit of length is:\n   A. Kilogram  B. Second  C. Metre  D. Newton\n\n4. The force that opposes motion between two surfaces in contact is:\n   A. Gravitational force  B. Friction  C. Magnetic force  D. Tension\n\n5. Density is calculated as:\n   A. Volume / Mass  B. Mass / Volume  C. Force / Area  D. Pressure / Force\n\n6. The upward force exerted by a fluid on an object immersed in it is called:\n   A. Friction  B. Upthrust  C. Gravity  D. Tension\n\n7. Pressure in liquids increases with:\n   A. Decrease in depth  B. Increase in depth  C. Increase in area  D. Decrease in density\n\n8. Elasticity is the ability of a material to:\n   A. Break easily  B. Return to original shape after deformation  C. Float in water  D. Conduct heat\n\n9. The three states of matter are:\n   A. Solid, liquid, gas  B. Solid, water, air  C. Ice, water, steam  D. Metal, plastic, wood\n\n10. A vernier caliper is used to measure:\n    A. Time  B. Mass  C. Small lengths accurately  D. Temperature\n\n(Additional 10 similar questions can be added for full 20 marks.)\n\n## Section B: Short Answer Questions (40 marks)\n\n11. Define Physics and mention three branches of Physics. (5 marks)\n\n12. Explain why Physics is important in daily life (give 4 examples). (4 marks)\n\n13. Convert 50°C to Kelvin scale. (2 marks)\n\n14. A body has mass 2 kg and volume 0.5 m³. Calculate its density. (3 marks)\n\n15. State Archimedes' Principle. (3 marks)\n\n16. Differentiate between mass and weight. (4 marks)\n\n17. Explain how friction can be reduced in machines. (4 marks)\n\n18. A stone of weight 10 N is fully immersed in water. If upthrust is 4 N, calculate apparent weight. (3 marks)\n\n19. Define pressure and state its formula. (3 marks)\n\n20. Explain surface tension with one example. (5 marks)\n\n## Section C: Structured/Essay Questions (40 marks)\nAnswer any two questions.\n\n21. (a) Describe the structure of matter using kinetic theory. (6 marks)\n    (b) Explain adhesion and cohesion with examples. (6 marks)\n    (c) What is capillarity? Give one application. (3 marks)\n\n22. (a) Explain how to measure volume of an irregular object using displacement method. (6 marks)\n    (b) A density bottle has mass 20 g empty and 70 g full of water. When full of oil, mass is 62 g. Calculate density of oil. (Density of water = 1 g/cm³) (9 marks)\n\n23. (a) State the law of flotation. (4 marks)\n    (b) Explain why a ship floats while a needle sinks in water. (6 marks)\n    (c) Describe a simple experiment to verify Archimedes' Principle. (5 marks)"
        }
      },
      "Form 1": {
        "Marking Scheme": {
          "chapter_title": "Physics Form 1 - Marking Scheme",
          "content": "# Marking Scheme - Physics Form 1 Terminal Examination\n\n## Section A: Multiple Choice (1 mark each)\n\n1. C. Physics\n2. C. Matter\n3. C. Metre\n4. B. Friction\n5. B. Mass / Volume\n6. B. Upthrust\n7. B. Increase in depth\n8. B. Return to original shape after deformation\n9. A. Solid, liquid, gas\n10. C. Small lengths accurately\n\n(Allocate 1 mark per correct answer. Total 20 marks)\n\n## Section B: Short Answer (Marks as indicated)\n\n11. Physics is the study of matter in relation to energy. (2 marks)\n    Branches: Mechanics, Heat, Light, Electricity, Sound (any 3, 1 mark each). Total 5 marks\n\n12. Examples: Technology (phones, cars), Medicine (X-rays), Energy (electricity), Transport (any 4 valid, 1 mark each). Total 4 marks\n\n13. K = °C + 273 → 50 + 273 = 323 K (2 marks)\n\n14. Density = mass/volume = 2 / 0.5 = 4 kg/m³ (3 marks: formula 1, calculation 1, unit 1)\n\n15. When a body is wholly or partially immersed in a fluid, it experiences an upthrust equal to the weight of fluid displaced. (3 marks)\n\n16. Mass: Amount of matter (scalar, constant). Weight: Force due to gravity (vector, varies). (4 marks)\n\n17. Lubrication, streamlining, ball bearings, smooth surfaces (any relevant, 1 mark each). Total 4 marks\n\n18. Apparent weight = Actual weight - Upthrust = 10 - 4 = 6 N (3 marks)\n\n19. Pressure = Force / Area (formula 1 mark, definition 2 marks). Total 3 marks\n\n20. Surface tension: Property of liquid surface to behave like stretched membrane due to cohesion. Example: Insects walking on water, droplets spherical (explanation 3, example 2). Total 5 marks\n\n## Section C: (20 marks each question)\n\n21. (a) Matter made of tiny particles in constant motion; solids vibrate, liquids slide, gases random (detailed 6 marks)\n    (b) Adhesion: Attraction between different molecules (e.g., water-glass). Cohesion: Same molecules (e.g., mercury drops). (6 marks)\n    (c) Rise/fall of liquid in narrow tube. Application: Ink in pen. (3 marks)\n\n22. (a) Detailed steps with diagram description (6 marks)\n    (b) Volume of bottle = (70-20)/1 = 50 cm³. Mass of oil = 62-20 = 42 g. Density = 42/50 = 0.84 g/cm³ (9 marks step by step)\n\n23. (a) A floating body displaces fluid equal to its weight. (4 marks)\n    (b) Ship displaces large volume (upthrust = weight), needle small volume (upthrust < weight). (6 marks)\n    (c) Steps: Weigh object in air, in water, calculate loss = upthrust, verify with displaced water weight. (5 marks)\n\n**Total: 100 marks**"
        }
      }
    }
  }
}
