{
      "TERMINAL EXAMS-SERIES1": {
        "PHYSICS": {
          "chapter_title": "Physics Form 1 - Terminal Examination",
          "content": "**Time: 2 Hours 30 Minutes**  \n**Total Marks: 100**\n\n### Section A: Multiple Choice Questions (20 Marks)\nAnswer **all** questions. Each question carries **1 mark**.\n\n1. The study of matter in relation to energy is called:\n   - A. Chemistry\n   - B. Biology\n   - C. Physics\n   - D. Geography\n\n2. Anything that has mass and occupies space is known as:\n   - A. Energy\n   - B. Force\n   - C. Matter\n   - D. Power\n\n3. The SI unit of length is:\n   - A. Kilogram\n   - B. Second\n   - C. Metre\n   - D. Newton\n\n4. The force that opposes motion between two surfaces in contact is:\n   - A. Gravitational force\n   - B. Friction\n   - C. Magnetic force\n   - D. Tension\n\n5. Density is calculated as:\n   - A. Volume / Mass\n   - B. Mass / Volume\n   - C. Force / Area\n   - D. Pressure / Force\n\n6. The upward force exerted by a fluid on an object immersed in it is called:\n   - A. Friction\n   - B. Upthrust\n   - C. Gravity\n   - D. Tension\n\n7. Pressure in liquids increases with:\n   - A. Decrease in depth\n   - B. Increase in depth\n   - C. Increase in area\n   - D. Decrease in density\n\n8. Elasticity is the ability of a material to:\n   - A. Break easily\n   - B. Return to original shape after deformation\n   - C. Float in water\n   - D. Conduct heat\n\n9. The three states of matter are:\n   - A. Solid, liquid, gas\n   - B. Solid, water, air\n   - C. Ice, water, steam\n   - D. Metal, plastic, wood\n\n10. A vernier caliper is used to measure:\n    - A. Time\n    - B. Mass\n    - C. Small lengths accurately\n    - D. Temperature\n\n11. The SI unit of mass is:\n    - A. Newton\n    - B. Kilogram\n    - C. Gram\n    - D. Pound\n\n12. The instrument for measuring temperature is:\n    - A. Barometer\n    - B. Thermometer\n    - C. Hydrometer\n    - D. Manometer\n\n13. The center of gravity is:\n    - A. The point where gravity acts\n    - B. The balance point\n    - C. Both A and B\n    - D. None\n\n14. Surface tension explains why:\n    - A. Drops are spherical\n    - B. Objects float\n    - C. Liquids freeze\n    - D. Gases expand\n\n15. Relative density is:\n    - A. Density of substance / density of water\n    - B. Mass / volume\n    - C. Weight / upthrust\n    - D. None\n\n16. The law of elasticity is stated by:\n    - A. Newton\n    - B. Hooke\n    - C. Archimedes\n    - D. Pascal\n\n17. Pascal's principle is used in:\n    - A. Hydraulic press\n    - B. Barometer\n    - C. Thermometer\n    - D. Spring\n\n18. The unit of pressure is:\n    - A. Newton\n    - B. Pascal\n    - C. Joule\n    - D. Watt\n\n19. Kinetic theory explains:\n    - A. Behavior of matter\n    - B. Forces\n    - C. Energy\n    - D. Light\n\n20. Measurement of time is in:\n    - A. Meters\n    - B. Seconds\n    - C. Kilograms\n    - D. Amperes\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. Define Physics and mention three branches of Physics. (5 marks)\n\n22. Explain why Physics is important in daily life (give 4 examples). (4 marks)\n\n23. Convert 50°C to Kelvin scale. (2 marks)\n\n24. A body has mass 2 kg and volume 0.5 m³. Calculate its density. (3 marks)\n\n25. State Archimedes' Principle. (3 marks)\n\n26. Differentiate between mass and weight. (4 marks)\n\n27. Explain how friction can be reduced in machines. (4 marks)\n\n28. A stone of weight 10 N is fully immersed in water. If upthrust is 4 N, calculate apparent weight. (3 marks)\n\n29. Define pressure and state its formula. (3 marks)\n\n30. Explain surface tension with one example. (5 marks)\n\n### Section C: Structured/Essay Questions (40 Marks)\nAnswer **any two** questions.\n\n31. (a) Describe the structure of matter using kinetic theory. (6 marks)\n    \n    (b) Explain adhesion and cohesion with examples. (6 marks)\n    \n    (c) What is capillarity? Give one application. (3 marks)\n    \n    (d) Explain why a balloon filled with air floats in water but sinks when deflated. (5 marks)\n\n32. (a) Explain how to measure volume of an irregular object using displacement method. (6 marks)\n    \n    (b) A density bottle has mass 20 g empty and 70 g full of water. When full of oil, mass is 62 g. Calculate density of oil. (Density of water = 1 g/cm³) (9 marks)\n    \n    (c) Describe the use of a micrometer screw gauge. (5 marks)\n\n33. (a) State the law of flotation. (4 marks)\n    \n    (b) Explain why a ship floats while a needle sinks in water. (6 marks)\n    \n    (c) Describe a simple experiment to verify Archimedes' Principle. (5 marks)\n    \n    (d) What factors affect the upthrust on an object in a fluid? (5 marks)"
        },
        "Answers": {
          "chapter_title": "Physics Form 1 - Answers",
          "content": "**Total: 100 Marks**\n\n### Section A: Multiple Choice (20 Marks)\n(1 mark for each correct answer)\n\n1. **C. Physics**  \n   **Detailed Explanation**: Physics is the branch of science that specifically deals with the properties of matter and its interactions with energy, unlike the other options which focus on different aspects like living organisms (Biology) or chemical composition (Chemistry).\n\n2. **C. Matter**  \n   **Detailed Explanation**: Matter is defined as any substance that has mass and occupies space (volume). This distinguishes it from energy (which has no mass) or abstract concepts like force and power.\n\n3. **C. Metre**  \n   **Detailed Explanation**: The International System of Units (SI) standardizes the metre as the base unit for measuring length or distance.\n\n4. **B. Friction**  \n   **Detailed Explanation**: Friction is the resistive force that acts between two surfaces in contact, opposing any relative motion or tendency to move.\n\n5. **B. Mass / Volume**  \n   **Detailed Explanation**: Density measures how much mass is contained in a given volume. The formula ρ = m/V shows how compact the matter is – higher density means more mass packed in the same space.\n\n6. **B. Upthrust**  \n   **Detailed Explanation**: Upthrust (also called buoyant force) is the upward force exerted by a fluid (liquid or gas) on an object partially or fully immersed in it, pushing against gravity.\n\n7. **B. Increase in depth**  \n   **Detailed Explanation**: Pressure in fluids follows P = ρgh, where h is depth. As depth increases, more fluid weight presses down, increasing pressure.\n\n8. **B. Return to original shape after deformation**  \n   **Detailed Explanation**: Elastic materials deform under force but return to their original shape and size when the force is removed, as long as they stay within the elastic limit.\n\n9. **A. Solid, liquid, gas**  \n   **Detailed Explanation**: These are the three primary states of matter, distinguished by particle arrangement and movement: fixed in solids, sliding in liquids, and free/high-speed in gases.\n\n10. **C. Small lengths accurately**  \n    **Detailed Explanation**: Vernier calipers provide high precision (up to 0.01 mm) for measuring internal/external diameters, depths, and thicknesses of small objects.\n\n11. **B. Kilogram**  \n    **Detailed Explanation**: The kilogram is the SI base unit for mass, representing the quantity of matter in an object.\n\n12. **B. Thermometer**  \n    **Detailed Explanation**: A thermometer detects temperature changes through expansion of liquids, bimetallic strips, or other physical properties.\n\n13. **C. Both A and B**  \n    **Detailed Explanation**: The center of gravity is the point where the entire weight of the body acts and also where the object balances perfectly for stability.\n\n14. **A. Drops are spherical**  \n    **Detailed Explanation**: Surface tension acts like a stretched membrane, pulling the liquid surface to minimize area – a sphere has the smallest surface area for a given volume.\n\n15. **A. Density of substance / density of water**  \n    **Detailed Explanation**: Relative density (specific gravity) is a ratio that tells whether a substance will sink ( >1 ) or float ( <1 ) in water without units.\n\n16. **B. Hooke**  \n    **Detailed Explanation**: Hooke's law states that extension is directly proportional to applied force (F = ke) within the elastic limit.\n\n17. **A. Hydraulic press**  \n    **Detailed Explanation**: Pascal's principle says pressure applied to a confined fluid is transmitted undiminished in all directions, enabling force multiplication in hydraulic systems.\n\n18. **B. Pascal**  \n    **Detailed Explanation**: One Pascal (Pa) equals one Newton of force per square metre (N/m²).\n\n19. **A. Behavior of matter**  \n    **Detailed Explanation**: The kinetic theory models matter as tiny particles in constant motion, explaining properties like expansion, diffusion, and state changes with temperature.\n\n20. **B. Seconds**  \n    **Detailed Explanation**: The second is the SI base unit for measuring time intervals.\n\n**Subtotal: 20 marks**\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. (5 marks)  \n   **Answer**: Physics is the scientific study of matter, energy, and their interactions.  \n   **Branches** (any three, e.g.): Mechanics, Thermodynamics, Optics, Electromagnetism, Atomic Physics.  \n   **Detailed Explanation**: Understanding branches helps students see how physics applies to different real-world phenomena.\n\n22. (4 marks)  \n   **Answer**: Physics is essential because it explains natural events and powers technology. Examples: (1) X-rays in medicine for imaging, (2) Engines in cars using energy conversion, (3) Mobile phones using electromagnetic waves, (4) Solar panels converting light to electricity.  \n   **Detailed Explanation**: Each example shows how physics principles solve everyday problems and improve life.\n\n23. (2 marks)  \n   **Answer**: T(K) = °C + 273 → 50 + 273 = 323 K.  \n   **Detailed Explanation**: The Kelvin scale starts at absolute zero (no negative values), making it ideal for scientific calculations involving temperature ratios.\n\n24. (3 marks)  \n   **Answer**: Density = mass ÷ volume = 2 kg ÷ 0.5 m³ = 4 kg/m³.  \n   **Detailed Explanation**: Low density here means the object would float in most materials; density tells how 'heavy' something is for its size.\n\n25. (3 marks)  \n   **Answer**: When an object is immersed in a fluid, it experiences an upward buoyant force equal to the weight of the fluid displaced.  \n   **Detailed Explanation**: This principle explains why ships float and why objects feel lighter underwater.\n\n26. (4 marks)  \n   **Answer**: Mass is the amount of matter (constant, scalar, kg); Weight is gravitational force on mass (varies by location, vector, N).  \n   **Detailed Explanation**: On the Moon, your mass stays the same but weight decreases due to weaker gravity.\n\n27. (4 marks)  \n   **Answer**: Use lubricants, ball bearings, smooth surfaces, or streamlining.  \n   **Detailed Explanation**: Reducing friction saves energy (less lost as heat) and makes machines more efficient and longer-lasting.\n\n28. (3 marks)  \n   **Answer**: Apparent weight = weight - upthrust = 10 N - 4 N = 6 N.  \n   **Detailed Explanation**: Upthrust opposes gravity, making submerged objects easier to lift.\n\n29. (3 marks)  \n   **Answer**: Pressure is force per unit area; P = F/A.  \n   **Detailed Explanation**: High pressure from small area explains why knives cut easily or heels dent soft ground.\n\n30. (5 marks)  \n   **Answer**: Surface tension is the cohesive force making liquid surfaces act like stretched membranes. Example: Insects walking on water or water droplets beading on leaves.  \n   **Detailed Explanation**: Cohesive forces between water molecules pull inward, supporting light objects on the surface.\n\n**Subtotal: 40 marks**\n\n### Section C: Structured/Essay Questions (40 Marks)\n(Answer any two – 20 marks each)\n\n31. **Full Detailed Answer**:\n    (a) Kinetic theory: Matter is made of tiny particles in constant random motion. Solids – vibrate in fixed positions; Liquids – slide past each other; Gases – move freely and rapidly. Temperature increases motion.\n    (b) Adhesion – attraction between unlike molecules (water wets glass); Cohesion – between like molecules (mercury beads up).\n    (c) Capillarity – rise/fall of liquid in narrow tubes due to surface tension. Application: Water rises in plant roots/soil.\n    (d) Inflated balloon displaces more water volume → greater upthrust equals its weight → floats. Deflated displaces less → upthrust < weight → sinks.\n    \n    **Detailed Explanation**: This shows how volume displaced directly affects buoyancy per Archimedes.\n\n32. **Full Detailed Answer**:\n    (a) Use overflow can or measuring cylinder: Note initial water level, immerse object, measure displaced water volume.\n    (b) Volume of bottle = (70g - 20g)/1 g/cm³ = 50 cm³. Density of oil = (62g - 20g)/50 cm³ = 42g/50 cm³ = 0.84 g/cm³.\n    (c) Micrometer: Zero it, place object between anvil and spindle, turn thimble until contact, read main scale + circular scale.\n    \n    **Detailed Explanation**: Step-by-step precision ensures accurate measurements for scientific work.\n\n33. **Full Detailed Answer**:\n    (a) A floating object displaces fluid equal to its own weight.\n    (b) Ship – large volume displaces enough water for upthrust = weight; Needle – small volume, high density, upthrust < weight.\n    (c) Weigh object in air and in water; loss in weight = weight of displaced water.\n    (d) Fluid density, immersed volume, and gravitational acceleration.\n    \n    **Detailed Explanation**: These factors determine whether objects sink or float in real-life applications like ship design.\n\n**Grand Total: 100 marks**"
        }
      },
      "CHEMISTRY": {
"chapter_title": "Chemistry Form 1 - Terminal Examination Series 1",
"content": "Time: 2 Hours 30 Minutes \nTotal Marks: 100\n\n### Section A: Multiple Choice Questions (20 Marks)\nAnswer all questions. Each question carries 1 mark.\n\n1. The branch of science that deals with the composition, properties and behavior of matter is:\n - A. Biology\n - B. Physics\n - C. Chemistry\n - D. Geography\n\n2. One importance of chemistry in daily life is the production of:\n - A. Medicines\n - B. Vehicles\n - C. Computers\n - D. Books\n\n3. A chemistry laboratory should have:\n - A. Good ventilation\n - B. No windows\n - C. Locked doors always\n - D. Food storage\n\n4. The warning sign for 'toxic' indicates a substance that is:\n - A. Poisonous\n - B. Flammable\n - C. Explosive\n - D. Corrosive\n\n5. First aid for acid ingestion involves giving:\n - A. Neutralizers like milk of magnesia\n - B. More acid\n - C. Water only\n - D. Salt\n\n6. Matter is anything that has:\n - A. Mass and occupies space\n - B. Color only\n - C. Shape only\n - D. Smell\n\n7. Combustion is a:\n - A. Chemical change\n - B. Physical change\n - C. No change\n - D. Reversible change\n\n8. The hottest part of a non-luminous Bunsen flame is:\n - A. The top of the inner blue cone\n - B. The base\n - C. The luminous yellow part\n - D. The air hole\n\n9. Sublimation is the change from:\n - A. Solid to gas directly\n - B. Gas to liquid\n - C. Liquid to solid\n - D. Solid to liquid\n\n10. An element consists of:\n - A. Only one type of atom\n - B. Different atoms\n - C. Molecules only\n - D. Mixtures\n\n11. Decantation is used to separate:\n - A. Insoluble solids from liquids\n - B. Soluble salts\n - C. Gases\n - D. Liquids of same density\n\n12. Oxygen molecule is:\n - A. Diatomic\n - B. Monoatomic\n - C. Triatomic\n - D. Polyatomic\n\n13. The symbol for gold is:\n - A. Au\n - B. Ag\n - C. Go\n - D. Gd\n\n14. Compounds have:\n - A. Fixed composition by mass\n - B. Variable composition\n - C. Same properties as elements\n - D. No chemical bonds\n\n15. The valency of oxygen is:\n - A. 2\n - B. 1\n - C. 3\n - D. 0\n\n16. Water is considered a compound because:\n - A. It is made of hydrogen and oxygen chemically combined\n - B. It is liquid\n - C. It is colorless\n - D. It boils at 100°C\n\n17. The preferred flame for heating in lab is:\n - A. Non-luminous\n - B. Luminous\n - C. Yellow\n - D. Smoky\n\n18. Laboratory coat protects:\n - A. The body and clothes\n - B. Hands only\n - C. Floor\n - D. Table\n\n19. Gases diffuse fastest because particles:\n - A. Move freely and far apart\n - B. Are closely packed\n - C. Vibrate only\n - D. Slide slowly\n\n20. The base unit for amount of substance is:\n - A. Mole\n - B. Gram\n - C. Liter\n - D. Kelvin\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. Mention four areas where chemistry is applied. (4 marks)\n\n22. Give three reasons why we study chemistry. (3 marks)\n\n23. List four safety rules in a chemistry laboratory. (4 marks)\n\n24. Draw and label a non-luminous Bunsen burner flame. (5 marks)\n\n25. Define an element and give three examples. (4 marks)\n\n26. Distinguish between a mixture and a compound. (4 marks)\n\n27. Explain what makes water a good solvent. (4 marks)\n\n28. Name four separation techniques and give one example for each. (8 marks)\n\n29. State three differences between chemical and physical changes. (3 marks)\n\n30. Write chemical symbols for: Sulphur, Silver, Lead, Zinc. (4 marks)\n\n### Section C: Structured/Essay Questions (40 Marks)\nAnswer any two questions.\n\n31. (a) Describe five laboratory safety precautions. (10 marks)\n (b) Describe how to prepare and collect oxygen gas in the laboratory. (10 marks)\n\n32. (a) Outline the steps in the scientific procedure. (5 marks)\n (b) Using kinetic theory, explain the behavior of particles in solids, liquids and gases. (10 marks)\n (c) What is diffusion? Provide two examples. (5 marks)\n\n33. (a) Write chemical formulae for: Magnesium oxide, Potassium chloride, Copper sulphate. (6 marks)\n (b) Define valency and state valencies for: Sodium, Chlorine, Sulphur, Aluminium. (8 marks)\n (c) Explain the role of first aid kit in the laboratory. (6 marks)"
},
"Answers": {
"chapter_title": "Chemistry Form 1 - Answers Series 1",
"content": "Total: 100 Marks\n\n### Section A: Multiple Choice (20 Marks)\n(1 mark each)\n\n1. C\n\n2. A\n\n3. A\n\n4. A\n\n5. A\n\n6. A\n\n7. A\n\n8. A\n\n9. A\n\n10. A\n\n11. A\n\n12. A\n\n13. A\n\n14. A\n\n15. A\n\n16. A\n\n17. A\n\n18. A\n\n19. A\n\n20. A\n\nSubtotal: 20 marks\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. (4 marks)\n Answers: Medicine, agriculture, industry, environment (any four).\n\n22. (3 marks)\n Answers: Improves life, careers, understanding natural phenomena (any three).\n\n23. (4 marks)\n Answers: No eating, wear protective gear, handle carefully, follow instructions (any four).\n\n24. (5 marks)\n Answer: Label zones: inner dark, blue, pale blue/green, almost invisible hottest zone.\n\n25. (4 marks)\n Answer: Substance with only one type of atom. Examples: Hydrogen, Carbon, Iron.\n\n26. (4 marks)\n Answer: Mixture: variable composition, physical mix, retains properties; Compound: fixed, chemical, new properties.\n\n27. (4 marks)\n Answer: Polar molecule, dissolves ionic and polar substances.\n\n28. (8 marks)\n Answers: Decantation (sediment-water), Filtration (sand-water), Evaporation (salt-solution), Distillation (water-alcohol).\n\n29. (3 marks)\n Differences: Physical-reversible, no new substance; Chemical-irreversible, new substance, energy changes.\n\n30. (4 marks)\n Answers: S, Ag, Pb, Zn.\n\nSubtotal: 40 marks\n\n### Section C: Structured/Essay Questions (40 Marks)\n(Answer any two – 20 marks each)\n\n31. Full Answer:\n (a) Wear goggles/coats, no running, proper labeling, ventilation, know emergency procedures.\n (b) Manganese(IV) oxide + hydrogen peroxide → oxygen + water; collect by downward displacement of water; test: relights glowing splint.\n\n32. Full Answer:\n (a) Observation, hypothesis, experiment, data, conclusion.\n (b) Solids: vibrate fixed; Liquids: move around close; Gases: rapid random far apart.\n (c) Movement of particles from high to low concentration; e.g., ammonia diffusion, ink in water.\n\n33. Full Answer:\n (a) MgO, KCl, CuSO₄.\n (b) Combining power; Na=1, Cl=1, S=2, Al=3.\n (c) Provides immediate care for accidents to minimize injury.\n\nGrand Total: 100 marks"
}
}
    }
