{
  "FTNA-SERIES5": {
    "GEOGRAPHY": {
      "chapter_title": "Geography Form Two - FTNA 2025 Sample Examination",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n013 GEOGRAPHY\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Calculators and cellular phones are not allowed in the examination room.\n7. Write your Assessment Number at the top right corner of every page.\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The angular distance measured in degrees north and south of the equator is called\n - A. latitude\n - B. longitude\n - C. meridian\n - D. parallel\n\n   (ii) The evidence that the Earth is spherical includes\n - A. ships disappearing over the horizon\n - B. time zones\n - C. lunar eclipse\n - D. all of the above\n\n   (iii) The highest point on the Earth's surface is\n - A. Mount Everest\n - B. Mount Kilimanjaro\n - C. Mount Kenya\n - D. Mount Fuji\n\n   (iv) The process by which water changes from liquid to vapour is called\n - A. condensation\n - B. evaporation\n - C. precipitation\n - D. sublimation\n\n   (v) The type of rainfall caused by the meeting of warm and cold air masses is\n - A. relief rainfall\n - B. convectional rainfall\n - C. frontal rainfall\n - D. cyclonic rainfall\n\n   (vi) The largest ocean in the world is\n - A. Atlantic Ocean\n - B. Indian Ocean\n - C. Pacific Ocean\n - D. Arctic Ocean\n\n   (vii) The layer of the atmosphere where weather changes occur is\n - A. troposphere\n - B. stratosphere\n - C. mesosphere\n - D. thermosphere\n\n   (viii) The instrument used to measure atmospheric pressure is\n - A. thermometer\n - B. barometer\n - C. anemometer\n - D. hygrometer\n\n   (ix) The type of map that shows natural features is\n - A. political map\n - B. physical map\n - C. climatic map\n - D. economic map\n\n   (x) The capital city of Tanzania is\n - A. Dar es Salaam\n - B. Dodoma\n - C. Arusha\n - D. Mwanza\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Longitude\n\n   (ii) Equator\n\n   (iii) Rotation of the Earth\n\n   (iv) Revolution of the Earth\n\n   (v) Contour lines\n\n   List B\n\n   A. Causes day and night\n\n   B. Imaginary line dividing Earth into Northern and Southern hemispheres\n\n   C. Lines on map showing height above sea level\n\n   D. Imaginary lines running from North to South Pole\n\n   E. Causes seasons\n\n3. (a) Define the term 'latitude'.\n\n   (b) State the importance of the equator to climate.\n\n4. (a) Name three types of rocks.\n\n   (b) Explain how sedimentary rocks are formed.\n\n5. (a) What is meant by 'weathering'?\n\n   (b) Give two examples of physical weathering.\n\n6. (a) Draw a labelled diagram of the water cycle.\n\n   (b) State two importance of the water cycle.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. (a) Explain why Tanzania experiences high temperatures near the coast.\n\n   (b) Describe the factors influencing climate in Tanzania.\n\n8. (a) Define 'population distribution'.\n\n   (b) Explain why population is unevenly distributed in Tanzania.\n\n9. (a) What is meant by 'agriculture'?\n\n   (b) Describe the importance of agriculture to the economy of Tanzania.\n\n10. (a) Explain the difference between renewable and non-renewable resources.\n\n    (b) Give three examples of each in Tanzania.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to show the effects of deforestation.\n\n    (b) Explain three effects of deforestation in Tanzania.\n    (c) Suggest three measures to control deforestation.\n\n"
    },
    "Answers": {
      "chapter_title": "Geography Form Two - FTNA 2025 Sample Examination Answers",
      "content": "1. (i) A (ii) D (iii) A (iv) B (v) C (vi) C (vii) A (viii) B (ix) B (x) B\n\n2. (i) D (ii) B (iii) A (iv) E (v) C\n\n3. (a) Latitude is the angular distance north or south of the equator.\n\n (b) The equator receives direct sunlight throughout the year, leading to high temperatures and equatorial climate.\n\n4. (a) Igneous, sedimentary, metamorphic.\n\n (b) Formed by deposition and compaction of sediments over time.\n\n5. (a) Weathering is the breakdown of rocks into smaller particles.\n\n (b) Freeze-thaw action, exfoliation.\n\n6. (a) [Diagram: evaporation, condensation, precipitation, collection]\n\n (b) Regulates water availability, maintains hydrological balance.\n\n7. (a) Proximity to the ocean moderates temperatures due to sea breezes.\n\n (b) Latitude, altitude, ocean currents, distance from sea, vegetation.\n\n8. (a) Population distribution is the spread of people over an area.\n\n (b) Factors: relief, climate, soil fertility, economic opportunities, historical factors.\n\n9. (a) Agriculture is the cultivation of crops and rearing of animals.\n\n (b) Provides employment, food security, exports (e.g., coffee, cashew), contributes to GDP.\n\n10. (a) Renewable: can be replenished naturally; non-renewable: finite resources.\n\n (b) Renewable: solar, wind, water, forests. Non-renewable: coal, petroleum, natural gas.\n\n11. (a) [Experiment: compare soil erosion in vegetated vs. bare soil plots]\n\n (b) Soil erosion, loss of biodiversity, climate change.\n\n (c) Afforestation, sustainable logging, education, law enforcement.\n\nNote: This is a sample based on the typical FTNA Geography format (sections A, B, C) and syllabus topics for Form 1-2, including physical geography, human geography, and Tanzania-specific content. Aligned with NECTA standards from recent exams (e.g., 2024 patterns)."
    }
  }
}
