{
"TERMINAL EXAMS-SERIES3": {
"PHYSICS": {
"chapter_title": "Physics Form 1 - Terminal Examination Series 3",
"content": "Time: 2 Hours 30 Minutes \nTotal Marks: 100\n\n### Section A: Multiple Choice Questions (20 Marks)\nAnswer all questions. Each question carries 1 mark.\n\n1. The scientific study of energy and its transformation is a key aspect of:\n - A. Chemistry\n - B. Biology\n - C. Physics\n - D. Geology\n\n2. Which of the following is a vector quantity?\n - A. Mass\n - B. Temperature\n - C. Weight\n - D. Density\n\n3. The SI unit of pressure is:\n - A. Newton\n - B. Pascal\n - C. Joule\n - D. Watt\n\n4. An object feels lighter in water due to:\n - A. Reduced gravity\n - B. Upthrust\n - C. Increased mass\n - D. Surface tension\n\n5. The law that states 'extension is proportional to force' is:\n - A. Archimedes' law\n - B. Pascal's law\n - C. Hooke's law\n - D. Newton's law\n\n6. A hydrometer is used to measure:\n - A. Temperature\n - B. Pressure\n - C. Relative density\n - D. Volume\n\n7. In gases, particles move:\n - A. In fixed positions\n - B. Slowly past each other\n - C. Freely and randomly\n - D. Only vertically\n\n8. The point where the weight of an object appears to act is called:\n - A. Center of mass\n - B. Center of gravity\n - C. Balance point\n - D. Both A and B\n\n9. Friction can be reduced by:\n - A. Increasing roughness\n - B. Using lubricants\n - C. Increasing weight\n - D. Decreasing speed\n\n10. The volume of a regular solid is calculated using:\n - A. Displacement method\n - B. Mathematical formula\n - C. Density bottle\n - D. Hydrometer\n\n11. An object with relative density 0.8 will:\n - A. Sink in water\n - B. Float in water\n - C. Suspend in water\n - D. Dissolve in water\n\n12. The instrument used to measure small diameters accurately is:\n - A. Ruler\n - B. Vernier caliper\n - C. Micrometer screw gauge\n - D. Measuring cylinder\n\n13. Pressure at a point in a liquid depends on:\n - A. Area of surface\n - B. Volume of liquid\n - C. Depth and density\n - D. Temperature only\n\n14. Cohesive forces are strongest in:\n - A. Gases\n - B. Liquids\n - C. Solids\n - D. Plasma\n\n15. A steel ship floats because:\n - A. Steel is less dense than water\n - B. It displaces water equal to its weight\n - C. It has no weight\n - D. Friction holds it up\n\n16. The elastic limit is exceeded when a material:\n - A. Returns to original shape\n - B. Becomes permanently deformed\n - C. Breaks immediately\n - D. Expands uniformly\n\n17. An example of capillarity is:\n - A. Raindrops on window\n - B. Oil rising in a lamp wick\n - C. Balloon bursting\n - D. Ice melting\n\n18. The apparent weight of a floating object is:\n - A. Zero\n - B. Equal to its real weight\n - C. Greater than real weight\n - D. Half the real weight\n\n19. Which force enables insects to walk on water?\n - A. Gravity\n - B. Friction\n - C. Surface tension\n - D. Upthrust\n\n20. The base unit of time in SI is:\n - A. Minute\n - B. Hour\n - C. Second\n - D. Day\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. Define matter and state its three common states. (4 marks)\n\n22. Explain why gases are compressible while solids are not. (4 marks)\n\n23. Convert 37°C to Kelvin scale. (2 marks)\n\n24. A stone has mass 300 g and volume 120 cm³. Calculate its density in g/cm³. (3 marks)\n\n25. State Pascal's principle. (3 marks)\n\n26. Differentiate between weight and upthrust. (4 marks)\n\n27. List three advantages of friction in daily life. (3 marks)\n\n28. An object weighs 100 N in air and 70 N when immersed in water. Calculate the upthrust and relative density. (Density of water = 1000 kg/m³, g=10 N/kg) (6 marks)\n\n29. Define surface tension and give two examples. (4 marks)\n\n30. Explain why the center of gravity affects stability. (4 marks)\n\n### Section C: Structured/Essay Questions (40 Marks)\nAnswer any two questions.\n\n31. (a) Describe the kinetic theory of matter for liquids. (5 marks)\n \n (b) Explain adhesion and cohesion forces with one example each. (6 marks)\n \n (c) What is capillarity? Describe how it occurs in water and mercury differently. (5 marks)\n \n (d) Give two applications of capillarity. (4 marks)\n\n32. (a) State Archimedes' principle and explain why a ship floats. (6 marks)\n \n (b) Describe an experiment to verify Archimedes' principle using a spring balance. (8 marks)\n \n (c) A body has weight 50 N in air and 30 N in a liquid. Calculate the density of the liquid if the body's volume is 0.002 m³. (g=10 m/s²) (6 marks)\n\n33. (a) Explain three ways to increase stability of a body. (6 marks)\n \n (b) Describe how to measure the extension of a spring using Hooke's law apparatus. (6 marks)\n \n (c) State three methods of reducing friction and explain one. (5 marks)\n \n (d) Why is oil used in machines? (3 marks)"
},
"Answers": {
"chapter_title": "Physics Form 1 - Answers Series 3",
"content": "Total: 100 Marks\n\n### Section A: Multiple Choice (20 Marks)\n(1 mark for each correct answer)\n\n1. C. Physics \n Detailed Explanation: Physics is the branch of science that specifically deals with energy, its forms, conversions, and interactions with matter, unlike the other options which focus on different aspects like chemical reactions (Chemistry) or living organisms (Biology).\n\n2. C. Weight \n Detailed Explanation: Weight is a vector quantity because it has both magnitude and direction (downward towards Earth's center), while mass, temperature, and density are scalars with only magnitude.\n\n3. B. Pascal \n Detailed Explanation: The SI unit of pressure is Pascal (Pa), defined as one Newton per square metre (N/m²).\n\n4. B. Upthrust \n Detailed Explanation: Upthrust (buoyant force) opposes gravity when an object is immersed, making it feel lighter by an amount equal to the weight of fluid displaced.\n\n5. C. Hooke's law \n Detailed Explanation: Hooke's law describes elastic behavior where extension is directly proportional to the applied force within the elastic limit.\n\n6. C. Relative density \n Detailed Explanation: A hydrometer floats higher or lower depending on the liquid's density compared to water, directly indicating relative density.\n\n7. C. Freely and randomly \n Detailed Explanation: In gases, particles have high kinetic energy and weak intermolecular forces, allowing free, rapid, and random motion.\n\n8. D. Both A and B \n Detailed Explanation: The center of gravity is the point where the entire weight acts and also where the object balances perfectly.\n\n9. B. Using lubricants \n Detailed Explanation: Lubricants create a thin film that separates surfaces, reducing direct contact and thus friction.\n\n10. B. Mathematical formula \n Detailed Explanation: For regular shapes like cubes (l³) or cylinders (πr²h), volume is calculated directly using dimensions.\n\n11. B. Float in water \n Detailed Explanation: Relative density less than 1 means the object's density is less than water's, so upthrust exceeds weight and it floats.\n\n12. C. Micrometer screw gauge \n Detailed Explanation: It provides high precision (up to 0.001 mm) for measuring very small thicknesses or diameters.:\n\n13. C. Depth and density \n Detailed Explanation: Hydrostatic pressure formula P = ρgh shows it increases with fluid density (ρ) and depth (h), independent of container shape.\n\n14. C. Solids \n Detailed Explanation: Strong cohesive forces keep particles in fixed positions, maintaining definite shape and volume.\n\n15. B. It displaces water equal to its weight \n Detailed Explanation: According to the law of flotation, a floating object displaces fluid whose weight equals its own weight.\n\n16. B. Becomes permanently deformed \n Detailed Explanation: Beyond the elastic limit, the material enters the plastic region and does not return to original shape.\n\n17. B. Oil rising in a lamp wick \n Detailed Explanation: Adhesion between oil and wick fibers pulls the liquid upward in narrow spaces.\n\n18. A. Zero \n Detailed Explanation: For a floating object, upthrust fully balances weight, so apparent weight (force needed to support) is zero.\n\n19. C. Surface tension \n Detailed Explanation: Surface tension creates a 'skin-like' effect on water, supporting light objects like insects.\n\n20. C. Second \n Detailed Explanation: The second is the base SI unit for time, used in all scientific measurements.\n\nSubtotal: 20 marks\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. (4 marks) \n Answer: Matter is anything that has mass and occupies space. Three common states: solid, liquid, gas. \n Detailed Explanation: This definition distinguishes matter from energy and forms the basis for studying states and properties.\n\n22. (4 marks) \n Answer: Gases have particles far apart with weak forces → easily pushed closer (compressible); solids have tightly packed particles with strong forces → resist compression. \n Detailed Explanation: Kinetic theory highlights particle spacing and force strength as key to compressibility differences.\n\n23. (2 marks) \n Answer: K = °C + 273 = 37 + 273 = 310 K. \n Detailed Explanation: Kelvin scale starts at absolute zero, essential for gas laws and thermodynamic calculations.\n\n24. (3 marks) \n Answer: Density = mass / volume = 300 g / 120 cm³ = 2.5 g/cm³. \n Detailed Explanation: Value >1 g/cm³ means the stone sinks in water, showing density's role in flotation.\n\n25. (3 marks) \n Answer: Pressure applied to an enclosed fluid is transmitted equally and undiminished in all directions. \n Detailed Explanation: This principle enables force multiplication in hydraulic machines like jacks and brakes.\n\n26. (4 marks) \n Answer: Weight is gravitational force on mass (varies with location); upthrust is buoyant force from displaced fluid (depends on immersion). \n Detailed Explanation: Weight changes on Moon, but upthrust depends on fluid properties.\n\n27. (3 marks) \n Answer: Enables walking (grip), vehicle braking, holding nails/screws. \n Detailed Explanation: Without friction, motion control would be impossible in daily activities.\n\n28. (6 marks) \n Answer: Upthrust = 100 N - 70 N = 30 N. Mass = 100 N / 10 N/kg = 10 kg. Volume = upthrust / (ρ_water g) = 30 / (1000 × 10) = 0.003 m³. Relative density = (10 kg / 0.003 m³) / 1000 = 3.33. \n Detailed Explanation: Combines weight loss with Archimedes' principle to find density ratio.\n\n29. (4 marks) \n Answer: Surface tension is the property where liquid surface behaves like a stretched membrane due to cohesion. Examples: spherical droplets, insects walking on water. \n Detailed Explanation: Minimizes surface area, explaining many everyday observations.\n\n30. (4 marks) \n Answer: Lower center of gravity means the vertical line through it falls outside the base only at larger tilt angles → greater stability. \n Detailed Explanation: Crucial in design of vehicles and structures to prevent toppling.\n\nSubtotal: 40 marks\n\n### Section C: Structured/Essay Questions (40 Marks)\n(Answer any two – 20 marks each)\n\n31. Full Detailed Answer:\n (a) In liquids, particles are close but not fixed, slide past each other, have moderate kinetic energy, fixed volume but no fixed shape.\n (b) Adhesion: attraction between unlike molecules (e.g., water wetting glass); Cohesion: between like molecules (e.g., water droplets beading).\n (c) Capillarity: rise or fall of liquid in narrow tubes. Water: adhesion > cohesion → concave meniscus → rise; Mercury: cohesion > adhesion → convex meniscus → depression.\n (d) Water transport in plants, absorption in towels/soil.\n \n Detailed Explanation: These intermolecular forces explain wetting phenomena and natural processes like plant nutrition.\n\n32. Full Detailed Answer:\n (a) Upthrust equals weight of fluid displaced. Ship floats because its large volume (including air) displaces water weight equal to total ship weight.\n (b) Suspend object from spring balance, record weight in air. Immerse in water, record new reading; difference = upthrust = weight of displaced water (collect and weigh if needed).\n (c) Upthrust = 50 N - 30 N = 20 N. Density = upthrust / (V g) = 20 / (0.002 × 10) = 1000 kg/m³.\n \n Detailed Explanation: Demonstrates Archimedes' principle experimentally and applies to buoyancy calculations.\n\n33. Full Detailed Answer:\n (a) Lower center of gravity, widen base, distribute weight evenly at bottom.\n (b) Fix spring vertically, note initial length. Add known weights gradually, measure new lengths; extension = new - initial.\n (c) Lubricants (form slippery layer), ball bearings (rolling instead of sliding), streamlining (reduce air resistance).\n (d) Acts as lubricant to reduce friction, prevents wear, and helps cool moving parts.\n \n Detailed Explanation: Practical methods improve efficiency and safety in machines and vehicles.\n\nGrand Total: 100 marks"
}
}
}
