{
"FTNA-SERIES6": {
"HISTORY": {
"chapter_title": "History Form Two - FTNA 2025 Sample Examination",
"content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n012 HISTORY\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries fifteen (15) marks, section B seventy (70) marks and section C carries fifteen (15) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Cellular phones and any unauthorised materials are not allowed in the assessment room.\n7. Write your Assessment Number at the top right corner of every page.\n\nSECTION A (15 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The study of past human activities is called\n - A. Geography\n - B. History\n - C. Civics\n - D. Economics\n\n   (ii) The remains of ancient tools and weapons are examples of\n - A. oral traditions\n - B. historical sites\n - C. archaeology\n - D. written records\n\n   (iii) The period when humans used stone tools is known as\n - A. Iron Age\n - B. Stone Age\n - C. Bronze Age\n - D. Middle Age\n\n   (iv) The evolution of man is associated with\n - A. Charles Darwin\n - B. Louis Leakey\n - C. Julius Nyerere\n - D. Haile Selassie\n\n   (v) The main economic activity in pre-colonial Africa was\n - A. trade\n - B. agriculture\n - C. mining\n - D. fishing\n\n   (vi) The kingdom of Mali was founded by\n - A. Mansa Musa\n - B. Sundiata Keita\n - C. Shaka Zulu\n - D. Samori Toure\n\n   (vii) The first European explorers in Africa were from\n - A. Britain\n - B. France\n - C. Portugal\n - D. Germany\n\n   (viii) Industrial capitalism led to\n - A. feudalism\n - B. colonialism\n - C. socialism\n - D. communism\n\n   (ix) The Berlin Conference of 1884-1885 was about\n - A. dividing Africa\n - B. uniting Africa\n - C. trading in Africa\n - D. educating Africans\n\n   (x) Interactions among African people included\n - A. migration\n - B. trade\n - C. intermarriages\n - D. all of the above\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Olduvai Gorge\n\n   (ii) Bantu migration\n\n   (iii) Slave trade\n\n   (iv) Ngoni migration\n\n   (v) Industrial Revolution\n\n   List B\n\n   A. Movement from Congo basin\n\n   B. Site for early man remains\n\n   C. Started in Britain\n\n   D. Caused by Mfecane wars\n\n   E. Involved capture and sale of humans\n\nSECTION B (70 Marks)\nAnswer all questions in this section.\n\n3. (a) Define the term 'history'.\n\n   (b) Explain two importance of studying history.\n\n4. (a) What are sources of history?\n\n   (b) Give three examples of primary sources.\n\n5. (a) Describe the stages of human evolution.\n\n   (b) Explain how fire discovery impacted early man.\n\n6. (a) What is feudalism?\n\n   (b) Name two feudal systems in pre-colonial Africa.\n\n7. (a) Explain the development of trade in pre-colonial Africa.\n\n   (b) Describe the impacts of long-distance trade.\n\n8. (a) What was the triangular trade?\n\n   (b) Explain the effects of slave trade on Africa.\n\n9. (a) Define industrial capitalism.\n\n   (b) How did it lead to the scramble for Africa?\n\nSECTION C (15 Marks)\nAnswer question 10.\n\n10. Discuss the interactions among the people of Africa before colonialism, giving examples of positive and negative impacts.\n\n"
},
"Answers": {
"chapter_title": "History Form Two - FTNA 2025 Sample Examination Answers",
"content": "1. (i) B (ii) C (iii) B (iv) A (v) B (vi) B (vii) C (viii) B (ix) A (x) D\n\n2. (i) B (ii) A (iii) E (iv) D (v) C\n\n3. (a) History is the study of past human activities.\n\n (b) Helps understand present, avoids past mistakes, promotes national identity.\n\n4. (a) Sources of history are materials providing information about the past.\n\n (b) Archaeology, oral traditions, written records.\n\n5. (a) Australopithecus, Homo habilis, Homo erectus, Homo sapiens.\n\n (b) Enabled cooking, warmth, protection, tool making.\n\n6. (a) Feudalism is a system where land is owned by lords and worked by peasants.\n\n (b) Bunyoro-Kitara, Mali empire.\n\n7. (a) Barter trade evolved to use of currencies like cowrie shells.\n\n (b) Spread of Islam, population increase, rise of states.\n\n8. (a) Trade between Europe, Africa, and Americas involving slaves, goods.\n\n (b) Depopulation, wars, underdevelopment.\n\n9. (a) Stage of capitalism with machine production and factories.\n\n (b) Need for raw materials, markets led to colonization.\n\n10. Interactions included trade (positive: economic growth, cultural exchange; negative: conflicts), migrations (positive: spread of technology; negative: wars like Ngoni invasions), intermarriages (positive: unity; negative: loss of culture).\n\n\nNote: This is a sample based on the official NECTA FTNA History format from the 2022 updated document, which applies to 2025 exams. Questions cover the specified topics: Sources and importance of History, Evolution of man, technology and environment, Development of economic activities and their impacts, Development of social and political systems, Interactions among the people of Africa, Socio-economic development and production in pre-colonial Africa, Africa and the external world, Industrial capitalism. Actual papers may vary in specific questions but follow this structure."
}
}
}
