{
"TERMINAL EXAMS-SERIES2": {
"PHYSICS": {
"chapter_title": "Physics Form 1 - Terminal Examination Series 2",
"content": "Time: 2 Hours 30 Minutes \nTotal Marks: 100\n\n### Section A: Multiple Choice Questions (20 Marks)\nAnswer all questions. Each question carries 1 mark.\n\n1. The branch of physics that deals with heat and temperature is:\n - A. Optics\n - B. Mechanics\n - C. Thermodynamics\n - D. Electricity\n\n2. Which of the following is NOT a fundamental quantity?\n - A. Length\n - B. Mass\n - C. Time\n - D. Density\n\n3. The SI unit of force is:\n - A. Pascal\n - B. Newton\n - C. Joule\n - D. Watt\n\n4. Frictional force is advantageous because it enables:\n - A. Vehicles to stop\n - B. Planes to fly\n - C. Boats to float\n - D. Magnets to attract\n\n5. An object will float in a liquid if its density is:\n - A. Greater than the liquid's density\n - B. Equal to the liquid's density\n - C. Less than the liquid's density\n - D. Zero\n\n6. The principle behind hydraulic brakes is:\n - A. Archimedes' principle\n - B. Pascal's principle\n - C. Hooke's law\n - D. Newton's third law\n\n7. The maximum load a spring can take without permanent deformation is called:\n - A. Elastic limit\n - B. Yield point\n - C. Breaking point\n - D. Proportional limit\n\n8. Which instrument measures atmospheric pressure?\n - A. Hydrometer\n - B. Barometer\n - C. Manometer\n - D. Thermometer\n\n9. In solids, particles are held together by strong:\n - A. Cohesive forces\n - B. Adhesive forces\n - C. Gravitational forces\n - D. Magnetic forces\n\n10. The volume of a liquid is best measured using a:\n - A. Measuring cylinder\n - B. Vernier caliper\n - C. Micrometer screw gauge\n - D. Beam balance\n\n11. The weight of an object is 50 N on Earth. Its mass is approximately:\n - A. 5 kg\n - B. 50 kg\n - C. 500 kg\n - D. 490 kg\n\n12. Capillarity in plants helps in the transport of:\n - A. Food\n - B. Water\n - C. Oxygen\n - D. Carbon dioxide\n\n13. The apparent loss in weight of an object in water is due to:\n - A. Upthrust\n - B. Friction\n - C. Gravity\n - D. Surface tension\n\n14. The unit of relative density is:\n - A. kg/m³\n - B. g/cm³\n - C. No unit\n - D. Newton\n\n15. Which of the following increases friction?\n - A. Lubricants\n - B. Ball bearings\n - C. Rough surfaces\n - D. Streamlining\n\n16. The boiling point of pure water at standard pressure is:\n - A. 0°C\n - B. 100°C\n - C. 273 K\n - D. Both B and C\n\n17. An example of adhesion is:\n - A. Water droplets on a leaf\n - B. Mercury forming a sphere\n - C. Ink rising in a blotting paper\n - D. Water meniscus in a glass tube (concave)\n\n18. The formula for pressure in fluids is:\n - A. P = F × A\n - B. P = ρgh\n - C. P = m/V\n - D. P = F - A\n\n19. Stability of an object is highest when the center of gravity is:\n - A. High and base narrow\n - B. Low and base wide\n - C. High and base wide\n - D. Low and base narrow\n\n20. A body sinks in water if its relative density is:\n - A. Less than 1\n - B. Equal to 1\n - C. Greater than 1\n - D. Zero\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. List four laboratory safety rules in a physics lab. (4 marks)\n\n22. State three differences between solids, liquids, and gases according to kinetic theory. (6 marks)\n\n23. Convert 300 K to Celsius scale. (2 marks)\n\n24. A block has dimensions 2 cm × 5 cm × 10 cm and mass 400 g. Calculate its density in g/cm³. (4 marks)\n\n25. State Hooke's law and give its formula. (3 marks)\n\n26. Explain why sharp knives cut better than blunt ones. (3 marks)\n\n27. Define relative density and state how to determine if an object floats or sinks. (4 marks)\n\n28. An object weighs 80 N in air and 60 N in water. Calculate the upthrust. (3 marks)\n\n29. Give three applications of surface tension in daily life. (3 marks)\n\n30. Explain the terms elastic limit and plasticity. (5 marks)\n\n### Section C: Structured/Essay Questions (40 Marks)\nAnswer any two questions.\n\n31. (a) Describe an experiment to measure the density of an irregular solid using a measuring cylinder. (6 marks)\n \n (b) A eureka can is filled with water to the spout. When a stone of mass 200 g is lowered in, 50 cm³ of water overflows. Calculate the density of the stone. (Density of water = 1 g/cm³) (6 marks)\n \n (c) Explain two factors that affect stability of a body. (4 marks)\n \n (d) Why do racing cars have wide tyres and low bodies? (4 marks)\n\n32. (a) State Pascal's principle and give two applications. (6 marks)\n \n (b) Explain how friction can be both useful and harmful, with examples. (8 marks)\n \n (c) Describe how to reduce unwanted friction in machines (give three methods). (6 marks)\n\n33. (a) Explain cohesion and adhesion, and how they cause capillarity in narrow tubes. (8 marks)\n \n (b) Why does a convex meniscus form in mercury while concave in water in glass tubes? (4 marks)\n \n (c) Describe a simple experiment to demonstrate surface tension using a needle on water. (4 marks)\n \n (d) State two applications of capillarity in nature. (4 marks)"
},
"Answers": {
"chapter_title": "Physics Form 1 - Answers Series 2",
"content": "Total: 100 Marks\n\n### Section A: Multiple Choice (20 Marks)\n(1 mark for each correct answer)\n\n1. C. Thermodynamics \n Detailed Explanation: Thermodynamics is the study of heat, temperature, and energy transfer, distinguishing it from optics (light), mechanics (motion and forces), and electricity.\n\n2. D. Density \n Detailed Explanation: Fundamental quantities have independent units (length-metre, mass-kg, time-second); density is derived (mass/volume).\n\n3. B. Newton \n Detailed Explanation: Force = mass × acceleration, so unit is kg·m/s², named Newton.\n\n4. A. Vehicles to stop \n Detailed Explanation: Friction between tyres and road provides grip for braking; without it, vehicles would skid.\n\n5. C. Less than the liquid's density \n Detailed Explanation: For floating, upthrust must equal weight, which requires displacing less mass than the object's own mass per volume.\n\n6. B. Pascal's principle \n Detailed Explanation: Pressure applied to enclosed fluid is transmitted equally, allowing small force on large piston to lift heavy loads.\n\n7. A. Elastic limit \n Detailed Explanation: Beyond elastic limit, permanent deformation occurs; it's the stress limit for elastic behavior.\n\n8. B. Barometer \n Detailed Explanation: Measures atmospheric pressure using mercury column height.\n\n9. A. Cohesive forces \n Detailed Explanation: Strong cohesion keeps particles closely packed in fixed positions in solids.\n\n10. A. Measuring cylinder \n Detailed Explanation: Graduated for direct volume reading of liquids; others measure length or mass.\n\n11. A. 5 kg \n Detailed Explanation: Weight = mg; using g ≈ 10 m/s², m = W/g = 50/10 = 5 kg (approximate value often used in Form 1).\n\n12. B. Water \n Detailed Explanation: Capillary action draws water upward in plant stems against gravity.\n\n13. A. Upthrust \n Detailed Explanation: Buoyant force equals weight of displaced fluid, reducing apparent weight.\n\n14. C. No unit \n Detailed Explanation: It's a ratio of two densities, units cancel out.\n\n15. C. Rough surfaces \n Detailed Explanation: Roughness increases interlocking of surfaces, raising friction.\n\n16. D. Both B and C \n Detailed Explanation: 100°C = 373 K, but the question highlights equivalence at boiling point.\n\n17. C. Ink rising in a blotting paper \n Detailed Explanation: Adhesion between ink and paper overcomes gravity, causing rise.\n\n18. B. P = ρgh \n Detailed Explanation: Hydrostatic pressure depends on density, gravity, and depth.\n\n19. B. Low and base wide \n Detailed Explanation: Low CG makes it harder to topple; wide base increases support area.\n\n20. C. Greater than 1 \n Detailed Explanation: Density > water density means weight > upthrust for same volume, so sinks.\n\nSubtotal: 20 marks\n\n### Section B: Short Answer Questions (40 Marks)\n\n21. (4 marks) \n Answer: Examples: Wear protective gear (goggles), no running/playing, handle glassware carefully, report spills/accidents immediately. \n Detailed Explanation: Safety rules prevent accidents and ensure proper learning environment.\n\n22. (6 marks) \n Answer: Solids: fixed shape/volume, particles vibrate in place; Liquids: fixed volume but take container shape, particles slide; Gases: no fixed shape/volume, particles far apart and move randomly. \n Detailed Explanation: Kinetic theory explains state differences by particle arrangement and motion energy.\n\n23. (2 marks) \n Answer: °C = K - 273 = 300 - 273 = 27°C. \n Detailed Explanation: Kelvin is absolute scale; conversion shifts zero point by 273.\n\n24. (4 marks) \n Answer: Volume = 2 × 5 × 10 = 100 cm³; Density = mass/volume = 400/100 = 4 g/cm³. \n Detailed Explanation: Regular shape allows direct volume calculation by dimensions.\n\n25. (3 marks) \n Answer: Within elastic limit, extension ∝ force; F = ke (k=constant, e=extension). \n Detailed Explanation: Basis for springs in weighing machines.\n\n26. (3 marks) \n Answer: Sharp knife has smaller contact area → higher pressure (P=F/A) → easier cutting. \n Detailed Explanation: Pressure concept applied to tools.\n\n27. (4 marks) \n Answer: Relative density = density of object / density of water. Floats if <1, sinks if >1, suspends if =1. \n Detailed Explanation: Unitless ratio predicts behavior in water.\n\n28. (3 marks) \n Answer: Upthrust = weight in air - apparent weight = 80 - 60 = 20 N. \n Detailed Explanation: Directly from Archimedes' principle.\n\n29. (3 marks) \n Answer: Insects walk on water, soap bubbles form, needles float on water surface. \n Detailed Explanation: Surface acts like stretched skin supporting light objects.\n\n30. (5 marks) \n Answer: Elastic limit: maximum stress before permanent deformation. Plasticity: ability to permanently deform without breaking. \n Detailed Explanation: Explains material behavior beyond elastic region.\n\nSubtotal: 40 marks\n\n### Section C: Structured/Essay Questions (40 Marks)\n(Answer any two – 20 marks each)\n\n31. Full Detailed Answer:\n (a) Pour water into measuring cylinder, record volume V1. Tie irregular solid with string, immerse fully without touching sides, record V2. Volume of solid = V2 - V1. Then density = mass/volume.\n (b) Volume displaced = 50 cm³ = volume of stone; mass = 200 g; density = 200 g / 50 cm³ = 4 g/cm³.\n (c) Low center of gravity; wide base area.\n (d) Wide tyres: larger base for stability and better grip; low body: lowers CG to prevent toppling at high speeds.\n \n Detailed Explanation: Stability principles applied in vehicle design for safety.\n\n32. Full Detailed Answer:\n (a) Pressure transmitted equally throughout confined fluid. Applications: hydraulic lifts/jacks, vehicle braking systems.\n (b) Useful: enables walking (grip), vehicle braking, writing. Harmful: causes wear in engines, energy loss as heat, slows motion.\n (c) Use lubricants (reduce contact), ball bearings/rollers (rolling friction < sliding), streamlining (reduce air resistance).\n \n Detailed Explanation: Friction management improves efficiency and longevity of machines.\n\n33. Full Detailed Answer:\n (a) Cohesion: attraction between similar molecules; adhesion: between different. In water-glass: adhesion > cohesion → liquid rises (capillarity).\n (b) Mercury: cohesion > adhesion → does not wet glass → convex meniscus → depression.\n (c) Clean needle, place gently on clean water surface; it floats supported by surface tension.\n (d) Water transport in plants (xylem), absorption in soil/towels.\n \n Detailed Explanation: Intermolecular forces explain everyday phenomena like plant nutrition.\n\nGrand Total: 100 marks"
}
}
}
