{
"FTNA-SERIES3": {
"CHEMISTRY": {
"chapter_title": "Chemistry Form Two - FTNA 2025 Sample Examination",
"content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n032 CHEMISTRY\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Calculators and cellular phones are not allowed in the examination room.\n7. Write your Assessment Number at the top right corner of every page.\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The smallest particle of an element that takes part in a chemical reaction is\n - A. atom\n - B. molecule\n - C. ion\n - D. compound\n\n   (ii) The process by which a solid changes directly into gas is called\n - A. evaporation\n - B. sublimation\n - C. condensation\n - D. melting\n\n   (iii) The chemical formula for water is\n - A. H₂O\n - B. CO₂\n - C. NaCl\n - D. O₂\n\n   (iv) The element with atomic number 11 is\n - A. carbon\n - B. sodium\n - C. chlorine\n - D. oxygen\n\n   (v) Acids turn blue litmus paper to\n - A. red\n - B. green\n - C. yellow\n - D. blue\n\n   (vi) The SI unit of temperature is\n - A. Celsius\n - B. Kelvin\n - C. Fahrenheit\n - D. Joule\n\n   (vii) A substance that speeds up a chemical reaction without being consumed is called\n - A. catalyst\n - B. reactant\n - C. product\n - D. enzyme\n\n   (viii) The number of protons in an atom is equal to its\n - A. atomic number\n - B. mass number\n - C. atomic mass\n - D. valency\n\n   (ix) The gas produced when dilute hydrochloric acid reacts with zinc is\n - A. hydrogen\n - B. oxygen\n - C. carbon dioxide\n - D. chlorine\n\n   (x) The pH of a neutral solution is\n - A. 7\n - B. 0\n - C. 14\n - D. 1\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Isotopes\n\n   (ii) Oxidation\n\n   (iii) Reduction\n\n   (iv) Electrolysis\n\n   (v) Alloy\n\n   List B\n\n   A. Loss of electrons\n\n   B. Atoms of the same element with different mass numbers\n\n   C. Mixture of metals\n\n   D. Gain of electrons\n\n   E. Decomposition using electricity\n\n3. (a) Define the term 'element'.\n\n   (b) Give the chemical symbol for the element with atomic number 8.\n\n4. (a) State the law of conservation of mass.\n\n   (b) Balance the following equation: Na + H₂O → NaOH + H₂\n\n5. (a) What is meant by 'valency'?\n\n   (b) Write the formula for the compound formed between magnesium and chlorine.\n\n6. (a) Draw a labelled diagram of a simple distillation apparatus.\n\n   (b) State two factors affecting the rate of diffusion.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. (a) Explain why sodium chloride has a high melting point.\n\n   (b) Calculate the relative molecular mass of carbon dioxide (C = 12, O = 16).\n\n8. (a) Define 'acid-base indicator' and give one example.\n\n   (b) Describe how to prepare a solution of sodium hydroxide.\n\n9. (a) What is meant by 'exothermic reaction'?\n\n   (b) Write a balanced equation for the combustion of methane.\n\n10. (a) Explain the difference between physical and chemical changes.\n\n    (b) Give two examples of each.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to show that air contains oxygen.\n\n    (b) A sample of chlorine gas contains isotopes with mass numbers 35 and 37. Explain what isotopes are.\n    (c) State three uses of chlorine.\n\n"
},
"Answers": {
"chapter_title": "Chemistry Form Two - FTNA 2025 Sample Examination Answers",
"content": "1. (i) A (ii) B (iii) A (iv) B (v) A (vi) B (vii) A (viii) A (ix) A (x) A\n\n2. (i) B (ii) A (iii) D (iv) E (v) C\n\n3. (a) An element is a substance made up of atoms of the same kind.\n\n (b) Oxygen (O)\n\n4. (a) Mass is neither created nor destroyed in a chemical reaction.\n\n (b) 2Na + 2H₂O → 2NaOH + H₂\n\n5. (a) Valency is the combining power of an atom.\n\n (b) MgCl₂\n\n6. (a) [Diagram: flask with mixture, condenser, receiver, heat source]\n\n (b) Temperature, molecular mass, concentration gradient.\n\n7. (a) Strong ionic bonds between Na⁺ and Cl⁻ ions require high energy to break.\n\n (b) Mr = 12 + (16×2) = 44\n\n8. (a) Substance that changes colour in acidic or basic solutions. Example: litmus.\n\n (b) Dissolve sodium hydroxide pellets in water.\n\n9. (a) Reaction that releases heat.\n\n (b) CH₄ + 2O₂ → CO₂ + 2H₂O\n\n10. (a) Physical change: no new substance formed; chemical change: new substance formed.\n\n (b) Physical: melting ice, dissolving salt. Chemical: rusting iron, burning wood.\n\n11. (a) [Experiment: heat copper in air, forms black oxide, showing oxygen reacts]\n\n (b) Isotopes are atoms of the same element with different numbers of neutrons.\n\n (c) Water treatment, bleaching, disinfectant, making PVC.\n\nNote: This is a sample based on the typical FTNA Chemistry format (sections A, B, C), aligned with NECTA 2024/2025 standards and syllabus topics for Form 1-2. Actual papers may vary slightly but cover similar concepts."
}
}
}
