{
  "FTNA-SERIES6": {
    "BASIC_MATHEMATICS_SET_B": {
      "chapter_title": "Basic Mathematics Form Two - FTNA 2025 Sample Examination",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n041 BASIC MATHEMATICS\n(For Both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of ten (10) compulsory questions.\n2. Show clearly all the working and answers in the spaces provided.\n3. All writing must be in blue or black ink except drawings which must be in pencil.\n4. All communication devices, programmable calculators and any unauthorised materials are not allowed in the assessment room.\n5. Write your Assessment Number at the top right corner of every page.\n6. The mathematical tables published by NECTA, graph papers and mathematical/geometrical instruments may be used where necessary.\n\nQuestions:\n1. (a) List the first six multiples of 4 and 6 and find their LCM.\n   (b) Express 0.0789 to two significant figures and to three decimal places.\n\n2. (a) Convert 7.25 km to metres.\n   (b) Convert 4500 mg to grams.\n\n3. (a) In parallelogram ABCD, angle A = 110°. Find angle B, C and D.\n   (b) Find the perimeter and area of a square of side 7 cm.\n\n4. (a) Solve: 5x - 9 = 16.\n   (b) Solve the quadratic equation x^2 - 9x + 20 = 0 by factorization.\n\n5. (a) A mixture contains milk and water in ratio 5:2. If total mixture is 49 litres, find volumes of milk and water.\n   (b) A trader marks an item at 120,000 Tsh and gives a discount of 15%. Find the selling price.\n\n6. (a) Find equation of the line with slope -3 passing through (2, -1).\n   (b) Reflect point (3,4) in the x-axis. Give coordinates of the image.\n\n7. (a) Simplify: (9)^{1/2} × (27)^{1/3}.\n   (b) Solve for x: log_{10}(x) = 2.5.\n\n8. (a) State SSS condition for triangle congruence.\n   (b) Two similar triangles have corresponding sides in ratio 4:7. If area of the smaller is 64 cm², find area of the larger.\n\n9. (a) A right triangle has legs 5 cm and 12 cm. Find the hypotenuse.\n   (b) From a point 30 m from a pole, the angle of elevation to the top is 60°. Find the height of the pole (take tan60 = √3).\n\n10. (a) If U = {1,2,3,4,5,6,7,8}, A = {2,4,6,8}, B = {1,2,3,4}, find A ∪ B, A ∩ B, and complement of A in U.\n    (b) The marks of 9 students are: 12, 15, 18, 20, 22, 24, 26, 28, 30. Find the mean and median."
    },
    "Answers_SET_B": {
      "chapter_title": "Basic Mathematics Form Two - FTNA 2025 Sample Examination Answers",
      "content": "1. (a) Multiples of 4: 4,8,12,16,20,24. Multiples of 6: 6,12,18,24,30,36. Common multiples among listed: 12 and 24. Least common multiple (LCM) = 12.\n   Explanation: LCM is the smallest number appearing in both lists.\n\n   (b) 0.0789 to two significant figures: 0.079 (first two significant digits are 7 and 8; next digit 9 rounds 8 up to 9, so 0.079). To three decimal places: 0.079 (three decimal places are digits after decimal: 0.0789 → 0.079 after rounding).\n   Explanation: Significant figures count from first non-zero digit; decimal places count digits after the decimal point.\n\n2. (a) 7.25 km = 7.25 × 1000 = 7250 m.\n   (b) 4500 mg = 4500 ÷ 1000 = 4.5 g.\n   Explanation: 1 km = 1000 m; 1 g = 1000 mg.\n\n3. (a) In a parallelogram opposite angles are equal and adjacent angles are supplementary. Given angle A = 110°, so angle C = 110°. Angle B = 180 - 110 = 70°, angle D = 70°.\n   Explanation: Opposite angles equal; adjacent add to 180°.\n\n   (b) Square side = 7 cm. Perimeter = 4 × 7 = 28 cm. Area = 7 × 7 = 49 cm².\n   Explanation: Square formulas: perimeter 4s, area s².\n\n4. (a) 5x - 9 = 16 → 5x = 25 → x = 5.\n   (b) x² - 9x + 20 = 0. Find two numbers multiply to 20 and add to -9: -5 and -4. So (x - 5)(x - 4) = 0 → x = 5 or x = 4.\n   Explanation: Factorization finds roots where product = constant term and sum = coefficient of x.\n\n5. (a) Ratio parts = 5 + 2 = 7 parts. Each part = 49 ÷ 7 = 7 litres. Milk = 5 × 7 = 35 L. Water = 2 × 7 = 14 L.\n   (b) Discount = 15% of 120,000 = 0.15 × 120,000 = 18,000. Selling price = 120,000 - 18,000 = 102,000 Tsh.\n   Explanation: Percentage discount reduces marked price by given percent.\n\n6. (a) Line with slope m = -3 through (2,-1): use point-slope form y - y1 = m(x - x1). y + 1 = -3(x - 2) → y + 1 = -3x + 6 → y = -3x + 5.\n   (b) Reflection in x-axis: (x,y) → (x, -y). So (3,4) → (3,-4).\n   Explanation: Reflection across x-axis negates y-coordinate.\n\n7. (a) 9^{1/2} = 3. 27^{1/3} = 3. Product = 3 × 3 = 9.\n   Explanation: Square root of 9 is 3; cube root of 27 is 3.\n\n   (b) log_{10}(x) = 2.5 → x = 10^{2.5} = 10^{2} × 10^{0.5} = 100 × √10 ≈ 100 × 3.1623 = 316.23 (approx).\n   Explanation: Convert log equation to exponential form.\n\n8. (a) SSS: If three sides of one triangle are respectively equal to three sides of another triangle, the triangles are congruent.\n   (b) Linear ratio = 4:7. Area ratio = (4/7)^2 = 16/49. If smaller area = 64 cm², then 64 : Area_large = 16 : 49. So Area_large = 64 × (49/16) = 4 × 49 = 196 cm².\n   Explanation: Areas scale by square of linear scale factor.\n\n9. (a) Hypotenuse² = 5² + 12² = 25 + 144 = 169 → hypotenuse = √169 = 13 cm.\n   (b) tan60° = h/30. tan60° = √3. So h = 30 × √3 ≈ 30 × 1.732 = 51.96 m (approx 51.96 m).\n   Explanation: Use tan = opposite/adjacent.\n\n10. (a) U = {1,2,3,4,5,6,7,8}. A = {2,4,6,8}. B = {1,2,3,4}. A ∪ B = {1,2,3,4,6,8}. A ∩ B = {2,4}. Complement of A in U = U - A = {1,3,5,7}.\n    (b) Mean = (12+15+18+20+22+24+26+28+30)/9 = 195/9 = 21.666... = 21.67 (to 2 d.p.). Median = middle value (5th value when sorted) = 22.\n   Explanation: Mean is average; median is middle value in ordered list."
    },
    "BUSINESS STUDIES": {
      "chapter_title": "Business Studies Form Two - FTNA 2025 Sample Examination",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n065 BUSINESS STUDIES\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of nine (9) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries fifteen (15) marks, section B forty (40) marks and section C carries forty-five (45) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Calculators and cellular phones are not allowed in the examination room.\n7. Write your Assessment Number at the top right corner of every page.\n\nSECTION A (15 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The activity of buying and selling goods and services is called\n - A. production\n - B. business\n - C. trade\n - D. commerce\n\n   (ii) A person who starts and manages a business is known as\n - A. manager\n - B. entrepreneur\n - C. employee\n - D. investor\n\n   (iii) The reward for entrepreneurship is\n - A. salary\n - B. interest\n - C. profit\n - D. rent\n\n   (iv) Goods produced for sale are called\n - A. commodities\n - B. services\n - C. assets\n - D. liabilities\n\n   (v) The process of creating goods and services is\n - A. distribution\n - B. production\n - C. consumption\n - D. exchange\n\n   (vi) A business owned by one person is called\n - A. partnership\n - B. sole proprietorship\n - C. company\n - D. cooperative\n\n   (vii) The main aim of a business is to\n - A. make loss\n - B. provide employment\n - C. make profit\n - D. help society\n\n   (viii) Capital is a factor of production that refers to\n - A. land\n - B. labour\n - C. man-made resources\n - D. entrepreneurship\n\n   (ix) Marketing involves\n - A. producing goods\n - B. promoting and selling goods\n - C. storing goods\n - D. transporting goods\n\n   (x) A budget is a\n - A. financial statement\n - B. plan of income and expenditure\n - C. record of sales\n - D. list of assets\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Sole trader\n\n   (ii) Partnership\n\n   (iii) Demand\n\n   (iv) Supply\n\n   (v) Price\n\n   List B\n\n   A. Amount of goods offered for sale\n\n   B. Business owned by one person\n\n   C. Amount consumers are willing to buy\n\n   D. Business owned by two or more people\n\n   E. Value of goods or services in money terms\n\nSECTION B (40 Marks)\nAnswer all questions in this section.\n\n3. (a) Define the term 'business'.\n\n   (b) State four importance of business in society.\n\n4. (a) Explain the meaning of 'entrepreneurship'.\n\n   (b) List five characteristics of a successful entrepreneur.\n\n5. (a) Differentiate between goods and services.\n\n   (b) Give five examples of goods and services.\n\n6. (a) What is meant by 'factors of production'?\n\n   (b) Describe the four factors of production.\n\nSECTION C (45 Marks)\nAnswer all questions in this section.\n\n7. Read the following case study and answer the questions that follow:\n   Mr. John started a small shop selling groceries in his village. He buys goods from wholesalers in town and sells them at a profit.\n\n   (a) Identify the type of business Mr. John is engaged in.\n\n   (b) Explain five challenges Mr. John might face in his business.\n\n   (c) Suggest three ways Mr. John can overcome these challenges.\n\n8. You have been tasked to prepare a simple business plan for starting a fruit selling business.\n\n   (a) Outline the components of a business plan.\n\n   (b) Describe how you would market your fruits.\n\n   (c) Explain the importance of a business plan.\n\n9. Consider a project where students in your school start a small poultry farm.\n\n   (a) Describe the steps involved in starting this project.\n\n   (b) Explain the benefits of such a project to the students and school.\n\n   (c) State three risks associated with the project and how to mitigate them.\n\n"
    },
    "BUAnswers": {
      "chapter_title": "Business Studies Form Two - FTNA 2025 Sample Examination Answers",
      "content": "1. (i) D (ii) B (iii) C (iv) A (v) B (vi) B (vii) C (viii) C (ix) B (x) B\n\n2. (i) B (ii) D (iii) C (iv) A (v) E\n\n3. (a) Business is the activity of producing, buying and selling goods and services to make a profit.\n\n (b) Provides goods/services, employment, income, economic growth, innovation.\n\n4. (a) Entrepreneurship is the process of starting and managing a business venture.\n\n (b) Innovative, risk-taking, hardworking, persistent, visionary.\n\n5. (a) Goods are tangible, services are intangible.\n\n (b) Goods: books, food, clothes, cars, phones. Services: teaching, banking, transport, healthcare, repair.\n\n6. (a) Resources used in production.\n\n (b) Land: natural resources; Labour: human effort; Capital: man-made aids; Entrepreneurship: organization and risk-bearing.\n\n7. (a) Retail trade.\n\n (b) Competition, lack of capital, theft, perishable goods, poor infrastructure.\n\n (c) Better marketing, secure loans, insurance, proper storage, improve roads.\n\n8. (a) Executive summary, description, market analysis, organization, products, marketing, financials.\n\n (b) Advertising, promotions, quality, location, pricing.\n\n (c) Guides operations, attracts investors, measures progress.\n\n9. (a) Idea generation, planning, resource mobilization, implementation, monitoring.\n\n (b) Learning skills, income generation, food supply, teamwork, responsibility.\n\n (c) Disease: vaccination; Market fluctuation: diversify; Theft: security.\n\nNote: This is a sample based on the official NECTA FTNA 2025 Business Studies (Vocational Stream) format from the 2025 vocational formats PDF. Questions cover business basics, entrepreneurship, production factors, and practical applications. Actual paper may vary in wording but follows the same structure."
    }
  }
}
