{
  "FTNA-SERIES4": {
    "BASIC_MATHEMATICS": {
      "chapter_title": "Basic Mathematics - Exam",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n041 BASIC MATHEMATICS\n(For Both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of ten (10) compulsory questions.\n2. Show clearly all the working and answers in the spaces provided.\n3. All writing must be in blue or black ink except drawings which must be in pencil.\n4. All communication devices, programmable calculators and any unauthorised materials are not allowed in the assessment room.\n5. Write your Assessment Number at the top right corner of every page.\n6. The mathematical tables published by the National Examinations Council of Tanzania, graph papers and mathematical/geometrical instruments may be used where necessary.\n\nQUESTIONS:\n\n1. (a) List the first ten multiples of 2 and 11, then find their least common multiple (LCM).\n   (b) Express 0.009876 correct to two significant figures and to four decimal places.\n\n2. (a) Convert 2.75 kilometers to meters and 5400 grams to kilograms.\n   (b) Approximate the value of 6789.432 to the nearest hundred and to two decimal places.\n\n3. (a) In a rhombus PQRS, angle P = 60°. Find the measures of angles Q, R, and S.\n   (b) Calculate the perimeter and area of a square with side 9 cm.\n\n4. (a) Solve for x in the equation 5x - 15 = 10.\n   (b) Factorize the quadratic equation x² - 10x + 21 = 0 and find its roots.\n\n5. (a) If the ratio of pens to pencils is 7:3 and there are 100 items in total, find the number of pens and pencils.\n   (b) A trader buys a phone for 200,000 Tsh and sells it at a 10% loss. Calculate the selling price and loss.\n\n6. (a) Find the equation of the line passing through points (0, 5) and (4, 9).\n   (b) Determine the image of point (-6, -2) after a reflection in the y-axis.\n\n7. (a) Simplify 64^{1/2} × 27^{2/3}.\n   (b) Solve for x in the equation log(x) + log(2) = log(10).\n\n8. (a) State the SAS (side-angle-side) condition for congruence of triangles.\n   (b) In similar triangles ABC and DEF, AB/DE = 3/4 and area of ABC = 36 cm². Find the area of DEF.\n\n9. (a) State Pythagoras theorem and use it to find the length of the hypotenuse in a right triangle with legs 8 cm and 15 cm.\n   (b) From a point 30 m away from a flagpole, the angle of elevation to the top is 45°. Calculate the height of the flagpole.\n\n10. (a) If set A = {2, 4, 6, 8, 10} and set B = {6, 8, 10, 12}, find A ∪ B, A ∩ B, and A - B.\n    (b) The marks of 9 students are: 30, 40, 50, 60, 70, 80, 90, 100, 40. Find the mean, median, and mode.\n"
    },
    "Answers": {
      "chapter_title": "Basic Mathematics - Answers",
      "content": "1. (a) Multiples of 2: 2,4,6,8,10,12,14,16,18,20. Multiples of 11: 11,22,33,44,55,66,77,88,99,110. LCM = 22.\n\n (b) Two significant figures: 0.0099. Four decimal places: 0.0099.\n\n2. (a) 2.75 km = 2750 m. 5400 g = 5.4 kg.\n\n (b) Nearest hundred: 6800. Two decimal places: 6789.43.\n\n3. (a) In a rhombus, opposite angles are equal. Angle P = 60°, so angle R = 60°. Angles Q and S = 120° each.\n\n (b) Perimeter = 4 × 9 = 36 cm. Area = 9² = 81 cm².\n\n4. (a) 5x - 15 = 10 → 5x = 25 → x = 5.\n\n (b) x² - 10x + 21 = (x-3)(x-7). Roots: x = 3, 7.\n\n5. (a) Total parts = 10. Each part = 100/10 = 10. Pens = 7×10 = 70. Pencils = 3×10 = 30.\n\n (b) Loss = 10% of 200,000 = 20,000. Selling price = 180,000 Tsh.\n\n6. (a) Slope = (9-5)/(4-0) = 4/4 = 1. Equation: y - 5 = 1(x - 0) → y = x + 5.\n\n (b) Reflection in y-axis: (x,y) → (-x,y). So (-6,-2) → (6,-2).\n\n7. (a) 64^{1/2} = 8. 27^{2/3} = (3^3)^{2/3} = 3^2 = 9. Product = 72.\n\n (b) log(x) + log(2) = log(10). → log(2x) = log(10). → 2x = 10 → x = 5.\n\n8. (a) SAS: If two sides and the included angle of one triangle equal two sides and the included angle of another, the triangles are congruent.\n\n (b) Ratio of sides = 3/4. Area ratio = (3/4)^2 = 9/16. Area DEF = 36 × (16/9) = 64 cm².\n\n9. (a) Pythagoras theorem: c² = a² + b². Hypotenuse = √(8² + 15²) = √(64+225) = √289 = 17 cm.\n\n (b) tan45° = h/30 → h = 30 m.\n\n10. (a) A ∪ B = {2,4,6,8,10,12}. A ∩ B = {6,8,10}. A - B = {2,4}.\n\n (b) Mean = (30+40+50+60+70+80+90+100+40)/9 = 560/9 ≈ 62.2. Median = middle of sorted list (30,40,40,50,60,70,80,90,100) → 60. Mode = 40 (appears twice).\n"
    },
    "BIOLOGY": {
      "chapter_title": "Biology - Examination",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n033 BIOLOGY\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Calculators and cellular phones are not allowed in the examination room.\n7. Write your Assessment Number at the top right corner of every page.\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The branch of biology that deals with the study of plants is called\n - A. zoology\n - B. botany\n - C. ecology\n - D. microbiology\n\n   (ii) The process by which plants make their own food is called\n - A. respiration\n - B. photosynthesis\n - C. digestion\n - D. excretion\n\n   (iii) The basic unit of life is\n - A. tissue\n - B. organ\n - C. cell\n - D. system\n\n   (iv) The pigment responsible for the green colour in plants is\n - A. chlorophyll\n - B. haemoglobin\n - C. melanin\n - D. xanthophyll\n\n   (v) The organelle responsible for protein synthesis is\n - A. mitochondrion\n - B. ribosome\n - C. nucleus\n - D. Golgi body\n\n   (vi) The transport of water and mineral salts in plants occurs through\n - A. phloem\n - B. xylem\n - C. stomata\n - D. epidermis\n\n   (vii) The process of cell division in body cells is called\n - A. meiosis\n - B. mitosis\n - C. binary fission\n - D. budding\n\n   (viii) The human skeleton is composed of\n - A. bones and cartilage\n - B. muscles and tendons\n - C. nerves and blood vessels\n - D. skin and hair\n\n   (ix) The enzyme that digests starch in the mouth is\n - A. pepsin\n - B. lipase\n - C. amylase\n - D. trypsin\n\n   (x) The gas produced during respiration is\n - A. oxygen\n - B. carbon dioxide\n - C. nitrogen\n - D. hydrogen\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Diffusion\n\n   (ii) Osmosis\n\n   (iii) Active transport\n\n   (iv) Photosynthesis\n\n   (v) Transpiration\n\n   List B\n\n   A. Movement of water molecules across a semi-permeable membrane\n\n   B. Loss of water vapour from leaves\n\n   C. Movement of molecules from high to low concentration\n\n   D. Process requiring energy to move substances against concentration gradient\n\n   E. Process by which green plants manufacture food\n\n3. (a) Define the term 'biology'.\n\n   (b) State two branches of biology.\n\n4. (a) Name the parts of a light microscope.\n\n   (b) Explain how to calculate magnification using a microscope.\n\n5. (a) What is meant by 'cell division'?\n\n   (b) Differentiate between mitosis and meiosis.\n\n6. (a) Draw a labelled diagram of a plant cell.\n\n   (b) State three differences between plant and animal cells.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. (a) Explain the role of chlorophyll in photosynthesis.\n\n   (b) Write the word equation for photosynthesis.\n\n8. (a) Define 'respiration' and state its importance.\n\n   (b) Describe the process of gaseous exchange in fish.\n\n9. (a) What is meant by 'transport in plants'?\n\n   (b) Explain how water moves from roots to leaves.\n\n10. (a) State the functions of the human digestive system.\n\n    (b) Describe the digestion of proteins in the stomach.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to show that carbon dioxide is necessary for photosynthesis.\n\n    (b) Explain why leaves appear green.\n    (c) State three factors affecting the rate of photosynthesis.\n\n"
    },
    "BAnswers": {
      "chapter_title": "Biology - Answers",
      "content": "1. (i) B (ii) B (iii) C (iv) A (v) B (vi) B (vii) B (viii) A (ix) C (x) B\n\n2. (i) C (ii) A (iii) D (iv) E (v) B\n\n3. (a) Biology is the scientific study of living organisms.\n\n (b) Botany, Zoology, Ecology, Microbiology.\n\n4. (a) Eyepiece, objective lens, stage, mirror, body tube, base, arm, coarse adjustment, fine adjustment, etc.\n\n (b) Magnification = eyepiece magnification × objective lens magnification.\n\n5. (a) Cell division is the process by which a cell divides into two or more daughter cells.\n\n (b) Mitosis: produces two identical daughter cells for growth and repair. Meiosis: produces four genetically different gametes for sexual reproduction.\n\n6. (a) [Diagram: cell wall, cell membrane, cytoplasm, nucleus, chloroplast, vacuole, etc.]\n\n (b) Plant cells have cell wall, chloroplasts, large vacuole; animal cells do not.\n\n7. (a) Chlorophyll absorbs light energy for photosynthesis.\n\n (b) 6CO₂ + 6H₂O → C₆H₁₂O₆ + 6O₂ (in presence of sunlight and chlorophyll)\n\n8. (a) Respiration is the breakdown of food to release energy. Importance: provides energy for life processes.\n\n (b) Gills in fish allow water to pass over them; oxygen diffuses in, CO₂ out.\n\n9. (a) Transport in plants is the movement of water, minerals, and food.\n\n (b) Water enters roots by osmosis, moves up xylem by transpiration pull and cohesion.\n\n10. (a) Ingestion, digestion, absorption, egestion.\n\n (b) Pepsin digests proteins into peptides in acidic medium.\n\n11. (a) [Experiment: destarch plant, cover leaf with potassium hydroxide, expose to light, test for starch]\n\n (b) Chlorophyll absorbs red and blue light, reflects green.\n\n (c) Light intensity, carbon dioxide concentration, temperature, water availability.\n\nNote: This is a sample based on the typical FTNA Biology format and syllabus topics for Form 1-2. Aligned with NECTA standards, covering cell biology, nutrition, respiration, transport, etc."
    }
  }
}
