{
  "FTNA-SERIES1": {
    "PHYSICS": {
      "chapter_title": "Physics Form Two - FTNA 2020 Sample Examination",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n031 PHYSICS\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Calculators and cellular phones are not allowed in the examination room.\n7. Write your Assessment Number at the top right corner of every page.\n8. Where necessary the following constants may be used:\n   Acceleration due to gravity, g = 10 m/s²\n   Density of water = 1 g/cm³ or 1000 kg/m³\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The SI unit of force is\n       -A. Joule\n       -B. Newton\n       -C. Watt\n       -D. Pascal\n\n   (ii) The property of matter which makes it resist any change in its state of rest or uniform motion is called\n       -A. momentum\n       -B. inertia\n       -C. energy\n       -D. power\n\n   (iii) The image formed by a plane mirror is\n       -A. real and inverted\n       -B. virtual and erect\n       -C. real and erect\n       -D. virtual and inverted\n\n   (iv) The process by which a liquid changes into gas without heating is called\n       -A. evaporation\n       -B. boiling\n       -C. condensation\n       -D. sublimation\n\n   (v) The instrument used to measure electric current is\n       -A. ammeter\n       -B. voltmeter\n       -C. ohmmeter\n       -D. galvanometer\n\n   (vi) The S.I unit of pressure is\n       -A. Pascal\n       -B. Newton\n       -C. Joule\n       -D. Watt\n\n   (vii) A body of mass 5 kg is moving with a velocity of 4 m/s. Its momentum is\n       -A. 20 kg m/s\n       -B. 9 kg m/s\n       -C. 1.25 kg m/s\n       -D. 0.8 kg m/s\n\n   (viii) The focal length of a concave mirror is\n       -A. positive\n       -B. negative\n       -C. zero\n       -D. infinite\n\n   (ix) The device which converts mechanical energy into electrical energy is\n       -A. dynamo\n       -B. motor\n       -C. transformer\n       -D. generator\n\n   (x) The quantity which remains constant in simple harmonic motion is\n       -A. velocity\n       -B. acceleration\n       -C. frequency\n       -D. amplitude\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Hooke's law\n\n   (ii) Archimedes' principle\n\n   (iii) Pascal's principle\n\n   (iv) Bernoulli's principle\n\n   (v) Newton's third law\n\n   List B\n\n   A. Pressure in a fluid is transmitted equally in all directions\n\n   B. Every action has an equal and opposite reaction\n\n   C. The upward buoyant force equals the weight of the fluid displaced\n\n   D. Stress is directly proportional to strain\n\n   E. Pressure decreases as speed increases in a fluid\n\n3. (a) Define the term 'pressure'.\n\n   (b) Calculate the pressure exerted by a force of 200 N on an area of 0.5 m².\n\n4. (a) State the law of conservation of energy.\n\n   (b) A car of mass 1000 kg is moving at 20 m/s. Calculate its kinetic energy.\n\n5. (a) What is meant by 'specific heat capacity'?\n\n   (b) How much heat is required to raise the temperature of 2 kg of water from 20°C to 100°C? (Specific heat capacity of water = 4200 J/kg°C)\n\n6. (a) Draw a diagram of a simple pendulum.\n\n   (b) State the factors affecting the period of a simple pendulum.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. (a) Explain why a steel ship floats on water while a steel needle sinks.\n\n   (b) A stone of mass 2 kg is dropped from a height of 45 m. Calculate its velocity just before hitting the ground. (g = 10 m/s²)\n\n8. (a) Define 'power' and state its SI unit.\n\n   (b) A machine lifts a load of 500 N through a height of 10 m in 20 s. Calculate the power developed.\n\n9. (a) What is meant by 'electromagnetic induction'?\n\n   (b) Describe how an electric bell works.\n\n10. (a) Explain the formation of rainbow.\n\n    (b) Draw a ray diagram showing the path of light through a convex lens.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to determine the focal length of a concave mirror.\n\n    (b) A concave mirror has a focal length of 20 cm. Calculate the position of the image when an object is placed 30 cm from the mirror.\n    (c) State three uses of concave mirrors.\n\n"
    },
    "Answers": {
      "chapter_title": "Physics Form Two - FTNA 2020 Sample Examination Answers",
      "content": "1. (i) B (ii) B (iii) B (iv) A (v) A (vi) A (vii) A (viii) A (ix) A (x) D\n\n2. (i) D (ii) C (iii) A (iv) E (v) B\n\n3. (a) Pressure is force per unit area.\n\n (b) P = F/A = 200 / 0.5 = 400 Pa\n\n4. (a) Energy can neither be created nor destroyed but can be changed from one form to another.\n\n (b) KE = (1/2)mv² = (1/2)×1000×(20)² = 200,000 J\n\n5. (a) Specific heat capacity is the amount of heat required to raise the temperature of 1 kg of a substance by 1°C.\n\n (b) Q = mcΔT = 2 × 4200 × 80 = 672,000 J\n\n6. (a) [Diagram of simple pendulum: bob, string, pivot]\n\n (b) Length of pendulum, acceleration due to gravity.\n\n7. (a) The ship displaces a volume of water whose weight is greater than its own weight due to its shape (Archimedes' principle). The needle displaces less water than its weight.\n\n (b) v² = u² + 2gs = 0 + 2×10×45 = 900 → v = 30 m/s\n\n8. (a) Power is the rate of doing work. Unit: Watt.\n\n (b) Work = Fd = 500×10 = 5000 J. Power = work/time = 5000/20 = 250 W\n\n9. (a) Production of electricity by changing magnetic field.\n\n (b) [Explanation: current through coil creates electromagnet, attracts armature, breaks circuit, spring returns, repeats]\n\n10. (a) Dispersion and refraction of sunlight in water droplets.\n\n (b) [Ray diagram: object, convex lens, principal axis, rays converging to image]\n\n11. (a) [Method: object at C, screen until sharp image, measure distances]\n\n (b) 1/f = 1/u + 1/v → 1/20 = 1/30 + 1/v → v = 60 cm (real image) (c) Shaving mirror, dentist mirror, reflecting telescope.\n\nNote: This is a sample based on typical FTNA 2020 Physics format and questions from reliable sources. Actual paper may vary slightly in wording but covers similar topics."
    }
  }
}
