{
  "FTNA-SERIES2": {
    "BASIC_MATHEMATICS": {
      "chapter_title": "Basic Mathematics Form Two - FTNA 2025 Sample Examination",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n041 BASIC MATHEMATICS\n(For Both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of ten (10) compulsory questions.\n2. Show clearly all the working and answers in the spaces provided.\n3. All writing must be in blue or black ink except drawings which must be in pencil.\n4. All communication devices, programmable calculators and any unauthorised materials are not allowed in the assessment room.\n5. Write your Assessment Number at the top right corner of every page.\n6. The mathematical tables published by the National Examinations Council of Tanzania, graph papers and mathematical/geometrical instruments may be used where necessary.\n\nQUESTIONS:\n\n1. (a) List the first ten multiples of 4 and 6, then find their least common multiple (LCM).\n   (b) Express 0.004567 correct to two significant figures and to three decimal places.\n\n2. (a) Convert 3.5 kilometers to meters and 4200 grams to kilograms.\n   (b) Approximate the value of 789.456 to the nearest ten and to one decimal place.\n\n3. (a) In a parallelogram ABCD, angle A = 65°. Find the measures of angles B, C, and D.\n   (b) Calculate the perimeter and area of a triangle with sides 6 cm, 8 cm, and 10 cm.\n\n4. (a) Solve for x in the equation 3x - 7 = 11.\n   (b) Factorize the quadratic equation x² + 7x + 12 = 0 and find its roots.\n\n5. (a) If the ratio of teachers to students in a class is 1:20 and there are 105 students, find the number of teachers.\n   (b) A trader buys a bicycle for 120,000 Tsh and sells it at a 25% profit. Calculate the selling price and profit.\n\n6. (a) Find the equation of the line passing through points (1, 2) and (3, 6).\n   (b) Determine the image of point (-4, 3) after a rotation of 90° anticlockwise about the origin.\n\n7. (a) Simplify 16^{3/4} × 9^{1/2}.\n   (b) Solve for x in the equation log(x - 2) = log(3) + log(x).\n\n8. (a) State the ASA (angle-side-angle) condition for congruence of triangles.\n   (b) In similar triangles XYZ and PQR, XY/PQ = 5/8 and area of XYZ = 80 cm². Find the area of PQR.\n\n9. (a) State Pythagoras theorem and use it to find the length of the hypotenuse in a right triangle with legs 9 cm and 12 cm.\n   (b) From a point 60 m away from a building, the angle of elevation to the top is 45°. Calculate the height of the building.\n\n10. (a) If set A = {2, 4, 6, 8} and set B = {4, 8, 10, 12}, find A ∪ B, A ∩ B, and A - B.\n    (b) The marks of 8 students are: 40, 50, 60, 70, 80, 90, 100, 50. Find the mean, median, and mode.\n"
    },
    "BAnswers": {
      "chapter_title": "Basic Mathematics Form Two - FTNA 2025 Sample Examination Answers",
      "content": "1. (a) Multiples of 4: 4,8,12,16,20,24,28,32,36,40. Multiples of 6: 6,12,18,24,30,36,42,48,54,60. LCM = 12. Explanation: The least common multiple is the smallest number appearing in both lists.\n\n (b) Two significant figures: 0.0046. Three decimal places: 0.005. Explanation: Significant figures count meaningful digits starting from the first non-zero.\n\n2. (a) 3.5 km = 3500 m. 4200 g = 4.2 kg. Explanation: Multiply km by 1000, divide g by 1000.\n\n (b) Nearest ten: 790. One decimal place: 789.5. Explanation: Rounding depends on the next digit.\n\n3. (a) In a parallelogram, opposite angles are equal and adjacent angles are supplementary. Angle A = 65°, so angle B = 115°, angle C = 65°, angle D = 115°.\n\n (b) Triangle sides 6,8,10 form a right triangle. Perimeter = 24 cm. Area = 1/2 × base × height = 1/2 × 6 × 8 = 24 cm².\n\n4. (a) 3x - 7 = 11 → 3x = 18 → x = 6.\n\n (b) x² + 7x + 12 = (x+3)(x+4). Roots: x = -3, -4.\n\n5. (a) Ratio 1:20 means 1 teacher for 20 students. 105 ÷ 20 = 5.25 ≈ 6 teachers.\n\n (b) Profit = 25% of 120,000 = 30,000. Selling price = 150,000 Tsh.\n\n6. (a) Slope = (6-2)/(3-1) = 4/2 = 2. Equation: y - 2 = 2(x - 1) → y = 2x.\n\n (b) Rotation 90° anticlockwise: (x,y) → (-y,x). So (-4,3) → (-3,-4).\n\n7. (a) 16^{3/4} = (2^4)^{3/4} = 2^3 = 8. 9^{1/2} = 3. Product = 24.\n\n (b) log(x - 2) = log(3) + log(x) → log(x - 2) = log(3x). So x - 2 = 3x → 2x = -2 → x = -1 (not valid since log requires positive). No solution.\n\n8. (a) ASA: If two angles and the included side of one triangle equal two angles and the included side of another, the triangles are congruent.\n\n (b) Ratio of sides = 5/8. Area ratio = (5/8)^2 = 25/64. Area PQR = 80 × (64/25) = 204.8 cm².\n\n9. (a) Pythagoras theorem: c² = a² + b². Hypotenuse = √(9² + 12²) = √(81+144) = √225 = 15 cm.\n\n (b) tan45° = h/60 → h = 60 m.\n\n10. (a) A ∪ B = {2,4,6,8,10,12}. A ∩ B = {4,8}. A - B = {2,6}.\n\n (b) Mean = (40+50+60+70+80+90+100+50)/8 = 540/8 = 67.5. Median = middle of sorted list (40,50,50,60,70,80,90,100) → (60+70)/2 = 65. Mode = 50 (appears twice).\n\nExplanation: Mean is average, median is middle value, mode is most frequent.\n"
    },
    "PHYSICS": {
      "chapter_title": "Physics Form Two - FTNA 2025 Sample Examination Series 2",
      "content": "THE UNITED REPUBLIC OF TANZANIA\nNATIONAL EXAMINATIONS COUNCIL OF TANZANIA\nFORM TWO NATIONAL ASSESSMENT\n031 PHYSICS\n(For both School and Private Candidates)\nTime: 2:30 Hours\n\nInstructions:\n1. This paper consists of sections A, B and C with a total of ten (10) questions.\n2. Answer all questions in the spaces provided.\n3. Section A carries thirty (30) marks, section B fifty (50) marks and section C carries twenty (20) marks.\n4. All answers must be written in the spaces provided.\n5. All writing must be in blue or black ink except diagrams which must be in pencil.\n6. Calculators and cellular phones are not allowed in the examination room.\n7. Write your Assessment Number at the top right corner of every page.\n8. Where necessary the following constants may be used:\n   Acceleration due to gravity, g = 10 m/s²\n   Density of water = 1 g/cm³ or 1000 kg/m³\n\nSECTION A (30 Marks)\nAnswer all questions in this section.\n\n1. For each of the items (i) - (x), choose the correct answer from among the given alternatives and write its letter beside the item number.\n\n   (i) The SI unit of work is\n - A. Newton\n - B. Joule\n - C. Watt\n - D. Pascal\n\n   (ii) The tendency of a body to continue in its state of rest or uniform motion is known as\n - A. momentum\n - B. inertia\n - C. force\n - D. acceleration\n\n   (iii) A real image formed by a lens is always\n - A. erect\n - B. virtual\n - C. inverted\n - D. magnified\n\n   (iv) The change of state from gas to liquid is called\n - A. evaporation\n - B. condensation\n - C. boiling\n - D. sublimation\n\n   (v) The instrument used to measure potential difference is\n - A. ammeter\n - B. voltmeter\n - C. galvanometer\n - D. ohmmeter\n\n   (vi) The SI unit of energy is\n - A. Newton\n - B. Watt\n - C. Joule\n - D. Pascal\n\n   (vii) A body of mass 10 kg accelerates at 2 m/s². The force acting on it is\n - A. 5 N\n - B. 20 N\n - C. 0.2 N\n - D. 12 N\n\n   (viii) The image formed by a convex lens when the object is beyond 2F is\n - A. virtual and erect\n - B. real and inverted\n - C. virtual and inverted\n - D. real and erect\n\n   (ix) The device that converts electrical energy into mechanical energy is\n - A. generator\n - B. motor\n - C. transformer\n - D. dynamo\n\n   (x) In simple harmonic motion, the restoring force is proportional to\n - A. velocity\n - B. displacement\n - C. acceleration\n - D. time\n\n2. Match the items in List A with the responses in List B by writing the letter of the correct response beside the item number in the table provided.\n\n   List A\n\n   (i) Newton's first law\n\n   (ii) Boyle's law\n\n   (iii) Ohm's law\n\n   (iv) Snell's law\n\n   (v) Faraday's law\n\n   List B\n\n   A. The induced emf is proportional to the rate of change of magnetic flux\n\n   B. Pressure times volume is constant at constant temperature\n\n   C. A body continues in its state of rest or uniform motion unless acted upon by a force\n\n   D. Current is directly proportional to voltage at constant temperature\n\n   E. The ratio of sine of angle of incidence to sine of angle of refraction is constant\n\n3. (a) Define the term 'momentum'.\n\n   (b) Calculate the momentum of a 50 kg object moving at 8 m/s.\n\n4. (a) State the principle of moments.\n\n   (b) A see-saw is in equilibrium with a 60 kg child sitting 2 m from the pivot and a 40 kg child sitting on the other side. Calculate the distance of the 40 kg child from the pivot.\n\n5. (a) What is meant by 'latent heat of fusion'?\n\n   (b) Calculate the heat required to melt 5 kg of ice at 0°C. (Latent heat of fusion of ice = 334,000 J/kg)\n\n6. (a) Draw a labelled diagram of a simple hydraulic press.\n\n   (b) State two applications of hydraulic machines.\n\nSECTION B (50 Marks)\nAnswer all questions in this section.\n\n7. (a) Explain why a balloon filled with helium rises in air.\n\n   (b) A ball is thrown vertically upwards with an initial velocity of 30 m/s. Calculate the maximum height reached. (g = 10 m/s²)\n\n8. (a) Define 'mechanical advantage' and state its formula.\n\n   (b) A lever lifts a load of 400 N with an effort of 100 N. Calculate its mechanical advantage.\n\n9. (a) What is meant by 'alternating current'?\n\n   (b) Describe the working principle of a transformer.\n\n10. (a) Explain how a plane mirror forms a virtual image.\n\n    (b) Draw a ray diagram to show the formation of an image by a plane mirror.\n\nSECTION C (20 Marks)\nAnswer question 11.\n\n11. (a) Describe an experiment to verify the law of reflection of light.\n\n    (b) A plane mirror is placed 50 cm from an object. Calculate the position of the image.\n    (c) State three characteristics of the image formed by a plane mirror.\n\n"
    },
    "PAnswers": {
      "chapter_title": "Physics Form Two - FTNA 2025 Sample Examination Series 2 Answers",
      "content": "1. (i) B (ii) B (iii) C (iv) B (v) B (vi) C (vii) B (viii) B (ix) B (x) B\n\n2. (i) C (ii) B (iii) D (iv) E (v) A\n\n3. (a) Momentum is the product of mass and velocity.\n\n (b) p = mv = 50 × 8 = 400 kg m/s\n\n4. (a) The sum of clockwise moments equals the sum of anticlockwise moments about the pivot.\n\n (b) Clockwise moment = anticlockwise moment → 60 × 2 = 40 × d → d = 120 / 40 = 3 m\n\n5. (a) The amount of heat required to change 1 kg of a substance from solid to liquid at constant temperature.\n\n (b) Q = mL = 5 × 334,000 = 1,670,000 J\n\n6. (a) [Diagram: two pistons connected by fluid, effort on small piston, load on large piston]\n\n (b) Hydraulic jack, hydraulic brake system, hydraulic press.\n\n7. (a) Helium is less dense than air, so buoyant force is greater than weight (Archimedes' principle).\n\n (b) At max height, v = 0 → v² = u² - 2gh → 0 = 900 - 2×10×h → h = 900/20 = 45 m\n\n8. (a) Mechanical advantage is the ratio of load to effort. MA = Load / Effort.\n\n (b) MA = 400 / 100 = 4\n\n9. (a) Current that changes direction periodically.\n\n (b) [Explanation: primary coil induces emf in secondary coil via changing magnetic field, V_s / V_p = N_s / N_p]\n\n10. (a) Light rays reflect according to the law of reflection; rays appear to come from behind the mirror.\n\n (b) [Ray diagram: incident ray, reflected ray, normal, virtual image behind mirror]\n\n11. (a) [Method: use plane mirror, pins for incident and reflected rays, measure angles]\n\n (b) Image is 50 cm behind the mirror.\n\n (c) Virtual, erect, same size as object, laterally inverted.\n\nNote: This is a new sample series based on the typical FTNA 2025 Physics format, covering Form 1 and 2 topics. Questions are varied but aligned with NECTA standards."
    }
  }
}
