{
      "TERMINAL EXAMS-SERIES1": {
        "PHYSICS": {
          "chapter_title": "Physics Form 1 - Terminal Examination",
          "content": "**Time: 2 Hours 30 Minutes**  \n**Total Marks: 100**\n\n## Section A: Multiple Choice (20 marks)\nAnswer all questions. Each question carries 1 mark.\n\n1. The study of matter in relation to energy is called:\n\n   A. Chemistry\n   B. Biology\n   C. Physics\n   D. Geography\n\n2. Anything that has mass and occupies space is known as:\n\n   A. Energy\n   B. Force\n   C. Matter\n   D. Power\n\n3. The SI unit of length is:\n\n   A. Kilogram\n   B. Second\n   C. Metre\n   D. Newton\n\n4. The force that opposes motion between two surfaces in contact is:\n\n   A. Gravitational force\n   B. Friction\n   C. Magnetic force\n   D. Tension\n\n5. Density is calculated as:\n\n   A. Volume / Mass\n   B. Mass / Volume\n   C. Force / Area\n   D. Pressure / Force\n\n6. The upward force exerted by a fluid on an object immersed in it is called:\n\n   A. Friction\n   B. Upthrust\n   C. Gravity\n   D. Tension\n\n7. Pressure in liquids increases with:\n\n   A. Decrease in depth\n   B. Increase in depth\n   C. Increase in area\n   D. Decrease in density\n\n8. Elasticity is the ability of a material to:\n\n   A. Break easily\n   B. Return to original shape after deformation\n   C. Float in water\n   D. Conduct heat\n\n9. The three states of matter are:\n\n   A. Solid, liquid, gas\n   B. Solid, water, air\n   C. Ice, water, steam\n   D. Metal, plastic, wood\n\n10. A vernier caliper is used to measure:\n\n    A. Time\n    B. Mass\n    C. Small lengths accurately\n    D. Temperature\n\n11. The SI unit of mass is:\n    A. Newton\n    B. Kilogram\n    C. Gram\n    D. Pound\n\n12. The instrument for measuring temperature is:\n\n    A. Barometer\n    B. Thermometer\n    C. Hydrometer\n    D. Manometer\n\n13. The center of gravity is:\n\n    A. The point where gravity acts\n    B. The balance point\n    C. Both A and B\n    D. None\n\n14. Surface tension explains why:\n\n    A. Drops are spherical\n    B. Objects float\n    C. Liquids freeze\n    D. Gases expand\n\n15. Relative density is:\n\n    A. Density of substance / density of water\n    B. Mass / volume\n    C. Weight / upthrust\n    D. None\n\n16. The law of elasticity is stated by:\n\n    A. Newton\n    B. Hooke\n    C. Archimedes\n    D. Pascal\n\n17. Pascal's principle is used in:\n\n    A. Hydraulic press\n    B. Barometer\n    C. Thermometer\n    D. Spring\n\n18. The unit of pressure is:\n\n    A. Newton\n    B. Pascal\n    C. Joule\n    D. Watt\n\n19. Kinetic theory explains:\n\n    A. Behavior of matter\n    B. Forces\n    C. Energy\n    D. Light\n\n20. Measurement of time is in:\n\n    A. Meters\n    B. Seconds\n    C. Kilograms\n    D. Amperes\n\n## Section B: Short Answer Questions (40 marks)\n\n21. Define Physics and mention three branches of Physics. (5 marks)\n\n22. Explain why Physics is important in daily life (give 4 examples). (4 marks)\n\n23. Convert 50°C to Kelvin scale. (2 marks)\n\n24. A body has mass 2 kg and volume 0.5 m³. Calculate its density. (3 marks)\n\n25. State Archimedes' Principle. (3 marks)\n\n26. Differentiate between mass and weight. (4 marks)\n\n27. Explain how friction can be reduced in machines. (4 marks)\n\n28. A stone of weight 10 N is fully immersed in water. If upthrust is 4 N, calculate apparent weight. (3 marks)\n\n29. Define pressure and state its formula. (3 marks)\n\n30. Explain surface tension with one example. (5 marks)\n\n## Section C: Structured/Essay Questions (40 marks)\nAnswer any two questions.\n\n31. (a) Describe the structure of matter using kinetic theory. (6 marks)\n\n    (b) Explain adhesion and cohesion with examples. (6 marks)\n\n    (c) What is capillarity? Give one application. (3 marks)\n\n    (d) Explain why a balloon filled with air floats in water but sinks when deflated. (5 marks)\n\n32. (a) Explain how to measure volume of an irregular object using displacement method. (6 marks)\n\n    (b) A density bottle has mass 20 g empty and 70 g full of water. When full of oil, mass is 62 g. Calculate density of oil. (Density of water = 1 g/cm³) (9 marks)\n\n    (c) Describe the use of a micrometer screw gauge. (5 marks)\n\n33. (a) State the law of flotation. (4 marks)\n\n    (b) Explain why a ship floats while a needle sinks in water. (6 marks)\n\n    (c) Describe a simple experiment to verify Archimedes' Principle. (5 marks)\n\n    (d) What factors affect the upthrust on an object in a fluid? (5 marks)"
        },
        "Answers": {
          "chapter_title": "Physics Form 1 - Answers",
          "content": "## Section A: Multiple Choice (1 mark each)\n\n1. C. Physics\n   \n**Explanation**: Physics is the branch of science that specifically deals with the properties of matter and its interactions with energy, unlike the other options which focus on different aspects like living organisms (Biology) or elements (Chemistry).\n\n2. C. Matter\n   \n**Explanation**: Matter is defined as any substance that has mass and occupies space (volume), distinguishing it from energy or force.\n\n3. C. Metre\n   \n**Explanation**: The International System of Units (SI) standardizes metre as the base unit for length measurements.\n\n4. B. Friction\n   \n**Explanation**: Friction is the resistive force that occurs when two surfaces slide or attempt to slide across each other, opposing relative motion.\n\n5. B. Mass / Volume\n   \n**Explanation**: Density measures how compact matter is, calculated by dividing the mass of an object by its volume, which indicates how much mass is packed in a given space.\n\n6. B. Upthrust\n   \n**Explanation**: Upthrust, or buoyant force, is the upward push exerted by a fluid on an immersed object, counteracting gravity.\n\n7. B. Increase in depth\n   \n**Explanation**: According to the formula P = ρgh, pressure in a fluid increases linearly with depth (h) due to the weight of the fluid above.\n\n8. B. Return to original shape after deformation\n   \n**Explanation**: Elastic materials can be stretched or compressed and will regain their original form once the deforming force is removed, within their elastic limit.\n\n9. A. Solid, liquid, gas\n   \n**Explanation**: These are the fundamental states of matter, differing in particle arrangement and movement: solids (fixed), liquids (flowing), gases (expanding).\n\n10. C. Small lengths accurately\n    \n**Explanation**: Vernier calipers provide precise measurements of lengths up to 0.01 mm accuracy, ideal for small dimensions like diameters or thicknesses.\n\n11. B. Kilogram\n    \n**Explanation**: Kilogram is the SI base unit for mass, representing the amount of matter in an object.\n\n12. B. Thermometer\n    \n**Explanation**: Thermometers are designed to measure temperature by detecting changes in physical properties like expansion of liquids or electrical resistance.\n\n13. C. Both A and B\n    \n**Explanation**: The center of gravity is the single point where the entire weight of the object appears to act, and it's also the point of balance for stability.\n\n14. A. Drops are spherical\n    \n**Explanation**: Surface tension minimizes the surface area of liquids, causing free drops to form spheres, the shape with the least surface area for a given volume.\n\n15. A. Density of substance / density of water\n    \n**Explanation**: Relative density (specific gravity) compares the density of a substance to that of water, helping determine if it will sink or float.\n\n16. B. Hooke\n    \n**Explanation**: Hooke's law states that the extension of an elastic material is directly proportional to the applied force, within the elastic limit.\n\n17. A. Hydraulic press\n    \n**Explanation**: Pascal's principle states that pressure applied to a confined fluid is transmitted equally in all directions, which is the basis for hydraulic systems like presses.\n\n18. B. Pascal\n    \n**Explanation**: Pascal (Pa) is the SI unit for pressure, defined as one Newton per square meter (N/m²).\n\n19. A. Behavior of matter\n    \n**Explanation**: Kinetic theory describes matter as composed of particles in constant motion, explaining properties like diffusion, expansion, and state changes.\n\n20. B. Seconds\n    \n**Explanation**: Second is the SI base unit for time, used in all scientific measurements involving duration or intervals.\n\n(Allocate 1 mark for each correct choice. Total 20 marks)\n\n## Section B: Short Answer (Marks as indicated)\n\n21. **Definition**: Physics is the scientific study of matter, its properties, and how it interacts with energy and forces. (2 marks)\n    **Branches**: Examples include Mechanics (study of motion and forces), Thermodynamics (study of heat and energy transfer), Optics (study of light and vision). (Any three relevant branches, 1 mark each; total 3 marks). **Explanation for student**: Understanding branches helps categorize physics topics for better learning.\n    Total 5 marks\n\n22. Physics is crucial as it explains natural phenomena and drives technological advancements. **Examples**: (1) In medicine, X-rays use physics principles for imaging bones. (2) In transportation, engines convert energy based on thermodynamics. (3) In communication, phones rely on electromagnetism for signals. (4) In energy production, solar panels convert light to electricity using photoelectric effect. (1 mark per example with brief reasoning). \n**Explanation**: These show how physics solves real-world problems.\n    Total 4 marks\n\n23. Kelvin = °C + 273, so 50°C = 50 + 273 = 323 K. (1 mark for formula, 1 mark for calculation). \n**Explanation**: Kelvin scale starts from absolute zero, avoiding negative temperatures in scientific calculations.\n    Total 2 marks\n\n24. Density = Mass / Volume = 2 kg / 0.5 m³ = 4 kg/m³. (1 mark for formula, 1 mark for calculation, 1 mark for unit). \n**Explanation**: This tells how heavy the material is per unit volume; higher density means more compact.\n    Total 3 marks\n\n25. Archimedes' Principle states that when a body is wholly or partially immersed in a fluid, it experiences an upward buoyant force (upthrust) equal to the weight of the fluid displaced by the body. (3 marks for full statement). \n**Explanation**: This principle explains why objects feel lighter in water and is key to understanding flotation.\n    Total 3 marks\n\n26. **Mass**: Scalar quantity measuring amount of matter in a body; constant everywhere; measured in kg. **Weight**: Vector quantity, force due to gravity (W = mg); varies with location; measured in Newtons. (2 marks per difference with examples). \n**Explanation**: Mass is intrinsic, while weight depends on gravitational pull, e.g., same mass on Moon has less weight.\n    Total 4 marks\n\n27. Friction can be reduced by: (1) Using lubricants like oil to create a slippery layer. (2) Employing ball bearings to replace sliding with rolling. (3) Smoothing surfaces to minimize roughness. (4) Streamlining shapes to reduce air resistance. (1 mark per method with brief how it works). \n**Explanation**: Reducing friction improves efficiency in machines by minimizing energy loss as heat.\n    Total 4 marks\n\n28. Apparent weight = Actual weight - Upthrust = 10 N - 4 N = 6 N. (1 mark for formula, 1 mark for calculation, 1 mark for unit). \n**Explanation**: The upthrust reduces the effective weight felt, making objects easier to lift in fluids.\n    Total 3 marks\n\n29. **Definition**: Pressure is the force applied per unit area on a surface. **Formula**: P = Force (F) / Area (A). (2 marks for definition, 1 mark for formula). \n**Explanation**: It explains why sharp objects penetrate easily (small area, high pressure).\n    Total 3 marks\n\n30. \n**Explanation**: Surface tension is the property of a liquid's surface that makes it behave like a stretched elastic membrane due to cohesive forces between molecules. **Example**: Water striders (insects) can walk on water without sinking because surface tension supports their weight. (3 marks for explanation, 2 marks for example with reasoning). **Student note**: This force pulls surface molecules inward, minimizing surface area.\n    Total 5 marks\n\n## Section C: (20 marks per question chosen)\n\n31. (a) Kinetic theory states that matter consists of tiny particles (atoms/molecules) in constant random motion. In solids, particles vibrate in fixed positions; in liquids, they slide over each other; in gases, they move freely at high speeds. (6 marks: 2 for theory, 4 for states description). \n**Explanation**: This model helps predict how matter changes state with temperature.\n    (b) **Adhesion**: Attractive force between unlike molecules, e.g., water sticking to glass (causing wetting). **Cohesion**: Attractive force between like molecules, e.g., mercury forming droplets (non-wetting). (3 marks each, including examples). \n**Explanation**: These forces determine how liquids interact with surfaces.\n    (c) Capillarity is the rise or fall of a liquid in a narrow tube due to surface tension and adhesion/cohesion balance. **Application**: Absorption of water by plant roots via capillary action in soil. (2 marks definition, 1 mark application). \n**Explanation**: In thin tubes, adhesion pulls liquid up if it wets the surface.\n    (d) Inflated balloon displaces more water (larger volume), creating upthrust equal to its weight (floats). Deflated has small volume, upthrust < weight (sinks). (5 marks step-by-step). \n**Explanation**: Demonstrates Archimedes' principle in action.\n\n32. (a) Fill a measuring cylinder with water and note initial volume (V1). Tie the irregular object with string and immerse it fully. Note new volume (V2). Volume of object = V2 - V1. (6 marks: steps + precautions like no air bubbles). \n**Explanation**: Displacement method uses the volume of water pushed aside equals object's volume.\n    (b) Mass of water = 70 g - 20 g = 50 g. Volume of bottle = mass water / density water = 50 g / 1 g/cm³ = 50 cm³. Mass of oil = 62 g - 20 g = 42 g. Density of oil = mass oil / volume = 42 g / 50 cm³ = 0.84 g/cm³. (9 marks: each step 2-3 marks). \n**Explanation**: Density bottle measures precise volume for accurate density calculation.\n    (c) Micrometer screw gauge measures small thicknesses/diameters accurately (up to 0.01 mm). Steps: Close jaws on object, read main scale + thimble scale x least count. (5 marks: use + steps). \n**Explanation**: Better precision than vernier for tiny measurements.\n\n33. (a) The law of flotation states that a floating body displaces a volume of fluid whose weight is equal to the weight of the body. (4 marks for full statement). \n**Explanation**: Ensures balance between weight and upthrust for floating.\n    (b) Ship has large hollow structure, displacing huge volume of water to create upthrust equal to its weight (floats). Needle is dense and small, displacing little water so upthrust < weight (sinks). (6 marks: comparison + principle). \n**Explanation**: Density and shape affect flotation.\n    (c) Weigh object in air (W1). Immerse in water and weigh (W2). Apparent loss = W1 - W2 (upthrust). Collect displaced water, weigh it (should equal upthrust). (5 marks: steps + conclusion). \n**Explanation**: Verifies upthrust = weight of displaced fluid.\n    (d) Factors: Density of fluid (higher = more upthrust), volume immersed (more = higher), gravity (affects weight). Not object's density directly. (5 marks: 1-2 per factor with reason). \n**Explanation**: These determine buoyant force magnitude.\n\n**Total: 100 marks**"
      }
    }
}
